[
    {
        "_id": "5b66c10e5a14fcc5840f8f4f",
        "trainers": [
            {
                "id": "5b66c10ea236ab4f9598df32",
                "name": "Rosella Kramer",
                "avatar": "https://randomuser.me/api/portraits/men/22.jpg"
            },
            {
                "id": "5b66c10ed652b9e6eda4968c",
                "name": "Bryan Nichols",
                "avatar": "https://randomuser.me/api/portraits/women/51.jpg"
            },
            {
                "id": "5b66c10e07e4a433207a9d89",
                "name": "Rowe Velasquez",
                "avatar": "https://randomuser.me/api/portraits/women/68.jpg"
            },
            {
                "id": "5b66c10e05d9a3a5b6bae564",
                "name": "Estes Duke",
                "avatar": "https://randomuser.me/api/portraits/men/64.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=13",
        "date": "2018-10-29T07:04:13",
        "duration": 29,
        "title": "deserunt nostrud eu ipsum",
        "description": "Occaecat aute elit cupidatat aute adipisicing amet esse sit. Voluptate fugiat fugiat ullamco enim veniam incididunt culpa sunt consectetur. Cillum laborum culpa nostrud deserunt incididunt est enim in tempor dolore reprehenderit adipisicing. Elit et amet tempor occaecat quis laborum ullamco eiusmod non culpa minim nulla.\r\nUt adipisicing labore irure tempor ad ea nisi. Excepteur ut dolore irure duis amet eiusmod nulla ullamco mollit officia ex. Occaecat cupidatat elit eu ipsum anim excepteur dolore qui anim laborum. Proident exercitation in Lorem in nulla sit laboris proident elit consectetur dolor eiusmod amet ullamco. Eiusmod dolore do incididunt anim eiusmod aute proident ex sit sit Lorem elit duis. Consectetur commodo est id minim ex duis.\r\nLorem laboris proident aute sunt aute exercitation laboris ut sint elit labore eu. Consequat adipisicing occaecat proident sunt do aliquip veniam dolore occaecat sunt nostrud do ullamco cupidatat. Occaecat labore excepteur Lorem enim magna consequat consequat ex id ea minim. Sunt consequat proident labore eiusmod magna. Dolor dolor id ipsum aute excepteur nostrud irure laborum cillum. Non sint ad Lorem esse ea eiusmod laborum aliquip nisi duis. Elit qui elit do ullamco laborum nulla ut incididunt adipisicing ad deserunt laboris consectetur.\r\nMagna exercitation aute elit minim id labore fugiat quis deserunt dolore labore id dolor velit. Excepteur commodo cupidatat mollit in. Ut labore enim qui ea minim sit aliquip aute aliqua occaecat tempor. Esse in commodo mollit mollit nulla fugiat deserunt dolor ad do. Tempor aliquip tempor eu nulla duis qui. In quis anim reprehenderit aute commodo. Cupidatat enim Lorem amet aliquip qui consequat.\r\nMagna sit qui elit reprehenderit laboris culpa irure eiusmod ipsum officia officia. Culpa aliquip occaecat irure ipsum in voluptate. Proident id dolor cillum minim amet eu voluptate sint qui id. Nostrud dolore enim reprehenderit ex et occaecat laborum occaecat commodo esse voluptate duis. Tempor in cillum aute id aute reprehenderit est non in nisi incididunt cillum elit id.\r\n",
        "rating": 30,
        "language": "Fra",
        "difficulty": "Novice",
        "type": "Seminar",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e198180158692b680",
        "trainers": [
            {
                "id": "5b66c10ee1083c21a8f51ecb",
                "name": "Reyna Duncan",
                "avatar": "https://randomuser.me/api/portraits/men/10.jpg"
            },
            {
                "id": "5b66c10ea17e9f5ef9205800",
                "name": "Sykes Stafford",
                "avatar": "https://randomuser.me/api/portraits/men/64.jpg"
            },
            {
                "id": "5b66c10e165494ce1a426f01",
                "name": "Yates Morin",
                "avatar": "https://randomuser.me/api/portraits/men/15.jpg"
            },
            {
                "id": "5b66c10e44d89acd3b075aaa",
                "name": "Christina Reid",
                "avatar": "https://randomuser.me/api/portraits/women/2.jpg"
            },
            {
                "id": "5b66c10ee2ca05f40b03fba7",
                "name": "Bettye Stokes",
                "avatar": "https://randomuser.me/api/portraits/women/11.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=20",
        "date": "2018-12-16T07:21:04",
        "duration": 393,
        "title": "eu consectetur reprehenderit ullamco anim exercitation",
        "description": "Sit duis duis aute sit excepteur et. Irure eiusmod cupidatat laboris nulla aliqua irure labore labore. Aliquip ut occaecat ipsum qui quis non in dolore ut dolore sint exercitation. Ad sit in quis quis magna. Deserunt aute dolore consectetur proident qui fugiat exercitation tempor consectetur enim do do ad.\r\nUt eu ut deserunt laborum aliquip non excepteur ipsum. Nulla consequat quis deserunt excepteur consequat aliqua voluptate sunt aute nostrud. Minim culpa quis consequat adipisicing duis commodo eiusmod ad laborum nulla. Ea aute deserunt est do sit consequat anim sint. In ea mollit non voluptate officia in duis ullamco minim tempor minim in. Et laborum officia cillum aute anim voluptate nisi id Lorem sunt ut exercitation incididunt elit.\r\nCulpa laboris aliquip dolor qui voluptate exercitation tempor fugiat magna. Magna ea consequat laboris quis commodo et do sit duis minim exercitation. Eiusmod aute aliqua dolor enim minim cupidatat. Dolore commodo enim est deserunt non magna officia anim aliqua. Qui non elit elit veniam elit exercitation amet occaecat. Et elit adipisicing duis magna id sunt velit. Mollit fugiat quis cupidatat minim aliquip qui exercitation mollit reprehenderit anim adipisicing.\r\nOfficia officia est excepteur qui exercitation consequat labore do veniam do esse labore dolor id. Sint nostrud labore consectetur aliqua amet commodo. Culpa proident reprehenderit fugiat magna tempor occaecat quis consequat est amet reprehenderit Lorem ut. Anim esse laboris proident sunt incididunt velit culpa. Enim anim ex est nisi adipisicing et voluptate pariatur duis deserunt cillum dolore nulla. Culpa sunt quis aute et duis.\r\nEsse esse eu qui tempor occaecat ut. Laboris esse dolor voluptate enim reprehenderit ut et do esse culpa sunt laboris. Ut laborum sit occaecat deserunt laboris. In ad qui duis reprehenderit et veniam deserunt elit adipisicing nisi esse. Incididunt eiusmod ullamco in Lorem dolor. Ipsum id duis ea commodo. Deserunt velit commodo eiusmod consequat mollit sint dolor duis sint mollit adipisicing.\r\nSunt ad eiusmod commodo incididunt deserunt occaecat officia cupidatat magna sunt. Ea sunt exercitation id excepteur eu nulla veniam ad deserunt proident cillum elit. Nostrud anim velit nisi aliqua excepteur nisi et tempor velit Lorem non.\r\nSint voluptate laborum ut aliquip eiusmod sit pariatur ad. Eiusmod exercitation nulla irure deserunt labore sit incididunt fugiat non proident. Quis cillum sit id ut fugiat officia et. Sit duis sint nostrud non laboris qui. Sunt cupidatat esse dolor esse laboris ut magna tempor. In occaecat sit culpa nulla dolore ipsum sint nisi proident consectetur qui sint.\r\n",
        "rating": 12,
        "language": "Eng",
        "difficulty": "Intermediate",
        "type": "Video course",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ec3c1f23dd6c429f4",
        "trainers": [
            {
                "id": "5b66c10e3f8b7efde07f667b",
                "name": "Jensen Hodge",
                "avatar": "https://randomuser.me/api/portraits/men/25.jpg"
            },
            {
                "id": "5b66c10edc59f6f810526a9a",
                "name": "Pena Faulkner",
                "avatar": "https://randomuser.me/api/portraits/women/40.jpg"
            },
            {
                "id": "5b66c10efd47deabf6c048b4",
                "name": "Chan Estrada",
                "avatar": "https://randomuser.me/api/portraits/women/61.jpg"
            },
            {
                "id": "5b66c10e644093a29d2a3e63",
                "name": "Baxter Parsons",
                "avatar": "https://randomuser.me/api/portraits/men/4.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=3",
        "date": "2018-09-22T12:47:06",
        "duration": 453,
        "title": "incididunt id culpa ipsum ad do commodo exercitation nulla",
        "description": "Ad enim irure fugiat duis ex incididunt ipsum anim enim eiusmod tempor. Aute aliquip laborum cillum elit eu cupidatat velit velit amet est sit tempor Lorem. Do culpa nulla voluptate et laboris excepteur commodo ullamco dolor sint. Adipisicing irure consequat non ut adipisicing minim exercitation mollit in deserunt excepteur. Est magna ut Lorem minim pariatur eu cillum ipsum qui tempor excepteur est ad fugiat. Ipsum fugiat elit veniam proident reprehenderit exercitation dolor non exercitation ea ullamco nulla.\r\nElit incididunt qui deserunt exercitation ipsum consectetur nostrud in sunt nisi deserunt aliquip fugiat cillum. Aute dolore duis adipisicing et irure aute. Commodo tempor laborum proident nulla velit. Amet consectetur irure occaecat excepteur consequat exercitation exercitation nisi excepteur laboris. Elit dolor enim ipsum labore reprehenderit est enim incididunt nulla.\r\nMagna mollit ad aliquip voluptate sit in. Dolor do ipsum aute Lorem. Ea labore non amet non amet voluptate in elit commodo officia. Ad dolore sunt dolore Lorem sunt reprehenderit ea veniam fugiat ad Lorem cillum. Eu ex irure Lorem veniam aute do nostrud excepteur consectetur excepteur enim commodo enim sint.\r\nMinim amet magna et id elit duis laboris id cupidatat nostrud ex mollit quis. Ullamco laborum tempor fugiat ea consectetur ex do fugiat sunt occaecat ea adipisicing ea deserunt. Occaecat fugiat laborum dolor dolore consequat qui dolor. Ipsum nostrud reprehenderit ad est fugiat culpa.\r\nEsse Lorem commodo id occaecat eu aute. Non elit enim ullamco ipsum sint officia minim fugiat nostrud mollit sunt aute enim irure. Velit tempor nulla ipsum ut dolore sunt. Pariatur tempor sunt est proident. Sint laborum dolore cillum ex ullamco exercitation aliquip irure pariatur exercitation qui. Elit est labore consequat mollit non dolor deserunt mollit tempor dolor occaecat quis sit. Ad nulla commodo adipisicing id Lorem anim veniam enim quis cupidatat.\r\nConsequat magna reprehenderit eiusmod amet fugiat duis. Cupidatat do cupidatat exercitation irure duis enim duis proident occaecat. Duis officia elit consectetur velit. Minim qui magna deserunt incididunt do quis nostrud quis laboris consequat ad excepteur. Deserunt officia quis aliqua sunt cillum et proident ex ad sit labore in adipisicing minim.\r\nDeserunt labore voluptate in minim commodo do anim velit cillum sint. Dolor quis reprehenderit elit cillum non excepteur deserunt ut tempor. Aliquip amet mollit sint incididunt. Voluptate esse eu ad esse id cupidatat reprehenderit sit aute adipisicing est. Et nulla laborum eu ut consectetur minim id amet occaecat. Ad culpa dolor consequat sint ipsum.\r\nMagna sit Lorem laborum veniam duis officia consectetur non anim aliquip. Exercitation nisi voluptate elit veniam voluptate laborum exercitation eu nulla. Eiusmod non do consequat cupidatat in nisi qui fugiat.\r\nId magna qui non aliqua veniam labore ad reprehenderit in excepteur dolore proident. Magna velit velit sint laborum amet tempor non ea reprehenderit et. Sit tempor sunt tempor incididunt est aliqua tempor officia et.\r\nExercitation irure nisi adipisicing amet amet nulla anim irure laborum reprehenderit dolore anim ea veniam. Pariatur incididunt dolore aliqua magna qui elit in occaecat enim sint proident id. Qui ex incididunt fugiat et nostrud do consectetur velit anim adipisicing aliquip proident est laboris. Incididunt reprehenderit deserunt reprehenderit ex enim. Aliquip adipisicing sit exercitation exercitation. Deserunt consequat exercitation ullamco ad non exercitation commodo cillum nulla adipisicing est eu.\r\nVelit pariatur reprehenderit excepteur consectetur. Velit eu amet laboris est veniam mollit quis mollit ad dolore dolor aliquip. Officia qui velit do eiusmod fugiat officia. Magna cupidatat minim consectetur qui amet duis amet. Excepteur proident adipisicing nulla veniam elit anim laboris culpa.\r\nAliquip dolor consectetur commodo incididunt Lorem aliqua. Incididunt qui ex dolor nisi eiusmod exercitation Lorem irure adipisicing minim ex cupidatat. Et sint officia ex aliquip non minim consectetur in sit nulla do. Ex ad consequat exercitation do magna do occaecat excepteur est laboris sint et. Excepteur sit pariatur anim occaecat velit qui est fugiat reprehenderit.\r\nDolor eu proident anim adipisicing sint et velit velit magna amet labore aliqua cillum ad. Nulla excepteur dolor anim cupidatat eu amet quis excepteur adipisicing sunt. Non ad qui ipsum nulla ex id laborum eu adipisicing anim amet voluptate veniam. Reprehenderit ex magna id incididunt nostrud. Sint laborum quis anim ex esse excepteur anim duis cupidatat quis sint non et. Esse eu occaecat ipsum excepteur pariatur. Adipisicing occaecat officia ad fugiat dolore excepteur excepteur.\r\nLaboris laboris officia tempor dolore cillum elit cillum irure ad minim reprehenderit cillum proident quis. Incididunt tempor non tempor elit veniam eiusmod ullamco minim irure cupidatat mollit. Dolor deserunt tempor laboris ad.\r\nCommodo magna commodo cupidatat fugiat officia anim laboris. Et enim laboris reprehenderit nulla exercitation consequat nulla laboris enim anim laborum quis. Sit laboris veniam reprehenderit nisi veniam ipsum proident nulla eiusmod velit. Sit ipsum commodo nostrud ea. Cillum eiusmod aute elit exercitation incididunt culpa reprehenderit sint sit sit duis.\r\n",
        "rating": 27,
        "language": "Fra",
        "difficulty": "Expert",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10ee7492b81152abdd6",
        "trainers": [
            {
                "id": "5b66c10e326d1bac7e7476f6",
                "name": "Wilma Wright",
                "avatar": "https://randomuser.me/api/portraits/men/56.jpg"
            },
            {
                "id": "5b66c10eb3510e35e4cec2fc",
                "name": "Gamble Craft",
                "avatar": "https://randomuser.me/api/portraits/men/12.jpg"
            },
            {
                "id": "5b66c10e92732b20a736ed42",
                "name": "Snider Burris",
                "avatar": "https://randomuser.me/api/portraits/men/50.jpg"
            },
            {
                "id": "5b66c10e4f6e6376e9f72d2f",
                "name": "Silva Parks",
                "avatar": "https://randomuser.me/api/portraits/women/59.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=1",
        "date": "2018-08-22T07:40:53",
        "duration": 20,
        "title": "laborum veniam esse ut esse quis exercitation quis sit cupidatat",
        "description": "Velit deserunt voluptate ea Lorem sunt dolor sunt cupidatat labore exercitation. Cillum consequat dolor sunt dolor irure anim anim cupidatat ea labore enim. Ullamco et cillum aute occaecat dolore ipsum do eiusmod amet ea. Labore eiusmod tempor tempor laborum consequat velit amet nulla voluptate.\r\nReprehenderit ut ea mollit laboris labore excepteur in. Enim pariatur labore voluptate aliquip esse adipisicing dolore laborum dolor magna Lorem consectetur reprehenderit magna. Pariatur non esse velit nostrud aliquip nisi. Nisi eiusmod laboris sunt laboris laboris. Veniam elit esse culpa quis id. Tempor laborum labore commodo ad laborum ipsum dolore ea commodo.\r\nId incididunt cupidatat ad aute eiusmod ex cillum consectetur duis minim. Sunt in laboris ea quis ipsum consequat. Enim id id cupidatat exercitation Lorem Lorem incididunt. Deserunt amet incididunt quis quis elit sit mollit commodo dolor ex occaecat. Sint dolor qui in exercitation fugiat anim ea. Anim ut aute ex anim Lorem ad. Duis velit esse officia nostrud aliqua dolor in do.\r\nEsse reprehenderit cupidatat eiusmod velit anim adipisicing fugiat eu voluptate dolor consequat. Laborum voluptate in consectetur tempor. Magna dolor ipsum aliqua culpa proident excepteur esse ut proident ad occaecat. Commodo ex et aliqua mollit ex sunt nisi minim laboris minim in tempor pariatur. Magna minim qui occaecat mollit in duis ut eu veniam adipisicing ea cupidatat anim et. Esse dolore nulla labore ex elit ut proident ipsum culpa cupidatat nostrud pariatur occaecat est. Nulla labore est veniam cupidatat veniam proident.\r\nCupidatat esse non excepteur id. Laborum irure ipsum deserunt laboris esse enim. Voluptate qui id laborum minim ea ea ex enim. Duis pariatur sint dolore dolore ipsum. Sint commodo incididunt tempor cupidatat aute irure occaecat anim cupidatat commodo duis aliquip officia aliquip.\r\nOccaecat est Lorem pariatur ad excepteur mollit tempor do. Magna deserunt veniam culpa cupidatat incididunt commodo fugiat. Aute non minim enim labore voluptate. Velit mollit reprehenderit mollit esse aute dolore magna voluptate consectetur laboris culpa ad nulla aute. Excepteur eiusmod et ipsum elit officia nisi reprehenderit adipisicing quis incididunt. In id incididunt pariatur adipisicing ad adipisicing ullamco sunt id non.\r\nNostrud do velit aliquip ullamco ex. Officia cillum ad exercitation sit incididunt duis laborum sint laborum eiusmod ut. Eu incididunt veniam nisi nisi laboris occaecat. Excepteur fugiat occaecat est sunt proident ullamco aliquip velit et amet. Ex pariatur quis aute in et ex ad sit nisi ad quis amet duis non. Amet do amet non est.\r\nReprehenderit tempor enim dolore aute irure. Adipisicing dolore sit culpa minim ea anim pariatur reprehenderit excepteur. Cupidatat in dolor pariatur dolor ex mollit laborum proident ad reprehenderit. Esse ullamco deserunt sunt laboris qui enim sunt fugiat nulla in reprehenderit sit pariatur. Anim ea nulla sint qui veniam ea ipsum occaecat consectetur do nostrud occaecat. Esse elit sint ea proident nostrud eu magna occaecat. Ut culpa culpa sit ex.\r\nAnim proident mollit magna aliqua est ut ea irure cillum. Anim velit tempor adipisicing sint incididunt excepteur nulla dolore esse id aute laboris adipisicing fugiat. Ea fugiat dolor non cupidatat nulla aliquip. Ex nostrud tempor aute in dolor sint.\r\nUllamco adipisicing ea sunt dolor pariatur quis officia et mollit. Eu est sunt est cillum aliquip ipsum consequat do ea commodo cillum quis ipsum. Est ex voluptate commodo nostrud aute aliquip anim officia laborum. Consequat eiusmod reprehenderit mollit ullamco officia cupidatat fugiat ea proident. Consectetur laboris pariatur quis pariatur qui nulla exercitation velit tempor minim proident quis amet duis. Lorem pariatur tempor magna ullamco voluptate proident. Exercitation sint elit ullamco incididunt aliqua et esse et.\r\nAliquip do eu ipsum voluptate. Non fugiat incididunt tempor qui duis qui quis elit enim. Officia ad eu ut incididunt tempor dolore. Laborum dolor proident anim cillum amet minim Lorem qui nostrud. Dolor non nostrud officia mollit est. Elit sint reprehenderit duis irure anim ipsum nulla est eu. Est non enim ex ullamco tempor Lorem ea incididunt.\r\nDuis consectetur nulla voluptate excepteur irure. Lorem dolor non ex eu anim ad proident laborum ad mollit consectetur fugiat exercitation. Id excepteur excepteur eiusmod anim amet commodo ad anim. Non eiusmod duis pariatur dolore mollit magna elit ex cillum aliquip consequat ipsum.\r\n",
        "rating": 41,
        "language": "Esp",
        "difficulty": "For All",
        "type": "Seminar",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e7c98f10bfad24828",
        "trainers": [
            {
                "id": "5b66c10e72287fbbe518496a",
                "name": "Aguirre Harrington",
                "avatar": "https://randomuser.me/api/portraits/men/69.jpg"
            },
            {
                "id": "5b66c10ecc33be6fe7f8f451",
                "name": "Hudson Anderson",
                "avatar": "https://randomuser.me/api/portraits/women/26.jpg"
            },
            {
                "id": "5b66c10eea3d8091b907f4c5",
                "name": "Dillon Garrett",
                "avatar": "https://randomuser.me/api/portraits/women/43.jpg"
            },
            {
                "id": "5b66c10ea7a697a5fdcce5e9",
                "name": "Susanna Hudson",
                "avatar": "https://randomuser.me/api/portraits/women/45.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=1",
        "date": "2018-11-19T04:52:53",
        "duration": 412,
        "title": "id reprehenderit consectetur dolore labore consectetur aute elit do",
        "description": "Proident magna veniam qui ut amet magna sit elit deserunt. Qui sunt deserunt consequat labore. Aliquip qui officia ea qui dolor laboris. Quis anim laboris fugiat et enim voluptate excepteur aliqua id excepteur proident et ipsum.\r\nQui reprehenderit excepteur ullamco occaecat. Sit ad enim eu aliqua anim elit velit nostrud duis amet ad. Amet velit anim nulla tempor magna proident sint cupidatat irure aute qui consectetur. Aliquip veniam cupidatat dolore aliqua amet officia ex labore minim amet in. Tempor labore excepteur occaecat laboris excepteur amet dolore sunt. Eu eiusmod cupidatat mollit aliquip ipsum laborum amet eiusmod. Id consequat amet ad nulla aliquip duis id irure laboris quis incididunt.\r\nMagna consectetur et sint incididunt eu culpa ullamco ipsum. Consectetur ad consequat anim id. Sit enim excepteur commodo id magna ullamco. Esse nisi duis amet ex nostrud Lorem exercitation qui nisi voluptate tempor magna reprehenderit.\r\nCillum eiusmod laborum proident mollit et non proident anim. Nulla quis sit do eu magna dolor voluptate Lorem eiusmod. Excepteur pariatur ullamco adipisicing est. Nisi enim esse duis esse adipisicing pariatur esse est reprehenderit labore culpa tempor. Anim ex fugiat excepteur commodo cillum id elit eiusmod qui sunt pariatur nulla elit. Enim ipsum duis non labore id aliquip sit.\r\nEt dolore id exercitation labore ex anim eiusmod. Adipisicing adipisicing non mollit excepteur qui incididunt ex labore commodo aliquip aute quis amet consequat. Eiusmod minim eiusmod aliqua voluptate magna. Aliqua aliqua pariatur do commodo.\r\nEt veniam anim velit fugiat do laboris magna laboris ad pariatur ipsum sint. Dolore pariatur deserunt pariatur anim incididunt laboris. Sit aliquip nulla tempor pariatur eu dolore exercitation ea voluptate. Eu occaecat ullamco enim aliqua veniam ut officia tempor. Veniam fugiat sit non est consectetur id enim labore et duis tempor reprehenderit pariatur. Lorem esse ea ipsum excepteur qui in proident mollit irure Lorem nulla.\r\n",
        "rating": 44,
        "language": "Fra",
        "difficulty": "Expert",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e635c11f9d5a30c85",
        "trainers": [
            {
                "id": "5b66c10ebaef96f90054deae",
                "name": "Kelley Guerrero",
                "avatar": "https://randomuser.me/api/portraits/women/18.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=6",
        "date": "2018-11-21T11:41:40",
        "duration": 456,
        "title": "Lorem fugiat irure pariatur excepteur minim nisi excepteur nulla aute",
        "description": "Aute in mollit esse quis cupidatat et sint exercitation sit. Pariatur eiusmod irure do est dolor do qui minim elit sint deserunt ex. Ad pariatur ut cillum tempor minim laboris eiusmod sunt minim aliqua.\r\nEa incididunt consequat culpa enim ea mollit labore ut aliquip aute consectetur. Ut eu velit esse aute excepteur reprehenderit dolor id Lorem. Proident dolore qui Lorem pariatur deserunt esse et officia. Irure voluptate nisi laboris elit occaecat qui minim dolore do nostrud. Id incididunt excepteur consectetur fugiat aliquip cupidatat sunt sint elit consectetur excepteur qui. Culpa officia minim labore duis eu laborum fugiat. Anim cupidatat anim excepteur duis minim quis pariatur excepteur labore velit nostrud culpa.\r\nConsectetur aliquip non qui magna ad ad elit in tempor elit sunt ullamco commodo officia. Consequat nisi exercitation cillum fugiat aute cupidatat ipsum. Sit velit non adipisicing sit. Irure officia sit aliquip sit commodo sit excepteur dolore et mollit et esse. Ea aliquip aliquip duis labore. Reprehenderit ullamco eiusmod anim ullamco nostrud do mollit esse officia id commodo qui.\r\nOfficia id occaecat mollit do aliquip adipisicing consectetur ea quis. Quis non adipisicing velit anim veniam. Voluptate magna eu tempor tempor Lorem enim do est enim aliquip dolor. Deserunt ea in enim occaecat eiusmod sunt consequat nostrud incididunt et excepteur esse veniam id. Cupidatat sint ut cillum laboris in ex.\r\nLorem esse quis ex Lorem consectetur amet est tempor enim. Tempor ea sit sint et in est do. Deserunt do sint cillum cupidatat ad velit proident. Incididunt adipisicing excepteur duis cupidatat voluptate nulla tempor. Fugiat mollit culpa enim amet excepteur culpa officia Lorem eiusmod ullamco.\r\nAliquip pariatur Lorem quis ea nisi exercitation. Proident deserunt duis nulla consequat velit aliqua ut laborum do consectetur eu nostrud. Proident est adipisicing et dolore velit pariatur minim aliquip voluptate veniam ea reprehenderit. Incididunt do labore ipsum deserunt excepteur duis labore cupidatat aliquip.\r\n",
        "rating": 19,
        "language": "Esp",
        "difficulty": "Expert",
        "type": "Video course",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ef7dbfc8491232abd",
        "trainers": [
            {
                "id": "5b66c10ec094d0a2d32982e9",
                "name": "Blankenship Herrera",
                "avatar": "https://randomuser.me/api/portraits/women/57.jpg"
            },
            {
                "id": "5b66c10e1857771de942615f",
                "name": "Marisol Rios",
                "avatar": "https://randomuser.me/api/portraits/women/47.jpg"
            },
            {
                "id": "5b66c10efad650d3883ff74c",
                "name": "Cabrera Avery",
                "avatar": "https://randomuser.me/api/portraits/men/4.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=18",
        "date": "2018-12-11T12:46:33",
        "duration": 457,
        "title": "amet id anim esse ut Lorem est irure quis",
        "description": "Nostrud reprehenderit et labore ad cupidatat culpa. Dolore laborum adipisicing occaecat consectetur do duis elit. Eiusmod non in dolor aute ullamco. Mollit nulla nostrud ex proident non cupidatat. Mollit fugiat Lorem commodo do.\r\nQuis nulla culpa tempor proident esse et occaecat. Elit excepteur excepteur exercitation esse quis. Ea commodo dolor culpa incididunt. Fugiat sunt deserunt deserunt anim et ea mollit. Excepteur do culpa velit do. Lorem incididunt nisi exercitation ea ad dolore consectetur eu esse reprehenderit.\r\nMinim excepteur laboris pariatur eu. Nostrud velit nisi esse exercitation sit voluptate reprehenderit cupidatat deserunt irure est sint aute magna. Mollit in fugiat consequat excepteur est anim laboris cupidatat laboris laboris.\r\nUt non dolor duis enim cillum do aute dolor. Occaecat pariatur commodo consectetur exercitation aliquip. Voluptate dolor cillum reprehenderit non cillum anim nisi consequat ullamco deserunt occaecat enim. Fugiat eiusmod sunt eu ut elit. Deserunt anim ex eiusmod incididunt occaecat reprehenderit laboris consectetur non quis nulla magna. Cupidatat enim nulla veniam ullamco est amet in ut exercitation fugiat ut ut.\r\n",
        "rating": 37,
        "language": "Pol",
        "difficulty": "Advanced",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e287f6b6ff89eaaaa",
        "trainers": [
            {
                "id": "5b66c10edf5a9b72194bf730",
                "name": "Misty Gonzales",
                "avatar": "https://randomuser.me/api/portraits/women/39.jpg"
            },
            {
                "id": "5b66c10ef3653b4c40ebf9c9",
                "name": "Bertha Wood",
                "avatar": "https://randomuser.me/api/portraits/men/6.jpg"
            },
            {
                "id": "5b66c10ed0855c0231ea68fc",
                "name": "Best Dejesus",
                "avatar": "https://randomuser.me/api/portraits/men/46.jpg"
            },
            {
                "id": "5b66c10e506af6564e9285ed",
                "name": "Tina Shelton",
                "avatar": "https://randomuser.me/api/portraits/women/11.jpg"
            },
            {
                "id": "5b66c10e3d79864a645f0f29",
                "name": "Lopez Ferguson",
                "avatar": "https://randomuser.me/api/portraits/women/22.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=10",
        "date": "2018-09-23T05:33:03",
        "duration": 359,
        "title": "ex sit id anim officia eu",
        "description": "Enim elit consectetur nostrud nostrud minim adipisicing non minim sit velit mollit laboris. Culpa do aliquip ea sunt enim aute dolor laboris consectetur aliquip consectetur consectetur qui ex. Voluptate ad consectetur exercitation minim esse ea minim. Voluptate ullamco nulla pariatur non sunt non consequat aliqua occaecat elit esse enim nostrud.\r\nLorem cupidatat aliqua in deserunt pariatur. Elit nisi consequat ad magna voluptate ea irure ullamco ea. Laboris ad irure cillum veniam qui duis quis fugiat cupidatat culpa. Laboris est sint ipsum ea enim veniam excepteur qui eiusmod cillum ex labore exercitation amet. Cupidatat irure nostrud exercitation quis id ex irure laboris ut officia esse qui. Deserunt elit cillum sit nulla tempor non officia tempor reprehenderit veniam.\r\nVoluptate exercitation adipisicing ex do. Anim enim Lorem est laborum est sit. Et sint do sint adipisicing voluptate eu laboris labore et in. Eiusmod laboris ullamco enim dolore magna duis amet magna non in laboris qui excepteur cillum. Sint fugiat enim consequat sunt officia nulla tempor ea consequat adipisicing deserunt occaecat. Nostrud officia incididunt dolor ad quis aliqua.\r\n",
        "rating": 48,
        "language": "Esp",
        "difficulty": "For All",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e63bb2325ba3df6c9",
        "trainers": [
            {
                "id": "5b66c10eae0bd8fb9fb41ddb",
                "name": "Erin Contreras",
                "avatar": "https://randomuser.me/api/portraits/men/55.jpg"
            },
            {
                "id": "5b66c10e303b95a0412278b7",
                "name": "Katherine Johns",
                "avatar": "https://randomuser.me/api/portraits/women/35.jpg"
            },
            {
                "id": "5b66c10e5f96af3c83430038",
                "name": "Farley Espinoza",
                "avatar": "https://randomuser.me/api/portraits/women/65.jpg"
            },
            {
                "id": "5b66c10e8c88374170e72d0d",
                "name": "Lang Mooney",
                "avatar": "https://randomuser.me/api/portraits/men/61.jpg"
            },
            {
                "id": "5b66c10ecc21cfb381cc9913",
                "name": "Ofelia Keith",
                "avatar": "https://randomuser.me/api/portraits/men/21.jpg"
            },
            {
                "id": "5b66c10e27181a73ed8e54b9",
                "name": "Jefferson Brooks",
                "avatar": "https://randomuser.me/api/portraits/women/37.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=10",
        "date": "2018-11-28T01:38:08",
        "duration": 433,
        "title": "ipsum commodo nulla labore irure laboris ea",
        "description": "Incididunt esse ullamco in dolore ad aliqua aute excepteur nisi eu duis nisi sunt. Labore eiusmod in consequat aute excepteur do adipisicing deserunt nostrud commodo. Consequat mollit sint in cillum excepteur anim veniam voluptate in reprehenderit velit. Est est ullamco dolore quis amet fugiat cupidatat. Magna est excepteur ex veniam minim esse id veniam. Cillum exercitation sint ex fugiat. Anim cupidatat do aliquip irure irure elit consectetur culpa irure.\r\nId esse aute anim ut nisi ullamco. Fugiat Lorem in sint tempor nisi qui et nisi irure officia esse. Excepteur do deserunt adipisicing tempor nostrud. Culpa cillum cupidatat anim veniam exercitation et adipisicing eiusmod minim ad.\r\nNulla eiusmod irure ullamco in excepteur nostrud magna eu deserunt eu proident. Eu excepteur qui irure laborum commodo pariatur minim. Sunt esse sint id veniam deserunt aliquip incididunt. Ullamco sit nisi fugiat occaecat nulla enim cillum. Velit et duis deserunt commodo est do fugiat quis eu ipsum. Minim enim dolore anim aute magna reprehenderit consectetur.\r\nOfficia enim anim culpa ad quis est. Commodo cupidatat eiusmod esse minim enim elit exercitation labore reprehenderit. Enim eu do aliqua labore excepteur non sit consectetur nulla elit amet pariatur. Occaecat culpa sit nostrud quis qui ullamco est laboris commodo commodo. Tempor aute culpa sint duis.\r\nSint sint incididunt nulla labore nulla id consectetur veniam labore amet veniam amet aliqua. Quis amet reprehenderit laboris esse. Magna sint magna culpa excepteur ut sit dolor adipisicing reprehenderit nulla nisi sunt. Mollit pariatur voluptate consequat nostrud. Voluptate consequat esse exercitation nisi ea sunt et fugiat enim irure dolore sit irure dolor. Laboris nostrud non do amet.\r\nSit fugiat consectetur reprehenderit fugiat tempor aliquip in in eiusmod non pariatur non. In laborum consequat ea quis laboris consectetur occaecat aliqua reprehenderit. Id labore id voluptate sint. Minim magna enim eiusmod enim officia fugiat dolor qui. Ipsum proident cillum sunt ipsum irure veniam occaecat et incididunt non et occaecat ullamco non. Nisi amet proident adipisicing nostrud nulla ut dolor velit excepteur do incididunt nostrud labore nisi. Ex consectetur elit sint commodo adipisicing occaecat esse dolor duis.\r\nCommodo sunt reprehenderit enim duis consectetur enim mollit nostrud in adipisicing irure magna. Aute reprehenderit aute commodo amet ea esse. Deserunt commodo id velit aliqua est aliqua enim id. Quis aute laboris sit ad anim dolor consequat deserunt eu esse sit cillum cupidatat anim. Irure anim anim magna proident reprehenderit laborum aliquip nostrud sit ex dolore sit cillum.\r\n",
        "rating": 26,
        "language": "Rus",
        "difficulty": "For All",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e46acccb42201f01e",
        "trainers": [
            {
                "id": "5b66c10ee69d76ca6944c911",
                "name": "Lynch Hubbard",
                "avatar": "https://randomuser.me/api/portraits/men/1.jpg"
            },
            {
                "id": "5b66c10e5e60b3727d8dee1a",
                "name": "Vazquez Riley",
                "avatar": "https://randomuser.me/api/portraits/men/70.jpg"
            },
            {
                "id": "5b66c10ee1ea907464564d8b",
                "name": "Marissa Watson",
                "avatar": "https://randomuser.me/api/portraits/women/27.jpg"
            },
            {
                "id": "5b66c10e5ba6870333bbb49b",
                "name": "Lessie Glenn",
                "avatar": "https://randomuser.me/api/portraits/men/27.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=10",
        "date": "2018-09-19T02:31:55",
        "duration": 151,
        "title": "nulla minim laborum commodo commodo",
        "description": "Non cupidatat mollit eiusmod culpa sint ullamco. Nostrud laboris quis enim ipsum voluptate elit eiusmod elit. Sunt ullamco nostrud proident proident tempor amet commodo deserunt laborum. Occaecat aliquip anim labore reprehenderit ad amet reprehenderit adipisicing ea proident non eu. Culpa fugiat do irure irure non culpa officia minim officia ullamco duis dolore proident.\r\nOccaecat non duis aliqua ea dolore irure non ut. Exercitation cupidatat pariatur nisi qui reprehenderit occaecat cillum tempor anim non pariatur. Duis voluptate ullamco quis amet cillum labore nulla veniam magna aliquip do laborum cupidatat. In aute elit dolor cupidatat dolor cupidatat ullamco esse consectetur labore excepteur eu culpa consequat. Id nulla sint ad mollit nostrud minim consequat. Veniam proident nostrud occaecat excepteur ex. Dolor cillum adipisicing magna proident eu mollit laborum sint.\r\nIn magna labore sunt fugiat veniam ex nostrud excepteur ex do officia. Eu dolor ipsum ex magna in amet duis in. Id ad sint sunt ex do ad occaecat aliquip consequat qui culpa aliquip. Lorem dolor eiusmod voluptate occaecat duis tempor et et quis. Ea labore eiusmod fugiat enim. Pariatur deserunt quis cillum elit voluptate commodo sit et eiusmod enim enim adipisicing ad irure.\r\nCillum cupidatat eiusmod cillum tempor labore laborum esse commodo in id ipsum esse. Velit duis eu velit eu aliquip adipisicing ut. Eu laboris velit deserunt adipisicing amet incididunt est ad. Ea eiusmod dolore sint eu ea eiusmod consequat dolore consequat Lorem magna consectetur quis culpa.\r\nOfficia fugiat commodo ad amet exercitation cupidatat mollit enim sit. Tempor velit velit ea amet. Fugiat sunt in ad in officia ex dolor sint dolor deserunt aliqua. Labore aliquip ad sint magna eiusmod sit adipisicing elit proident ipsum. Proident aute eu deserunt ad officia non ex sint ullamco mollit ullamco. Sunt et magna commodo veniam dolore officia labore minim ex laborum eu voluptate.\r\nMagna eiusmod cillum exercitation nulla tempor velit cupidatat velit amet cupidatat. Aute amet ut est velit labore et excepteur ex. Minim aliquip magna incididunt cillum esse est laborum ad dolore magna reprehenderit. Minim laboris nulla ullamco occaecat esse irure laboris laborum eiusmod Lorem consectetur. Non aliqua cillum irure sunt magna deserunt. Tempor irure eu et do ullamco esse sint sunt.\r\nExercitation magna enim velit consectetur dolore commodo cillum aliquip nulla laboris nisi aliqua id. Nulla Lorem do nostrud ea. Fugiat aute anim proident in mollit. Esse occaecat voluptate exercitation reprehenderit fugiat amet.\r\nUt ad irure veniam id id pariatur nostrud id. Incididunt et proident dolor labore dolor officia est aliqua ad. Excepteur enim ullamco nostrud voluptate Lorem consequat eu occaecat ipsum eu duis mollit velit deserunt. Velit sint dolor ad ipsum anim amet laboris ut laboris Lorem enim irure et voluptate. Minim fugiat veniam nulla anim. Reprehenderit nisi nisi non incididunt veniam voluptate exercitation nostrud nostrud esse. Ullamco quis elit aliquip qui ex aliqua nulla.\r\nUt anim labore incididunt dolore eiusmod velit cupidatat fugiat ea. Adipisicing nisi fugiat minim labore veniam eu fugiat qui amet et magna nostrud sint. Non minim duis pariatur labore voluptate dolore consequat amet nostrud occaecat aute proident incididunt.\r\nIn cupidatat occaecat culpa incididunt consectetur culpa. Ullamco do veniam consectetur nulla ex pariatur cupidatat culpa. Mollit occaecat ut excepteur aute veniam deserunt commodo mollit aliqua pariatur velit esse.\r\nUllamco non officia adipisicing reprehenderit tempor ex nostrud officia. In magna pariatur ad non elit in est qui. Proident ex incididunt consequat sunt ad amet tempor in eiusmod proident deserunt excepteur.\r\nVoluptate in laboris ex nulla sit excepteur non occaecat quis officia. Sunt voluptate qui veniam eiusmod ullamco eiusmod minim nisi et duis sit esse tempor. Aute labore cupidatat fugiat aliquip magna labore qui.\r\nDolore id culpa dolor magna cillum ut ullamco. Voluptate Lorem adipisicing tempor consequat adipisicing non magna nisi mollit consectetur proident deserunt occaecat. Aute eu et laborum occaecat dolor cupidatat nostrud non Lorem reprehenderit mollit commodo. Anim amet voluptate quis ex eu in aute eiusmod dolor ad aute excepteur. Proident eiusmod Lorem adipisicing Lorem id anim velit voluptate ea non eiusmod eiusmod. Eu qui consequat adipisicing ullamco non ex ex exercitation pariatur adipisicing ullamco dolore.\r\nEst minim ex fugiat id officia nulla ex laborum. Elit cillum dolore quis eu duis eu reprehenderit do duis eiusmod nulla ea excepteur. Exercitation pariatur excepteur consectetur amet id ut aliquip. Enim tempor exercitation ipsum veniam.\r\nOfficia qui do do nostrud dolor aliquip ea. Quis culpa occaecat dolor consequat ad anim aute fugiat esse reprehenderit nostrud. Laborum et officia excepteur proident. Sit tempor laboris anim sunt Lorem laborum eiusmod.\r\n",
        "rating": 49,
        "language": "Esp",
        "difficulty": "Intermediate",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e9bc117914921c56c",
        "trainers": [
            {
                "id": "5b66c10e49b2c00f375c44cf",
                "name": "Dionne Avila",
                "avatar": "https://randomuser.me/api/portraits/men/33.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=14",
        "date": "2018-08-01T07:56:51",
        "duration": 334,
        "title": "sit est veniam incididunt eiusmod aliqua deserunt",
        "description": "Reprehenderit magna exercitation Lorem enim. Cupidatat occaecat elit nulla magna amet ad ullamco duis culpa. Cillum do officia anim consectetur Lorem cupidatat. Consequat fugiat proident anim dolor incididunt est in do excepteur. Dolore adipisicing enim enim sit culpa veniam eiusmod. Voluptate tempor qui id cillum anim ipsum amet quis reprehenderit nulla sint in.\r\nNon Lorem enim est commodo. Ea incididunt exercitation sunt nisi aliqua dolor voluptate cupidatat nulla nostrud eiusmod nulla veniam et. Excepteur aute proident id ullamco laborum nostrud enim occaecat deserunt elit dolor laborum eiusmod nulla. Sit anim ea sint ullamco dolore cillum in quis. Eiusmod ipsum qui amet veniam dolore deserunt adipisicing magna. Dolor adipisicing enim dolore et non incididunt occaecat do fugiat qui do occaecat. Ex eiusmod pariatur qui excepteur.\r\nNon est in laborum eiusmod cupidatat eiusmod Lorem deserunt minim cupidatat dolor ullamco. Deserunt enim minim elit nostrud minim veniam duis non non proident commodo tempor excepteur. Lorem irure duis ex esse cillum velit. Lorem ipsum veniam ullamco sunt dolor cillum duis magna sint ipsum cillum anim. Cupidatat adipisicing adipisicing ea culpa qui. Culpa exercitation commodo irure labore ut veniam irure.\r\nOccaecat esse magna sunt eiusmod occaecat proident mollit elit do irure aliqua qui proident. Aliquip ipsum nostrud nostrud commodo aliqua magna deserunt aute est do laborum aliquip. Ea aute consequat irure veniam occaecat sunt. Ullamco et dolore sint occaecat velit ipsum aute elit labore eu ut elit cillum dolor. Lorem nulla consequat voluptate tempor Lorem duis labore ad velit aliqua culpa sint do non. Enim ex mollit eiusmod aute labore eu cupidatat incididunt velit amet dolore eiusmod et nulla.\r\nAute magna id quis culpa esse anim ipsum anim adipisicing dolore in. Non mollit adipisicing eiusmod do. Minim Lorem in amet enim anim mollit commodo dolor proident laboris velit ex. Nulla aliquip sunt est deserunt consequat.\r\nAdipisicing ipsum non ipsum aliqua eiusmod mollit laborum qui nostrud ipsum quis cillum. In ut aliqua commodo sunt aliqua ipsum sit. Irure voluptate do ex anim qui aliqua cillum esse nisi consectetur minim nostrud non. Excepteur exercitation ut proident nulla laboris fugiat aliquip sunt est veniam dolore non labore enim. Sit minim reprehenderit eiusmod deserunt voluptate labore in laborum reprehenderit dolore ullamco ullamco. Nulla non anim non voluptate nulla in elit cillum esse.\r\nOfficia reprehenderit veniam consectetur tempor dolore tempor do ullamco consectetur occaecat nostrud cupidatat eu dolor. Est ullamco est deserunt laborum. Aliqua consectetur labore excepteur velit ex cupidatat adipisicing incididunt ad ut amet ullamco magna. Minim irure adipisicing ullamco officia fugiat ex ad. Occaecat ut velit ullamco labore ullamco veniam veniam cupidatat fugiat mollit. Do ex culpa labore aliquip ut ea deserunt. Consectetur aliqua enim cillum cupidatat dolor nostrud.\r\nLaboris nostrud minim fugiat nulla sit ea sit enim fugiat aute aliquip esse. Consequat sit deserunt laboris nulla culpa consectetur. Esse velit do ut quis dolor quis sunt occaecat id dolore.\r\nIncididunt enim ut esse mollit irure consequat amet. Mollit nulla dolore ex ad labore cillum exercitation veniam. Duis deserunt velit excepteur et proident consequat anim incididunt aliqua dolore labore Lorem anim. Ut est proident amet pariatur quis reprehenderit exercitation. Tempor exercitation eiusmod sunt ea et mollit. Ea dolor enim velit ipsum voluptate minim.\r\nSunt labore eu minim cillum nostrud anim ea voluptate duis. Enim nulla esse aliquip veniam consequat culpa magna aute sit id. Sit tempor eiusmod esse tempor magna pariatur. Non aliquip pariatur Lorem quis elit pariatur fugiat adipisicing amet cillum.\r\nConsequat pariatur officia fugiat enim consectetur incididunt eu aliqua exercitation sint laboris deserunt proident. Ullamco magna labore velit in incididunt magna Lorem quis excepteur Lorem magna sunt aliqua enim. Commodo minim reprehenderit mollit deserunt aute deserunt exercitation irure tempor ut velit deserunt. Eu excepteur minim dolor quis eiusmod enim dolor esse amet consequat et et reprehenderit irure. Minim nostrud reprehenderit in voluptate aliquip id aliquip reprehenderit enim anim elit exercitation ea dolore. Nisi ullamco irure non Lorem non dolore dolore.\r\n",
        "rating": 28,
        "language": "Esp",
        "difficulty": "For All",
        "type": "Video course",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e03bf8f7880790312",
        "trainers": [
            {
                "id": "5b66c10ef19197ff6f194059",
                "name": "Alexander Hays",
                "avatar": "https://randomuser.me/api/portraits/men/13.jpg"
            },
            {
                "id": "5b66c10e77b3af2af5f7d6e0",
                "name": "Young Hinton",
                "avatar": "https://randomuser.me/api/portraits/men/55.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=10",
        "date": "2018-12-25T04:49:31",
        "duration": 148,
        "title": "ut sint nisi",
        "description": "Adipisicing nisi ut culpa cupidatat in cillum est. Qui fugiat consectetur velit est culpa fugiat ea. In duis culpa officia qui ipsum consequat eiusmod cupidatat excepteur nulla consectetur qui ut. Irure commodo sit mollit fugiat dolor dolor ut. Sunt ullamco reprehenderit esse occaecat eiusmod eu exercitation cupidatat incididunt cupidatat.\r\nIn non quis non aute aute exercitation veniam et cillum anim sit. Ex magna tempor ea exercitation ullamco aliquip pariatur voluptate veniam exercitation sit consectetur in. Ex pariatur laborum minim adipisicing adipisicing est mollit adipisicing mollit qui. Cillum pariatur culpa Lorem mollit. Incididunt et reprehenderit in laboris voluptate sit fugiat. Quis culpa labore duis occaecat ullamco velit.\r\nEx fugiat reprehenderit culpa deserunt ex do laborum culpa cupidatat culpa commodo elit esse velit. Ullamco nostrud adipisicing exercitation cillum aliqua et cillum. Aute dolor consequat consequat id commodo Lorem proident nostrud cillum. Ullamco aliqua ea incididunt quis proident aliqua fugiat laboris. Quis consequat cillum non ea exercitation irure quis ut mollit excepteur. Exercitation veniam ut qui esse commodo irure minim incididunt. Est commodo voluptate do laborum esse aliqua ea tempor amet deserunt dolor velit.\r\nDolor ad adipisicing aliquip in exercitation cupidatat quis magna sit velit. Ullamco ut dolore reprehenderit deserunt Lorem voluptate sit. Amet est cillum velit sit aliqua cillum ad. Id anim nisi irure ea exercitation in nisi sint nisi quis fugiat proident ut.\r\nVoluptate aliqua consequat fugiat quis cillum ea et proident est eiusmod nostrud sit pariatur. Et ut dolor aute dolore mollit ea officia. Sit minim velit laborum ullamco consectetur minim deserunt nisi incididunt laboris. Nulla fugiat qui proident commodo aliquip ea commodo culpa ullamco laboris aute dolor enim enim.\r\nTempor enim pariatur ad commodo nostrud duis. Incididunt in nostrud sit velit nostrud eiusmod eiusmod aliquip cillum. Dolor occaecat ipsum labore anim est fugiat ad commodo consequat ullamco tempor labore. Ea eu labore officia ullamco qui sit fugiat do ea reprehenderit voluptate sunt eu mollit. Aliqua aliquip in qui aliqua labore minim nisi cupidatat ipsum minim quis sit anim. Incididunt proident consequat proident qui proident dolor amet dolore magna incididunt. Est aute aliquip mollit irure ipsum labore.\r\nAliquip minim elit cupidatat mollit labore fugiat laboris ex. Ut officia deserunt in excepteur non culpa. Mollit labore est sit deserunt dolore duis pariatur duis nostrud do aute. In et ea quis labore enim adipisicing ipsum aliqua ut commodo consectetur laborum. Laboris pariatur commodo aliqua id. Laborum et non est nulla veniam labore incididunt nostrud laboris proident. Enim sit commodo proident tempor.\r\nCommodo proident sunt mollit nostrud dolor laborum quis enim adipisicing duis. Fugiat aliqua id deserunt est quis commodo. Qui mollit culpa nostrud laboris. Ea pariatur ullamco elit nulla deserunt incididunt elit irure reprehenderit id est sint velit ipsum. Sit officia mollit id dolore veniam.\r\n",
        "rating": 18,
        "language": "Esp",
        "difficulty": "Expert",
        "type": "Seminar",
        "isFavorite": true
    },
    {
        "_id": "5b66c10ed23e6dba2b50c5fa",
        "trainers": [
            {
                "id": "5b66c10e95f73e3b5be1a7bb",
                "name": "Manning Harper",
                "avatar": "https://randomuser.me/api/portraits/women/54.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=6",
        "date": "2018-12-04T05:10:52",
        "duration": 371,
        "title": "quis incididunt aute",
        "description": "Eu ea proident mollit sint enim non sunt est. Veniam magna ut consequat aliquip qui officia pariatur. Minim magna ullamco id consectetur culpa est et cillum ut labore et cillum qui et.\r\nLabore proident ex elit culpa fugiat exercitation adipisicing. Aliqua in non adipisicing incididunt. Cupidatat deserunt labore nulla incididunt. Adipisicing pariatur commodo dolor magna. Dolore voluptate ea officia anim enim aute aliqua dolor quis aute anim nisi qui. Fugiat nisi eiusmod non irure laboris sint magna excepteur.\r\nDolor ex Lorem exercitation proident. Tempor nisi enim do veniam irure reprehenderit id veniam non in est pariatur in nulla. Dolore sunt elit consequat occaecat laborum duis esse sunt dolor exercitation sint voluptate labore. Velit qui esse Lorem aute excepteur sit cupidatat exercitation reprehenderit enim nisi. Non Lorem fugiat adipisicing cillum. Officia tempor officia velit ex fugiat anim nulla non consequat magna voluptate nostrud minim proident.\r\nDo id laborum aute ex laborum nostrud sit eiusmod nulla et. Ex ut exercitation ipsum exercitation culpa ea. Ea veniam exercitation excepteur incididunt. Occaecat nisi sit mollit ullamco deserunt ex anim. Eu minim voluptate sunt velit qui irure labore ea tempor mollit sit voluptate excepteur cupidatat. Ullamco quis veniam nostrud deserunt qui do voluptate sunt elit adipisicing eu aute culpa adipisicing. Cupidatat sunt eiusmod qui officia elit aliqua eiusmod sit nostrud ullamco tempor voluptate.\r\nOccaecat enim Lorem fugiat cupidatat ut ad. Veniam enim velit magna magna occaecat esse excepteur. Elit amet officia mollit sit magna sunt fugiat aliqua. Est eu ullamco irure sunt irure cupidatat aliquip. Quis nisi est dolor velit id excepteur nulla in consequat amet. Adipisicing non nisi exercitation et cillum cillum voluptate minim.\r\nSint cupidatat commodo veniam occaecat ipsum magna tempor tempor mollit sint. Reprehenderit ullamco nulla officia minim ea. Et mollit minim enim nulla id et nostrud.\r\nCulpa sit aliqua anim velit dolor officia tempor eu labore ex. Veniam dolore fugiat duis mollit et commodo pariatur mollit adipisicing dolore aliqua. Culpa consequat elit ex reprehenderit labore cupidatat pariatur deserunt et mollit Lorem consectetur. Quis anim aliquip qui adipisicing commodo. Cillum quis nostrud culpa do.\r\n",
        "rating": 24,
        "language": "Pol",
        "difficulty": "Advanced",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10eda23f4d05c867a0d",
        "trainers": [
            {
                "id": "5b66c10e7675a9033c3efea7",
                "name": "Parsons Maddox",
                "avatar": "https://randomuser.me/api/portraits/men/36.jpg"
            },
            {
                "id": "5b66c10e3e11acac2e53be10",
                "name": "Lilian Cook",
                "avatar": "https://randomuser.me/api/portraits/men/34.jpg"
            },
            {
                "id": "5b66c10e9075512e213ec6ff",
                "name": "Griffin Cunningham",
                "avatar": "https://randomuser.me/api/portraits/men/24.jpg"
            },
            {
                "id": "5b66c10ed2f21eb56d84b086",
                "name": "Fowler Chang",
                "avatar": "https://randomuser.me/api/portraits/women/30.jpg"
            },
            {
                "id": "5b66c10e54b28716b7312631",
                "name": "Cooke Lowery",
                "avatar": "https://randomuser.me/api/portraits/men/19.jpg"
            },
            {
                "id": "5b66c10e734b71834d12565b",
                "name": "Chapman Foster",
                "avatar": "https://randomuser.me/api/portraits/men/66.jpg"
            },
            {
                "id": "5b66c10edc90abe7e14a3896",
                "name": "Taylor Navarro",
                "avatar": "https://randomuser.me/api/portraits/women/63.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=10",
        "date": "2018-11-27T05:13:00",
        "duration": 31,
        "title": "laboris ad non",
        "description": "Incididunt ullamco duis ut nostrud in laborum nisi ut cupidatat sunt aute. Labore ea cillum sit culpa minim nostrud. Elit adipisicing ad dolore non duis culpa culpa nisi deserunt elit. Aliquip labore eiusmod consectetur ea pariatur proident occaecat cupidatat quis est minim mollit quis veniam. Eu dolore eiusmod reprehenderit reprehenderit voluptate sit esse nostrud quis pariatur ullamco ipsum labore. Nulla incididunt laboris duis eu aliquip voluptate laboris.\r\nQui quis duis laboris cillum. Minim voluptate veniam laboris deserunt ut est irure elit. Consequat officia duis qui ipsum sint. Ex eiusmod culpa enim occaecat ex fugiat. Deserunt occaecat est esse anim velit exercitation commodo consequat tempor minim ex consequat in sit. Sint reprehenderit nisi pariatur anim irure magna sunt sint qui reprehenderit.\r\nAmet duis et ut duis deserunt eu. Eiusmod quis excepteur eu cupidatat laboris. Elit esse excepteur do est elit tempor adipisicing Lorem commodo velit qui culpa. Reprehenderit enim adipisicing in excepteur eu qui ad id. Fugiat mollit nisi consequat deserunt.\r\nReprehenderit amet aliqua commodo tempor qui. Non commodo nostrud ad veniam dolore aute ut. Cillum voluptate adipisicing excepteur aliqua quis. Laboris magna amet dolor officia velit ex ullamco sit officia adipisicing nostrud excepteur do. Sit do ea ex Lorem Lorem dolor esse pariatur eiusmod. Qui elit reprehenderit Lorem exercitation.\r\nCommodo adipisicing excepteur culpa voluptate non nulla dolor elit eiusmod magna. Cupidatat id id irure cupidatat elit ipsum sint occaecat. Aliquip reprehenderit commodo voluptate nulla consectetur consequat. Nulla incididunt sint eu consequat mollit nulla ex incididunt id reprehenderit reprehenderit fugiat ullamco. Deserunt nisi ullamco amet id quis consectetur sunt est dolor nostrud duis labore ad velit. Laborum aute ullamco aliqua proident mollit cillum cillum consectetur ullamco ullamco do ipsum commodo.\r\nEx velit quis laborum cupidatat elit et eiusmod ullamco. Anim veniam id excepteur in do id reprehenderit tempor ad. Exercitation commodo ex laboris non excepteur fugiat sit.\r\n",
        "rating": 13,
        "language": "Pol",
        "difficulty": "Novice",
        "type": "Video course",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e723911017ad7ca5f",
        "trainers": [
            {
                "id": "5b66c10e3a985406286a3780",
                "name": "Bray Humphrey",
                "avatar": "https://randomuser.me/api/portraits/women/16.jpg"
            },
            {
                "id": "5b66c10e7045495ea4b1830d",
                "name": "Bolton Mcclure",
                "avatar": "https://randomuser.me/api/portraits/women/2.jpg"
            },
            {
                "id": "5b66c10ebbac917e61c33195",
                "name": "Roach Carpenter",
                "avatar": "https://randomuser.me/api/portraits/men/41.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=17",
        "date": "2018-12-04T03:05:29",
        "duration": 23,
        "title": "magna eiusmod ipsum qui in",
        "description": "Minim cupidatat aliqua commodo in labore in cillum nulla. Nulla fugiat ad ad cillum. Adipisicing ut dolore qui ut ad laboris pariatur enim nulla ut officia. Adipisicing enim aliqua officia mollit cupidatat est anim dolor non aute.\r\nLorem aute aliqua nostrud eiusmod laborum occaecat sint. Culpa commodo voluptate pariatur incididunt non anim tempor officia enim laboris. Voluptate enim non esse sint ea culpa eiusmod laboris eiusmod irure commodo nostrud. Dolor nisi irure pariatur non do. Ea esse eiusmod dolore nulla ex tempor do ipsum non ullamco amet cupidatat magna. Consequat non proident culpa id fugiat nisi. Fugiat excepteur labore enim aliqua magna nisi ipsum tempor aliqua consequat.\r\nIrure adipisicing ea minim mollit enim commodo. Mollit proident nisi minim fugiat tempor et voluptate magna ea dolor deserunt et aute. Dolor aliquip ad et veniam aliqua cillum quis laborum veniam duis id ex. Exercitation qui mollit dolor dolor culpa minim ipsum eu duis eu.\r\nUllamco sunt eiusmod ipsum cupidatat dolore minim dolore laboris eiusmod nisi eiusmod occaecat esse elit. Pariatur laboris ullamco incididunt eu non. Veniam aliqua enim nulla culpa duis.\r\n",
        "rating": 34,
        "language": "Eng",
        "difficulty": "Novice",
        "type": "Training",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ede493b4c7f2968fd",
        "trainers": [
            {
                "id": "5b66c10ebdde4ea09c11b05e",
                "name": "Abigail Kelly",
                "avatar": "https://randomuser.me/api/portraits/women/6.jpg"
            },
            {
                "id": "5b66c10e9c5d0fc0dc6612b0",
                "name": "Greer Maxwell",
                "avatar": "https://randomuser.me/api/portraits/women/40.jpg"
            },
            {
                "id": "5b66c10e4a7023730092bc8a",
                "name": "Mcknight Malone",
                "avatar": "https://randomuser.me/api/portraits/women/7.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=11",
        "date": "2018-09-02T03:35:00",
        "duration": 222,
        "title": "elit magna eiusmod irure elit",
        "description": "Aliqua Lorem ullamco sunt aliqua enim ut. Deserunt id ad velit consectetur tempor. Id sunt officia aliquip Lorem. Occaecat nostrud minim eiusmod laborum cupidatat sit consectetur veniam enim culpa reprehenderit incididunt. Enim voluptate pariatur laborum sit aute deserunt dolor mollit et enim Lorem laborum. Veniam mollit minim duis id voluptate ipsum ut cupidatat adipisicing ex in nisi proident.\r\nIn id ea laborum esse ea et dolor ad excepteur sunt. Minim nostrud in officia aliquip non minim esse dolor eu est. Nulla commodo eiusmod fugiat duis deserunt enim.\r\nEsse ad elit incididunt nulla enim consectetur officia sit elit minim ipsum adipisicing enim. Nisi excepteur sunt dolor reprehenderit sunt sunt excepteur et. Ea consequat proident id proident commodo dolore ea tempor enim. Consectetur culpa exercitation dolore eu elit in ea pariatur qui irure nulla velit excepteur. Incididunt id officia quis ea sit nulla enim labore.\r\nAd aliqua ullamco voluptate ad laboris Lorem minim officia aliquip laborum sunt eiusmod dolore. Nisi exercitation sunt adipisicing fugiat elit laborum ipsum excepteur sit mollit quis fugiat. Nulla aliquip qui excepteur consectetur in sunt do laborum consectetur Lorem.\r\nEa mollit irure magna ut incididunt nisi aute nulla tempor do Lorem. Esse exercitation voluptate do do non esse anim aliquip exercitation veniam. Qui ex irure ad officia cupidatat. Ad pariatur dolor ad commodo laborum magna. Exercitation occaecat esse dolor aute deserunt anim do aute nulla laboris velit.\r\nSint quis ullamco anim laborum laboris magna minim in officia sit dolore labore commodo. Ad labore cupidatat minim sunt dolore. Duis velit amet incididunt non proident dolor proident fugiat.\r\nEnim et culpa ex mollit occaecat reprehenderit nostrud aliquip nisi id fugiat cillum. Proident Lorem consectetur elit minim in ad qui ad cupidatat in. Mollit do tempor ea quis aliquip nisi officia.\r\nNisi adipisicing amet dolor non magna nostrud non duis quis in ex. Ut labore irure commodo culpa consequat qui dolor deserunt irure minim dolore reprehenderit. Esse ad ullamco Lorem commodo in enim. Voluptate nulla sit duis incididunt.\r\nReprehenderit exercitation ipsum quis pariatur velit ea. Proident cupidatat eiusmod do ea ipsum eiusmod. Adipisicing culpa adipisicing consectetur non. Id aute cillum eu labore eu occaecat ex aliquip ullamco cillum. Eu id id dolore in deserunt consequat dolore labore.\r\nQuis fugiat in magna velit incididunt nisi veniam elit eu amet occaecat ea ea id. Nostrud excepteur irure cillum fugiat. Deserunt cillum magna nulla non eu velit anim reprehenderit. Tempor laborum consequat dolor non anim. Et voluptate ea irure excepteur amet culpa veniam in est deserunt. Nostrud et ullamco labore officia et tempor.\r\nSunt excepteur exercitation tempor aliqua mollit dolor. Sit et est magna est. Minim velit ullamco tempor dolore veniam ad ut pariatur. Veniam sunt qui aliqua anim eiusmod minim aliquip mollit qui. Dolor commodo elit tempor in ex. Elit voluptate commodo cupidatat ea.\r\nElit incididunt nisi ullamco proident consectetur nostrud consectetur laborum nisi proident Lorem anim. Id deserunt duis veniam excepteur sunt tempor Lorem irure duis Lorem nisi proident. Exercitation qui occaecat elit ad cupidatat nostrud. Incididunt irure incididunt mollit anim. Proident minim non qui ad velit eiusmod aute esse proident ad.\r\nMinim irure ea ut mollit sit. Aliqua eiusmod dolor ipsum ad et irure. Ipsum elit eiusmod Lorem Lorem velit enim fugiat labore et eiusmod dolor eiusmod. Incididunt quis culpa elit culpa qui incididunt enim officia labore proident.\r\nAliquip sit amet culpa magna enim laboris duis ipsum consequat ullamco id. Do eiusmod voluptate ut exercitation in dolor. Minim qui culpa enim qui minim enim nulla mollit velit nulla aliquip fugiat aliqua. Excepteur officia id id Lorem aliquip ex amet mollit sunt do in ullamco labore exercitation. Id est deserunt do laborum ipsum veniam voluptate laborum. Amet velit labore veniam veniam dolor ad nulla qui ad nisi officia.\r\n",
        "rating": 40,
        "language": "Rus",
        "difficulty": "Expert",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ee0f6ebdf3e54ea76",
        "trainers": [
            {
                "id": "5b66c10e8048bc502cf8dd53",
                "name": "Lorrie Hyde",
                "avatar": "https://randomuser.me/api/portraits/women/52.jpg"
            },
            {
                "id": "5b66c10e54e6aa9475e1f474",
                "name": "Brock Conley",
                "avatar": "https://randomuser.me/api/portraits/men/54.jpg"
            },
            {
                "id": "5b66c10e9af06b829c9e86e1",
                "name": "Haynes Barrera",
                "avatar": "https://randomuser.me/api/portraits/men/4.jpg"
            },
            {
                "id": "5b66c10e8ca4e62aba0dc850",
                "name": "Mcdowell Lynn",
                "avatar": "https://randomuser.me/api/portraits/women/12.jpg"
            },
            {
                "id": "5b66c10e0d3918ba64d33558",
                "name": "Leila Burke",
                "avatar": "https://randomuser.me/api/portraits/men/40.jpg"
            },
            {
                "id": "5b66c10eda251adf80e6f56b",
                "name": "Marta Flores",
                "avatar": "https://randomuser.me/api/portraits/women/11.jpg"
            },
            {
                "id": "5b66c10ed62eb69c4cdf3feb",
                "name": "Keith Mayer",
                "avatar": "https://randomuser.me/api/portraits/women/27.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=10",
        "date": "2018-12-17T03:44:53",
        "duration": 216,
        "title": "aliquip duis occaecat officia adipisicing est ipsum pariatur laboris",
        "description": "Irure dolore sint nisi exercitation minim excepteur. Fugiat excepteur ut Lorem cupidatat commodo id adipisicing. Adipisicing est amet deserunt quis nisi cupidatat ullamco consequat sunt nisi. Reprehenderit enim cillum nisi eu voluptate occaecat laborum pariatur dolor qui. Proident pariatur deserunt consequat sint ut non elit.\r\nCillum anim laborum in anim irure veniam ut. Pariatur deserunt ea commodo non minim dolor. Culpa exercitation voluptate anim voluptate minim consectetur nostrud velit proident labore duis magna commodo. Ut ad qui laborum pariatur incididunt laborum mollit. Labore quis magna sunt aute id dolore dolore aute dolor elit incididunt Lorem labore.\r\nAliqua magna amet enim aliquip qui quis est consequat tempor occaecat laboris. Commodo officia irure eu proident officia labore ea dolor excepteur exercitation laborum aliqua. Esse aute elit commodo duis aliquip culpa. Minim ipsum pariatur aute sit. Nisi ea commodo excepteur in ullamco quis ut. Tempor officia fugiat est sunt. Nisi in elit nulla quis nulla nulla reprehenderit do culpa adipisicing.\r\nEt nulla officia in eu id eiusmod. Consequat veniam ea fugiat veniam. Duis qui nostrud veniam mollit. Aliqua enim proident proident eiusmod irure adipisicing voluptate fugiat Lorem sunt laborum do. Do consequat dolor sunt sit consequat ea adipisicing.\r\nAnim consequat duis nulla dolor esse reprehenderit velit velit laborum incididunt aliqua culpa excepteur enim. Ut mollit adipisicing sunt reprehenderit quis in incididunt pariatur irure consequat ad magna. Nulla et id commodo quis enim.\r\nEnim quis amet laborum amet dolor deserunt deserunt officia adipisicing. Exercitation in laboris mollit anim. Consectetur adipisicing aliqua quis dolor nisi occaecat velit aliquip labore voluptate aute. Laboris nisi nulla consequat et ullamco nostrud amet qui culpa labore.\r\nEa exercitation in nisi commodo. Elit tempor cillum quis reprehenderit irure incididunt velit aliqua et enim consequat. Nostrud est ullamco cupidatat consequat proident ipsum duis occaecat reprehenderit. Nulla sint consequat laborum amet labore reprehenderit veniam adipisicing veniam nisi officia ex. Laboris non deserunt occaecat ullamco ea qui. Eiusmod exercitation ut irure excepteur. In cillum magna ex cupidatat nisi consequat.\r\nConsequat ut minim esse sit in magna minim sunt. Aliqua occaecat sint ullamco culpa cupidatat laboris proident aliquip aliqua et ex ea labore voluptate. Ut occaecat Lorem eu deserunt minim proident excepteur commodo exercitation veniam non.\r\nIn ullamco ex nulla irure id aliqua dolor fugiat commodo qui pariatur culpa est velit. Tempor proident aliquip sit quis velit non cupidatat pariatur laborum esse enim Lorem ea consectetur. Nisi mollit culpa ut qui dolor tempor proident consectetur amet sunt eu ipsum adipisicing. Deserunt incididunt reprehenderit minim esse.\r\nAliqua voluptate culpa nisi reprehenderit deserunt voluptate amet irure laborum labore aute Lorem commodo est. Eiusmod sit exercitation reprehenderit irure ad ea. Sint aliqua amet commodo cillum sit adipisicing fugiat fugiat ea aliqua qui consectetur.\r\nUt et reprehenderit labore minim sunt dolore adipisicing sit. Labore cillum id qui minim id qui officia nostrud. Id et labore laborum pariatur ea fugiat sit deserunt non nulla in sunt commodo. Esse minim ipsum nostrud proident veniam Lorem cupidatat. Cupidatat Lorem esse culpa sint ea fugiat dolore proident in exercitation mollit esse in adipisicing. Consectetur labore do reprehenderit aute sunt ad ex esse magna excepteur occaecat id sint.\r\n",
        "rating": 17,
        "language": "Eng",
        "difficulty": "Expert",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e55a26644c69a5f7a",
        "trainers": [
            {
                "id": "5b66c10e0abd081917f1cd0e",
                "name": "Ewing Clemons",
                "avatar": "https://randomuser.me/api/portraits/women/43.jpg"
            },
            {
                "id": "5b66c10ee59c9b7e98988c37",
                "name": "Melendez Sims",
                "avatar": "https://randomuser.me/api/portraits/men/52.jpg"
            },
            {
                "id": "5b66c10ea0b81de5186f95f0",
                "name": "Jimmie Gates",
                "avatar": "https://randomuser.me/api/portraits/men/69.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=5",
        "date": "2018-12-13T04:26:50",
        "duration": 438,
        "title": "enim fugiat tempor commodo",
        "description": "Fugiat ex enim est est occaecat amet ullamco duis dolore eu quis excepteur irure. Ullamco veniam aliquip voluptate quis dolore excepteur proident nulla amet nulla aliqua enim exercitation aliquip. Non commodo qui commodo sunt ipsum labore labore. Laborum sit ut pariatur nisi voluptate elit irure cillum proident ut ullamco. Ullamco do veniam tempor elit dolor ut qui quis.\r\nDolor dolore aute sit aute cillum dolor in minim officia adipisicing elit consectetur velit amet. Nisi ut qui culpa nulla consequat nostrud. Culpa anim voluptate ipsum enim laborum. Consequat anim velit ad sunt mollit cillum enim culpa pariatur esse. Aliqua cupidatat occaecat exercitation cillum aliquip dolor voluptate do et minim. Consequat fugiat id do mollit veniam consectetur est id.\r\nPariatur elit amet irure irure sint irure et. Amet dolore dolore elit non deserunt amet ex Lorem aute nostrud eiusmod aliqua. Nulla nisi non reprehenderit aliqua amet elit in sint aliquip veniam commodo. Pariatur duis ex proident incididunt est sunt culpa dolor consequat eu id quis consectetur eu. Non reprehenderit consequat enim amet culpa sit sit commodo sunt. Incididunt cillum aliqua ipsum ut veniam cillum dolor exercitation est nisi. Deserunt in duis culpa occaecat ipsum cillum Lorem et dolore reprehenderit ad sint officia magna.\r\nId ipsum culpa ullamco incididunt laboris non veniam minim nulla sunt irure veniam Lorem incididunt. Consequat Lorem nulla cillum tempor nostrud nisi. Qui cillum voluptate cillum aliqua nostrud excepteur non cupidatat ad voluptate proident aliquip. Qui voluptate consectetur quis dolor aute occaecat. Adipisicing ullamco Lorem veniam et dolore consequat deserunt.\r\nSint ullamco ea proident est laboris enim magna aute ullamco cupidatat qui est laboris id. Mollit sunt reprehenderit dolore et elit eiusmod dolor. Adipisicing mollit anim qui ut proident ullamco anim aliqua mollit aliquip. Aliquip ullamco id velit duis. Officia cillum proident velit nostrud amet nisi consectetur ipsum aute sunt laboris non. Sit reprehenderit laborum nisi occaecat deserunt pariatur sit. Duis tempor ad occaecat nostrud veniam Lorem sint enim ullamco in cillum.\r\nId cillum laborum quis laborum esse dolor eiusmod laboris. Veniam reprehenderit laborum amet Lorem sit dolore eu ut et enim incididunt. Esse pariatur nulla esse sunt aliquip laborum amet sit do aute eu aliquip laborum cupidatat. In aliqua irure aute non excepteur in nostrud pariatur nulla ut. Id aliqua esse cupidatat ex velit voluptate excepteur ex et.\r\nFugiat nostrud ex enim enim sit aliqua anim amet voluptate sit et dolore non elit. Velit aute exercitation eiusmod ad in eiusmod adipisicing id. Dolor aute ex elit tempor velit incididunt tempor dolor qui. Do aliquip incididunt cupidatat nisi ut aute veniam nostrud dolore amet ipsum laborum reprehenderit cupidatat. Cupidatat id in eiusmod deserunt.\r\n",
        "rating": 13,
        "language": "Rus",
        "difficulty": "Intermediate",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10eda41ae1a0420da11",
        "trainers": [
            {
                "id": "5b66c10e20793fdac1204e7e",
                "name": "Concepcion Shaw",
                "avatar": "https://randomuser.me/api/portraits/men/6.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=20",
        "date": "2018-12-01T09:59:10",
        "duration": 191,
        "title": "elit Lorem et veniam fugiat qui proident ad do magna",
        "description": "Proident aute nisi voluptate laboris enim ex ipsum. Ad mollit ea nisi ea est laborum. Anim adipisicing aliquip pariatur sunt nostrud excepteur cillum eu minim ullamco est mollit.\r\nConsectetur laborum duis velit sit nisi do est reprehenderit ad. Enim consectetur laborum laborum irure. Deserunt excepteur reprehenderit esse in proident excepteur occaecat. Amet ex aliqua id qui in. Officia pariatur ad aute do velit ut minim pariatur. Eiusmod et reprehenderit elit amet in occaecat est laboris. Laborum enim pariatur qui aliqua sint.\r\nIn dolor minim laborum proident anim fugiat culpa minim laboris do. Irure aliquip nulla quis quis sunt eiusmod reprehenderit. Enim mollit Lorem consequat Lorem non aute reprehenderit reprehenderit sint sunt. Ad sint labore minim est reprehenderit non mollit culpa. Exercitation eiusmod anim nulla excepteur minim do mollit enim duis.\r\nNon ut ut pariatur nisi duis nisi commodo commodo nisi. Id elit ex duis reprehenderit proident labore cillum. Non et incididunt consequat anim nulla nisi ut aute velit officia consequat. Proident ea sunt id et commodo nisi sunt ipsum ea consequat laboris ullamco consequat exercitation. Ipsum magna voluptate amet magna reprehenderit enim. Do dolore aliquip veniam eu ipsum. Fugiat ad reprehenderit commodo cillum irure.\r\nVeniam occaecat irure occaecat eu aute ut proident qui. Dolor aute ipsum dolor sit. Ad elit ut fugiat anim anim aliqua deserunt fugiat velit eu proident occaecat dolor. Labore amet labore dolore nisi in eiusmod pariatur aute consequat deserunt amet reprehenderit. Magna consectetur nulla officia nulla ut. Mollit dolor aliqua cupidatat aliqua est fugiat. Laboris pariatur nulla exercitation duis adipisicing sit.\r\nExcepteur nisi reprehenderit amet ea sint. Sunt minim et ullamco cillum proident. Do sit laborum velit nisi fugiat commodo anim qui eiusmod. Dolor velit duis ut adipisicing amet esse aliqua excepteur sit. Nisi consectetur ut fugiat incididunt officia elit ullamco tempor do amet do id. Ut irure elit ut esse cillum. Elit commodo velit nulla irure.\r\nElit esse deserunt irure consectetur voluptate id ipsum minim id. Pariatur nisi exercitation excepteur ipsum do labore exercitation consectetur commodo laborum. Sunt excepteur exercitation tempor eiusmod do tempor ea ex elit sit duis. Ipsum reprehenderit ex in magna aliquip ad officia est est culpa minim aliquip minim commodo. Do excepteur cupidatat elit anim in.\r\nIn consequat commodo non labore ullamco excepteur consectetur veniam incididunt officia ad laboris. Velit fugiat qui quis mollit ad sit ex sit irure. Sunt nisi et in commodo nostrud do duis fugiat ad.\r\n",
        "rating": 22,
        "language": "Esp",
        "difficulty": "Expert",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e75824fde1b55d17b",
        "trainers": [
            {
                "id": "5b66c10e9077566edac3c871",
                "name": "Barker Bentley",
                "avatar": "https://randomuser.me/api/portraits/women/60.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=12",
        "date": "2018-08-31T09:32:37",
        "duration": 460,
        "title": "occaecat occaecat proident",
        "description": "Eiusmod sint consequat aliquip sint ea. Deserunt ad cillum in nostrud sunt non laboris velit est. Laboris deserunt voluptate et aute esse non sunt amet do laborum. Nostrud cillum sint cillum aliquip culpa Lorem nostrud amet Lorem anim dolore.\r\nReprehenderit sit reprehenderit laboris sint nisi. Deserunt ipsum ad ad adipisicing laboris enim sit duis minim. Velit adipisicing veniam incididunt esse. Nulla pariatur nulla magna sunt quis fugiat. Incididunt aliquip nulla eu aliqua commodo aliquip mollit. Excepteur elit consequat irure anim pariatur fugiat in. Lorem ut commodo voluptate aute consectetur deserunt commodo.\r\nProident voluptate sit et amet dolore velit cillum aute duis sit in voluptate do et. Reprehenderit magna elit quis enim in aute exercitation occaecat aliquip tempor veniam nisi. Consequat magna pariatur ullamco nisi velit do ea ea cupidatat sit. Laboris incididunt cillum culpa cupidatat. Consectetur sit incididunt ad dolor esse amet elit adipisicing cupidatat eu labore velit. Qui consequat est pariatur commodo eu ad dolore.\r\nAdipisicing laborum pariatur id laboris labore consectetur magna fugiat ad aliquip in labore. Proident eu labore esse irure esse voluptate deserunt deserunt ullamco. Adipisicing dolor reprehenderit sint cillum et occaecat consequat eu commodo Lorem cupidatat. Quis veniam officia commodo officia laboris enim irure veniam fugiat. Deserunt enim cupidatat minim irure sit veniam dolore ex commodo.\r\nAnim irure adipisicing Lorem elit cupidatat irure sint eu. Nisi culpa irure fugiat deserunt irure sunt ea irure reprehenderit exercitation consequat eiusmod eu. Ad esse irure aliquip elit ipsum dolor culpa irure occaecat reprehenderit. Officia nostrud esse dolore amet qui. Ullamco in excepteur velit qui mollit proident officia in.\r\nCupidatat nisi quis dolor aliqua ipsum sit exercitation sit anim voluptate Lorem dolore magna. Reprehenderit ut id labore Lorem adipisicing ut pariatur esse occaecat quis velit cillum. Eu consectetur deserunt eu elit. Minim cupidatat officia sit cillum magna. Nostrud irure in ullamco ut ullamco aliquip qui id est ex fugiat cillum commodo ex. Ex aliqua tempor ullamco labore voluptate voluptate incididunt eiusmod. Consequat minim minim deserunt ut.\r\nAd tempor occaecat velit mollit aute pariatur in est amet. Ipsum excepteur pariatur sit esse consequat. Ullamco consectetur consequat cillum consequat qui laboris elit proident consequat laborum exercitation excepteur. Commodo commodo eu non consequat consequat id duis Lorem labore dolore aute. Sunt consectetur reprehenderit mollit duis voluptate incididunt fugiat ex minim veniam sit.\r\nLabore esse officia irure fugiat ut aliquip tempor minim enim pariatur laboris dolor ut mollit. Reprehenderit amet deserunt aliquip nostrud quis ea nisi elit consequat. Reprehenderit sunt nostrud veniam dolore consectetur dolore. Adipisicing aliquip excepteur minim officia exercitation labore laboris qui qui et commodo irure deserunt. Sit officia nostrud in consectetur velit ullamco.\r\nLorem eu laboris incididunt exercitation fugiat voluptate culpa adipisicing in dolore irure enim anim quis. Duis nisi exercitation commodo velit anim fugiat est Lorem pariatur enim mollit. Cupidatat dolor aute culpa voluptate elit aliqua ut do laboris in excepteur. Consequat consectetur amet nulla magna sit dolor consequat id. Fugiat culpa non consectetur proident esse incididunt amet esse.\r\nPariatur deserunt officia tempor ullamco fugiat ad. Culpa amet velit eu reprehenderit dolore aliquip. Deserunt aliqua non sunt eu mollit anim pariatur deserunt cupidatat adipisicing tempor ullamco. Labore irure culpa excepteur ullamco sit nostrud elit adipisicing cupidatat laboris Lorem esse minim.\r\nQuis sit ut quis occaecat eu occaecat aute nisi sunt aute laboris voluptate dolore sint. Aute in et id qui exercitation nulla excepteur amet Lorem id eu consequat fugiat. Exercitation consectetur sint nisi tempor cupidatat eiusmod esse ex adipisicing exercitation. Lorem enim nulla in dolor do aliquip minim est.\r\n",
        "rating": 34,
        "language": "Rus",
        "difficulty": "Expert",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ee7d5928a8eab2123",
        "trainers": [
            {
                "id": "5b66c10e4626e41e2669055e",
                "name": "Sheri Marsh",
                "avatar": "https://randomuser.me/api/portraits/men/55.jpg"
            },
            {
                "id": "5b66c10e9d8d8d2843439bc2",
                "name": "Lacey Figueroa",
                "avatar": "https://randomuser.me/api/portraits/men/65.jpg"
            },
            {
                "id": "5b66c10e4662f63bdbe7f20d",
                "name": "Beryl Donaldson",
                "avatar": "https://randomuser.me/api/portraits/women/27.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=17",
        "date": "2018-09-12T06:20:49",
        "duration": 192,
        "title": "sit voluptate laborum enim est",
        "description": "Enim aliqua nostrud nulla ad qui cupidatat cillum pariatur dolor ipsum. Aute fugiat dolore sit ex adipisicing sunt cillum aute ullamco Lorem excepteur. Nulla occaecat sit in nisi. Sit incididunt voluptate voluptate officia dolor laborum sint. Sunt est nisi cupidatat quis commodo qui reprehenderit aute minim Lorem cupidatat qui deserunt incididunt.\r\nAmet mollit aliqua nulla consectetur consequat officia ex aute. Aliqua irure ipsum ex nostrud aute laboris do eiusmod. Aliquip id enim sit proident proident eiusmod elit voluptate ex anim cillum culpa. Culpa reprehenderit ad cupidatat ex laborum Lorem irure deserunt nulla aliqua magna velit occaecat est.\r\nIpsum minim ipsum incididunt minim amet labore. Excepteur ut in non ullamco aute quis voluptate id eiusmod duis mollit in. Fugiat consequat anim reprehenderit excepteur proident magna laborum laboris. Minim eiusmod sit commodo ullamco quis ipsum. Non magna sint ut consequat elit ex exercitation sint.\r\nSit reprehenderit commodo aliquip commodo pariatur exercitation in labore tempor sunt eiusmod aliqua. Occaecat commodo laboris qui do anim. Mollit nostrud ea sunt eiusmod non.\r\nAute culpa exercitation do elit consequat laborum velit culpa amet eu excepteur magna sunt aliqua. Nisi et pariatur tempor eu ipsum incididunt excepteur enim minim duis. Occaecat magna tempor do consequat nostrud. Aliqua eu adipisicing proident adipisicing ex voluptate dolor. Labore dolor cillum adipisicing magna ut ex ut elit. Cillum aliqua Lorem Lorem nisi exercitation minim nostrud ipsum magna consectetur. Commodo sunt qui duis cillum laborum in excepteur laboris.\r\nEx ad minim excepteur anim veniam dolore sit nulla aliquip proident dolor qui nulla. Labore eu est voluptate et Lorem fugiat mollit in incididunt. Mollit proident labore mollit laboris duis occaecat fugiat nostrud. Occaecat eiusmod culpa ex proident est consequat velit ea aliquip aute aliquip. Fugiat consequat ea eiusmod mollit ea minim excepteur.\r\nCulpa labore magna veniam irure incididunt ullamco amet officia eu tempor elit ad. Aliquip veniam et irure cupidatat nulla in ex et. Laborum occaecat exercitation tempor amet id nulla anim fugiat. Pariatur et quis aliquip fugiat adipisicing officia dolor in sit est duis. Labore culpa eiusmod reprehenderit elit do Lorem consectetur incididunt esse occaecat proident. Sunt aute aute in dolore anim et magna voluptate ex dolor et laboris aute. Ad quis proident dolor cupidatat qui mollit ipsum non ex laborum quis nostrud.\r\nCupidatat cupidatat eiusmod Lorem deserunt dolor fugiat in quis nostrud nostrud veniam amet nostrud. Nostrud qui nulla labore ad laborum anim laboris anim dolor. Occaecat consequat exercitation est aliquip amet eiusmod amet pariatur commodo ad. Culpa dolore dolor exercitation veniam ea Lorem sit Lorem occaecat ullamco enim dolor.\r\nSint labore dolor culpa consectetur culpa exercitation. Duis laborum magna labore ut incididunt eiusmod ad culpa mollit. Ut consectetur laboris culpa deserunt aliquip minim. Exercitation voluptate culpa sunt anim officia ad.\r\nMinim nulla velit ad do. Consectetur et eu id voluptate laboris sint velit. Mollit proident ad dolore in aliquip nostrud deserunt et laborum veniam id aliquip ipsum. Laborum ullamco veniam incididunt elit incididunt esse proident in.\r\nElit adipisicing ea duis deserunt amet est nisi veniam amet officia pariatur. Officia qui excepteur eu anim officia veniam quis et excepteur ut ut enim elit. Incididunt non aliquip magna dolor culpa quis proident sint culpa nisi exercitation. Quis fugiat in velit officia nulla adipisicing enim minim aute irure. Ullamco est nisi labore esse aute et culpa. Aute anim qui reprehenderit amet.\r\nAmet est aliqua nostrud aliquip ullamco aute labore do ullamco. Culpa ex aute sunt laboris occaecat voluptate nostrud consectetur laboris irure minim. Deserunt quis tempor exercitation anim enim Lorem ad reprehenderit non incididunt veniam nisi adipisicing. Proident aliqua cillum Lorem excepteur tempor consequat esse deserunt ea deserunt. Deserunt ea voluptate nisi sunt. Esse proident incididunt Lorem fugiat esse exercitation velit aliqua velit aliquip.\r\nAnim anim non exercitation esse sit non exercitation labore. Aliqua voluptate nisi mollit ex ex eu sit ea ea sit pariatur labore. Fugiat sint deserunt enim quis veniam officia commodo. Labore consequat culpa ex pariatur laborum eu.\r\n",
        "rating": 29,
        "language": "Fra",
        "difficulty": "Expert",
        "type": "Video course",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ed1452ae5a85034cd",
        "trainers": [
            {
                "id": "5b66c10e00aff27964b84b6b",
                "name": "Tommie Young",
                "avatar": "https://randomuser.me/api/portraits/men/32.jpg"
            },
            {
                "id": "5b66c10e7a1a24d65c2e079c",
                "name": "Bradshaw Riggs",
                "avatar": "https://randomuser.me/api/portraits/men/28.jpg"
            },
            {
                "id": "5b66c10edf9f452ca0db1db1",
                "name": "Bessie Macdonald",
                "avatar": "https://randomuser.me/api/portraits/women/20.jpg"
            },
            {
                "id": "5b66c10e30a2567f8391534c",
                "name": "Marva Valentine",
                "avatar": "https://randomuser.me/api/portraits/men/59.jpg"
            },
            {
                "id": "5b66c10ec950e903c60a7d71",
                "name": "Alvarado Kirk",
                "avatar": "https://randomuser.me/api/portraits/women/40.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=11",
        "date": "2018-10-03T11:24:21",
        "duration": 492,
        "title": "reprehenderit irure dolore",
        "description": "In esse voluptate do aute exercitation magna ea exercitation consequat amet nulla consectetur esse in. Adipisicing est non tempor nulla sint eiusmod voluptate dolor deserunt. Nisi elit non nisi laboris amet laborum culpa aute ullamco laborum. Lorem cillum minim ad nostrud ipsum sit magna do excepteur in non anim. Nisi dolor enim laborum laborum fugiat. Ad cillum in sit sit proident in anim magna. Incididunt laborum amet aliquip minim adipisicing nisi incididunt dolor.\r\nTempor sunt non cupidatat deserunt anim enim qui cupidatat sit. Ipsum nulla anim exercitation irure eu qui minim laborum fugiat aute. Ullamco dolor veniam irure eiusmod enim incididunt irure. Lorem excepteur non in mollit fugiat fugiat.\r\nVelit commodo fugiat nulla qui ullamco occaecat nulla voluptate magna. Nulla nulla elit dolore proident quis eiusmod sunt. Ad aliquip velit et officia proident.\r\nEt fugiat pariatur nisi et cupidatat enim duis irure magna est incididunt incididunt culpa. Voluptate elit dolor excepteur aliquip commodo irure ea ad irure esse aute. Irure cupidatat adipisicing qui eiusmod id laborum deserunt laborum deserunt labore amet duis duis dolor.\r\nAute magna eu aliquip pariatur ad fugiat officia sint in commodo adipisicing. Minim in ipsum cillum occaecat ad. Quis pariatur id enim velit ullamco ut ut aliqua ad pariatur sit. Minim qui occaecat minim magna. Tempor aliquip quis minim do tempor adipisicing ex quis sit. Dolore adipisicing in deserunt magna officia ut duis consequat dolor aliquip.\r\nQui cupidatat incididunt aliquip elit pariatur elit commodo fugiat eiusmod dolore fugiat incididunt culpa. Ullamco nostrud Lorem commodo labore dolor sit qui dolor amet commodo occaecat. Magna cillum aliqua ipsum non reprehenderit pariatur ipsum commodo. Ea veniam est ullamco laborum ex eu laborum. Sunt eiusmod magna eu in aliquip commodo cupidatat elit ex. Ad ad cillum magna tempor cupidatat irure sunt culpa in culpa.\r\nExercitation in laborum sit amet commodo et nostrud sit aliqua. Officia anim cillum quis cillum consequat dolore esse ex magna cupidatat do ad magna consectetur. Ut voluptate officia sit pariatur eiusmod ex aliquip cillum exercitation in deserunt officia nisi ullamco. Dolore est sit consequat cillum in. Nulla nulla excepteur magna aliquip laborum aute est cupidatat.\r\n",
        "rating": 24,
        "language": "Fra",
        "difficulty": "Novice",
        "type": "Seminar",
        "isFavorite": true
    },
    {
        "_id": "5b66c10eb7bd965cfdefdcfb",
        "trainers": [
            {
                "id": "5b66c10e45d2c546133129f8",
                "name": "Wanda Kim",
                "avatar": "https://randomuser.me/api/portraits/women/56.jpg"
            },
            {
                "id": "5b66c10e3e1c0995dda951d4",
                "name": "Colette Small",
                "avatar": "https://randomuser.me/api/portraits/men/47.jpg"
            },
            {
                "id": "5b66c10efdd0e9c5108f4099",
                "name": "Vicky Cline",
                "avatar": "https://randomuser.me/api/portraits/men/23.jpg"
            },
            {
                "id": "5b66c10ee0a5def4515dcad1",
                "name": "Vonda Holloway",
                "avatar": "https://randomuser.me/api/portraits/men/53.jpg"
            },
            {
                "id": "5b66c10e6e080064fd817af2",
                "name": "Francis Burgess",
                "avatar": "https://randomuser.me/api/portraits/men/5.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=12",
        "date": "2018-10-30T05:43:02",
        "duration": 478,
        "title": "amet consectetur occaecat consequat quis ullamco ea ea non",
        "description": "Labore voluptate do esse sunt est incididunt enim eiusmod ullamco excepteur veniam reprehenderit. Veniam cupidatat ex veniam consectetur aute. Deserunt non sit laboris exercitation proident adipisicing adipisicing adipisicing fugiat quis. Laboris aliqua commodo ea magna esse labore amet cillum laboris.\r\nNostrud pariatur ipsum incididunt sint cillum nulla elit nisi dolore sunt elit occaecat. In irure do laboris mollit nulla. Esse commodo duis cillum ex elit cillum ea enim occaecat Lorem commodo non non. Cupidatat velit commodo laborum ullamco proident laboris ipsum elit sunt non veniam do.\r\nIncididunt consequat consequat ullamco quis. Sit reprehenderit deserunt deserunt est dolore velit pariatur exercitation minim consequat. Commodo commodo amet ut ea tempor tempor laboris reprehenderit voluptate. Eu tempor aute ad cupidatat quis elit eu. Quis est ea laborum do dolor velit culpa laboris. Lorem ullamco deserunt consectetur consectetur est incididunt aliquip nulla. Dolore esse anim voluptate culpa ea officia velit voluptate ipsum ipsum cupidatat sit et adipisicing.\r\nPariatur reprehenderit consequat excepteur magna laborum in proident proident. Duis quis sunt qui aliqua commodo id tempor officia adipisicing amet ea id. Ad ex nisi sit mollit officia duis irure minim. Nisi laboris esse adipisicing sunt aliqua culpa ex occaecat elit aliqua consectetur et. Ea cillum enim in aliquip irure et.\r\n",
        "rating": 22,
        "language": "Esp",
        "difficulty": "Novice",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e57a869b727937a9c",
        "trainers": [
            {
                "id": "5b66c10e6f2faac73023175a",
                "name": "Isabel Bradford",
                "avatar": "https://randomuser.me/api/portraits/men/30.jpg"
            },
            {
                "id": "5b66c10e8e9b0aea5aea86c1",
                "name": "Frazier Sharp",
                "avatar": "https://randomuser.me/api/portraits/men/13.jpg"
            },
            {
                "id": "5b66c10e454b4416907aa87f",
                "name": "Christi Flowers",
                "avatar": "https://randomuser.me/api/portraits/women/49.jpg"
            },
            {
                "id": "5b66c10eb1b10611b8522a1b",
                "name": "Mills Waller",
                "avatar": "https://randomuser.me/api/portraits/women/58.jpg"
            },
            {
                "id": "5b66c10e540b3edf2008031e",
                "name": "Stephens Anthony",
                "avatar": "https://randomuser.me/api/portraits/men/25.jpg"
            },
            {
                "id": "5b66c10e5630ff84222e6947",
                "name": "Shana Le",
                "avatar": "https://randomuser.me/api/portraits/women/24.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=2",
        "date": "2018-08-07T10:18:25",
        "duration": 54,
        "title": "laborum et culpa irure enim ea eu velit ipsum dolor",
        "description": "Magna dolor mollit ullamco duis eu voluptate. Enim nulla eu commodo dolore commodo culpa eu est eiusmod. Consequat irure elit dolore ut voluptate cillum. Aliquip esse minim tempor dolor aliqua occaecat consequat cillum.\r\nIncididunt labore qui cupidatat consequat tempor pariatur fugiat fugiat. Aliqua est laborum dolore culpa anim mollit est eu pariatur sunt dolore deserunt adipisicing ut. Dolore culpa pariatur proident officia Lorem culpa ut elit. Mollit fugiat reprehenderit duis ut irure reprehenderit exercitation commodo amet. Consectetur ipsum veniam ex consequat aliqua incididunt culpa amet mollit ea. Deserunt qui nisi excepteur enim. Veniam do mollit Lorem dolore velit ad duis.\r\nMagna et ad ea exercitation consequat fugiat ullamco. Laborum cupidatat aute magna voluptate. Laboris in labore cupidatat ea aliqua occaecat voluptate voluptate. Veniam minim consectetur culpa labore. Ipsum id magna sint duis. Irure sit aute ea cillum. Laborum nulla et et enim aute fugiat ullamco consectetur ad labore.\r\nUt cupidatat sunt mollit quis aliquip. Mollit officia amet sint nostrud dolor incididunt sint culpa exercitation et mollit. Ullamco excepteur ipsum proident dolor ullamco aliquip velit nisi mollit mollit fugiat cupidatat aliqua excepteur. Aliquip fugiat ipsum nostrud magna duis magna et cillum fugiat commodo pariatur aute ipsum commodo. Lorem velit excepteur ut cupidatat et.\r\nUllamco ea tempor commodo reprehenderit ex. Anim nulla cillum magna exercitation amet do ipsum mollit. Irure ad in laboris dolore enim enim reprehenderit ullamco qui.\r\nAmet sunt tempor consequat et consectetur proident cupidatat sunt anim dolore dolor reprehenderit tempor. Dolore tempor duis eiusmod sint officia amet dolor qui magna consequat. Tempor commodo anim nisi enim ex consequat magna sint aliqua aute minim. Cillum amet laboris do eu eu qui dolor mollit quis labore in. Occaecat adipisicing laboris nulla sunt incididunt. Et commodo incididunt laboris anim cillum est pariatur id.\r\nSunt tempor officia pariatur minim tempor est nulla veniam. Id nulla eu velit pariatur qui dolor. Ea sit culpa voluptate esse. Et aliquip eu adipisicing ad ad pariatur magna sint culpa. Ea excepteur commodo veniam Lorem magna quis.\r\nElit exercitation proident ipsum in sint. Laboris eu reprehenderit eu et sunt consequat. Ipsum enim tempor ea occaecat voluptate laboris sint esse. Labore eiusmod tempor elit amet amet dolor voluptate magna commodo non consequat pariatur ullamco. Officia nulla commodo voluptate fugiat et ea est aute commodo deserunt culpa nisi enim occaecat. Non est nisi exercitation sint sunt esse aute. Mollit do laboris quis dolor duis proident commodo esse anim sit.\r\nCillum consectetur labore commodo aliquip. Eiusmod in dolore pariatur ullamco nostrud voluptate qui do voluptate voluptate ipsum. Sunt laboris ea amet consectetur proident dolor sunt aliqua ipsum quis. Minim aliquip in dolore cupidatat ullamco aliqua elit incididunt aute tempor mollit magna sit. Exercitation nulla exercitation dolore enim aliqua voluptate magna enim mollit in sint excepteur in.\r\nOfficia enim occaecat consectetur officia tempor consectetur culpa consequat aliqua id. Nostrud laboris cupidatat fugiat adipisicing veniam incididunt esse. Amet id esse quis cillum. Anim consectetur ipsum ex aliqua sunt amet laborum. Tempor Lorem Lorem est sit voluptate consequat culpa Lorem proident. Deserunt in occaecat sunt amet.\r\nEt officia irure eiusmod proident voluptate nulla sint excepteur sint aute reprehenderit. Ipsum nostrud id velit occaecat voluptate sunt sint aliqua commodo aliquip eu. Esse laborum id magna labore laboris proident dolor. Cupidatat occaecat non do qui non ex consequat id culpa mollit. Dolor Lorem culpa ex est proident magna ea sunt laborum nisi elit dolore nostrud. Qui culpa velit et mollit non nulla nisi eiusmod eiusmod duis.\r\nOccaecat amet aliqua elit fugiat in sit pariatur Lorem laboris Lorem anim sint. Eiusmod sit dolore mollit consectetur excepteur consectetur est sunt laborum nostrud deserunt. Labore tempor ex qui in ad Lorem velit enim officia ex. Adipisicing amet sint commodo dolore dolor. Non ipsum pariatur veniam consequat Lorem adipisicing culpa elit sunt cupidatat sunt voluptate laborum officia. Magna velit ea non ipsum aliqua sit.\r\nAnim ipsum ullamco ea nisi laboris anim. Qui proident enim in laboris in amet occaecat non dolore laboris elit. Tempor ad voluptate sit nulla aute incididunt adipisicing cillum in aute ut. Ea excepteur sint non in elit. Aliqua nulla culpa labore consequat laboris reprehenderit nisi commodo id culpa ut non est velit.\r\nDuis cupidatat culpa cillum tempor officia consectetur adipisicing cillum proident ullamco cupidatat ea velit incididunt. Quis ullamco incididunt cupidatat commodo aliquip ex exercitation amet laborum sunt non cupidatat laborum. Et ipsum magna sint ut.\r\n",
        "rating": 14,
        "language": "Pol",
        "difficulty": "Expert",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e64d9be34fc00e71b",
        "trainers": [
            {
                "id": "5b66c10ec3a0cfdfcd3f72e7",
                "name": "Leann Cash",
                "avatar": "https://randomuser.me/api/portraits/women/61.jpg"
            },
            {
                "id": "5b66c10e2890d856c31b31af",
                "name": "Craig Bowman",
                "avatar": "https://randomuser.me/api/portraits/women/51.jpg"
            },
            {
                "id": "5b66c10e6b4ff815122225c5",
                "name": "Hannah Schwartz",
                "avatar": "https://randomuser.me/api/portraits/women/63.jpg"
            },
            {
                "id": "5b66c10ea3b7abf0ef2b89e2",
                "name": "Neal Bright",
                "avatar": "https://randomuser.me/api/portraits/men/53.jpg"
            },
            {
                "id": "5b66c10eb4f75541c24d1fb8",
                "name": "Wilder Battle",
                "avatar": "https://randomuser.me/api/portraits/women/43.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=20",
        "date": "2018-08-11T11:13:36",
        "duration": 448,
        "title": "esse adipisicing laborum",
        "description": "Irure ipsum eiusmod ex consequat Lorem. Labore et tempor est nisi qui in anim ex sunt cupidatat voluptate ipsum. Magna nulla enim aliquip eiusmod duis aliquip.\r\nSunt duis ullamco eiusmod sit voluptate. Laborum fugiat laboris ex deserunt consequat aliqua consectetur sint excepteur ea Lorem in Lorem. Ea commodo Lorem proident cillum reprehenderit dolor velit. Incididunt duis deserunt et cillum pariatur labore in excepteur deserunt reprehenderit quis eu fugiat mollit. Amet dolore esse ex exercitation. Ullamco eiusmod ea reprehenderit sunt. Non veniam excepteur ut esse dolor amet elit eu consectetur ea ipsum reprehenderit.\r\nNulla sit Lorem deserunt ut consectetur do nisi duis veniam fugiat. Nostrud qui duis anim id consectetur ea labore labore do. Culpa irure esse minim amet fugiat in sit pariatur aliqua consequat deserunt. Do exercitation officia est adipisicing ea veniam do ut tempor consectetur laboris occaecat nisi sint.\r\nEa minim cillum laboris laborum duis et ex exercitation magna irure. Veniam aliquip fugiat officia occaecat ipsum cillum ipsum adipisicing ullamco. Duis reprehenderit esse sint reprehenderit nulla elit. Ullamco laboris in anim quis consequat voluptate sint esse id commodo aliqua.\r\nAliquip mollit sint officia quis officia anim nisi in nisi proident in minim eu consectetur. Minim anim consequat et irure nisi aliqua cillum nisi sunt dolore veniam. Ipsum anim veniam mollit velit ad deserunt amet non.\r\nTempor pariatur aute eiusmod nisi magna anim. Proident ullamco veniam magna id sunt velit nulla ea fugiat reprehenderit cillum occaecat. Amet enim ipsum commodo sit do consectetur pariatur minim aliqua. Irure enim anim est aliquip esse irure. Reprehenderit exercitation enim reprehenderit ut tempor excepteur. Adipisicing amet quis nostrud cupidatat eiusmod ut labore veniam ea sit ea. Amet adipisicing deserunt elit ex consectetur eu cillum ea deserunt id.\r\nDeserunt et amet magna fugiat pariatur eu exercitation pariatur pariatur eu reprehenderit labore. Qui duis est laborum sit eu exercitation anim voluptate dolor sunt occaecat culpa. Ea incididunt veniam occaecat labore anim nisi dolor pariatur commodo minim irure nisi. Tempor irure in non eu nisi deserunt esse.\r\nDuis ullamco enim reprehenderit consectetur minim est aliqua nulla voluptate nostrud duis exercitation fugiat esse. Lorem amet sunt do ad ut. Nulla esse deserunt duis aliqua nulla commodo adipisicing ad eu sint dolor enim voluptate ex. Cupidatat irure est ad et consectetur laborum.\r\nLabore magna aliquip excepteur ad pariatur dolor consequat elit eiusmod ea ut in voluptate. Tempor pariatur eu officia sint non aute. Et occaecat ad mollit esse dolor officia est.\r\nDuis fugiat laborum officia nisi mollit. Et exercitation culpa anim aliquip laborum irure aliqua Lorem adipisicing non nulla. Sit labore pariatur occaecat sit ex officia in. In incididunt sit in cupidatat aliqua proident officia exercitation ad anim do. Anim et aute ipsum reprehenderit occaecat tempor sunt aute consequat laboris nisi.\r\n",
        "rating": 12,
        "language": "Esp",
        "difficulty": "Novice",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e16c3a8f306486ccc",
        "trainers": [
            {
                "id": "5b66c10e7eff1010ced998c5",
                "name": "Henderson Pacheco",
                "avatar": "https://randomuser.me/api/portraits/men/27.jpg"
            },
            {
                "id": "5b66c10ebefecb25113ea5a0",
                "name": "Billie Fleming",
                "avatar": "https://randomuser.me/api/portraits/men/41.jpg"
            },
            {
                "id": "5b66c10e69195abd9353c831",
                "name": "Leslie Mcclain",
                "avatar": "https://randomuser.me/api/portraits/women/28.jpg"
            },
            {
                "id": "5b66c10efa524dc94535fde9",
                "name": "Agnes Donovan",
                "avatar": "https://randomuser.me/api/portraits/women/23.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=4",
        "date": "2018-10-04T07:24:18",
        "duration": 33,
        "title": "dolor id proident sunt anim",
        "description": "Incididunt aliqua aliqua ut id aliqua est minim reprehenderit nisi pariatur cupidatat cillum in consectetur. Occaecat ex dolore anim fugiat fugiat cillum irure eu. Pariatur qui velit nulla irure sint do deserunt ea amet ullamco consectetur sunt. Adipisicing eiusmod qui nulla ipsum labore est non consectetur in pariatur proident. Ut sit minim est enim deserunt exercitation ad est ex in laborum magna. Adipisicing in culpa magna et magna nostrud dolor. Id laboris ad laborum officia nulla deserunt pariatur voluptate deserunt.\r\nId aute esse cillum nostrud dolor commodo est excepteur excepteur duis et anim. Ea et deserunt officia magna ea aliqua nostrud dolor minim commodo nostrud sit. Voluptate commodo minim anim commodo magna velit ex veniam ipsum. Consectetur exercitation ea exercitation id Lorem enim occaecat Lorem do officia elit sit deserunt do.\r\nMinim labore incididunt in quis esse commodo aute et. Non enim est dolor sint sunt veniam tempor proident. Amet sint dolore cupidatat ad quis ea. Sunt quis ullamco sunt irure irure exercitation et qui fugiat.\r\nLabore anim anim eu eiusmod duis reprehenderit id id. Fugiat nisi enim est deserunt enim incididunt culpa ad irure incididunt amet exercitation enim nostrud. Anim laborum duis occaecat do reprehenderit cillum dolor. Ullamco aliquip ea proident ut ipsum consectetur sunt occaecat est pariatur aliqua irure nisi. Ullamco Lorem velit quis ipsum.\r\nQui anim non non esse dolor. Esse proident elit eu sit. Ad sunt culpa sunt mollit non sunt tempor deserunt ipsum. Officia laborum enim magna aute Lorem nisi occaecat voluptate deserunt id. Ea enim qui reprehenderit commodo enim. Ullamco elit commodo laboris reprehenderit magna velit deserunt sit.\r\nDolore cillum adipisicing laborum occaecat irure. Labore tempor nostrud consequat sit irure nulla amet eu laboris mollit amet qui non cupidatat. Reprehenderit anim occaecat pariatur anim sint mollit amet. Amet magna sint amet excepteur velit fugiat. Mollit proident fugiat deserunt ipsum quis. Voluptate minim officia culpa fugiat esse.\r\nLaborum non aliquip pariatur veniam est laborum. Deserunt amet id aute quis duis ipsum. Amet enim sunt sunt anim fugiat voluptate ex aute ad pariatur eu tempor deserunt.\r\nEa id cillum dolor exercitation laborum commodo exercitation. Ad reprehenderit commodo aliquip duis non quis sint sunt consectetur amet dolore dolor minim in. Tempor exercitation consectetur laboris voluptate incididunt laboris ex adipisicing consequat officia do.\r\n",
        "rating": 39,
        "language": "Rus",
        "difficulty": "Novice",
        "type": "Lecture",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e45d72d2d1107d0b7",
        "trainers": [
            {
                "id": "5b66c10e885a6df14b2a7aa8",
                "name": "Edwina Barton",
                "avatar": "https://randomuser.me/api/portraits/women/20.jpg"
            },
            {
                "id": "5b66c10e73753a8d0ba8b744",
                "name": "Sparks Hoover",
                "avatar": "https://randomuser.me/api/portraits/men/40.jpg"
            },
            {
                "id": "5b66c10e94bc7b2afad8f428",
                "name": "Huber Logan",
                "avatar": "https://randomuser.me/api/portraits/women/24.jpg"
            },
            {
                "id": "5b66c10ecbd01e62f02ba887",
                "name": "Molly Cruz",
                "avatar": "https://randomuser.me/api/portraits/women/34.jpg"
            },
            {
                "id": "5b66c10ebb6d8ac66968cdf4",
                "name": "Christa Park",
                "avatar": "https://randomuser.me/api/portraits/men/63.jpg"
            },
            {
                "id": "5b66c10eb2c09722ad5fb098",
                "name": "Fischer Arnold",
                "avatar": "https://randomuser.me/api/portraits/men/4.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=19",
        "date": "2018-08-03T10:48:30",
        "duration": 361,
        "title": "ut ex exercitation magna",
        "description": "Et ad enim commodo proident. Officia quis reprehenderit in culpa elit. Eu occaecat amet aliquip irure. Ea ut consectetur mollit cupidatat tempor. Duis ad et magna adipisicing cupidatat amet laboris est adipisicing aliqua consectetur et esse ex.\r\nNostrud qui ipsum id eu consequat occaecat laboris eiusmod incididunt exercitation cupidatat in. Proident dolore reprehenderit sunt veniam nisi aliqua quis ad Lorem quis. Nisi mollit consequat culpa id qui non dolor aute proident sunt laboris. Irure ullamco ullamco enim culpa Lorem exercitation tempor duis quis ex veniam occaecat excepteur labore. Ipsum enim et duis ad minim laboris fugiat aute commodo est sit aliqua.\r\nDolore aliquip nisi aliquip velit. Quis laborum ipsum irure et sit ad aliquip qui cillum. Sint eu ullamco amet labore consequat proident ipsum aliqua velit exercitation ut officia. Deserunt nulla sunt magna aute. Nulla adipisicing consequat qui elit eu duis occaecat proident quis dolor. In commodo cupidatat ullamco mollit mollit quis Lorem quis mollit anim. Lorem nostrud consequat proident excepteur nostrud.\r\nIn dolore deserunt veniam dolor reprehenderit nostrud eu minim. Velit reprehenderit veniam eu aliqua deserunt pariatur officia quis. Lorem eiusmod fugiat aliquip proident quis ea quis laboris. Reprehenderit velit tempor esse consequat Lorem ullamco consectetur nulla occaecat voluptate laborum eiusmod. Nulla ipsum occaecat commodo aute reprehenderit aliqua est voluptate eu cupidatat sint est. Aute incididunt cillum enim pariatur nulla elit anim minim et consectetur non velit deserunt exercitation. Incididunt officia irure dolor commodo proident consectetur velit aliqua dolore velit aute eu.\r\nFugiat elit irure excepteur dolor tempor esse aute et. Velit anim aliqua enim commodo officia exercitation mollit enim ullamco incididunt sint sunt. Nulla ut ullamco labore ut dolor excepteur enim adipisicing id. Mollit dolore consequat aliquip elit elit minim.\r\nAnim ea aliquip nostrud ullamco veniam adipisicing. Ut quis pariatur elit id est nostrud magna et. Aliqua ex velit tempor et laboris fugiat eiusmod enim. Amet nisi reprehenderit fugiat do do.\r\nAmet qui sit dolor laborum non irure eu dolor esse occaecat. Nulla dolore sit sunt qui in enim cillum duis commodo excepteur. Culpa esse ipsum laboris veniam culpa adipisicing duis incididunt velit duis sit sint. Tempor voluptate culpa dolore ad sint nostrud sunt laborum excepteur. Ad ea elit veniam aliquip. Dolore velit sunt reprehenderit voluptate cupidatat nostrud velit proident veniam fugiat amet. Veniam consectetur velit ullamco dolor.\r\nIpsum ea et commodo irure. Occaecat magna elit officia sit do. Occaecat proident dolore veniam consectetur consectetur eiusmod cillum. Aute nostrud aute exercitation culpa id qui incididunt sit reprehenderit laboris elit. Ipsum dolore dolor adipisicing in et voluptate nulla laboris ea nisi reprehenderit veniam ullamco culpa.\r\nEst irure adipisicing cillum cupidatat irure labore fugiat. Culpa ipsum officia consectetur magna consequat. Incididunt qui voluptate velit anim enim Lorem tempor laboris commodo aliqua qui. Occaecat Lorem excepteur est eu eiusmod eiusmod culpa ullamco dolore commodo excepteur.\r\nDeserunt do eiusmod officia enim sunt magna eu nulla non voluptate velit et eiusmod. Non quis mollit irure laborum fugiat eiusmod laborum sint in minim reprehenderit nulla officia qui. Consectetur aliquip cupidatat consequat pariatur adipisicing pariatur aliquip dolor incididunt. Non sunt fugiat enim deserunt aliqua adipisicing dolore.\r\nExercitation aliqua aliquip tempor qui proident. Ipsum est tempor eiusmod nulla eu reprehenderit esse anim officia magna ullamco velit. Do cupidatat deserunt ullamco anim est consectetur aute irure enim laboris est est mollit proident. Veniam duis fugiat qui sunt aute.\r\nReprehenderit cillum nostrud pariatur qui nulla adipisicing. Non aute esse dolor excepteur exercitation. Qui aliqua adipisicing cupidatat ex consequat reprehenderit esse ea exercitation ut. Enim aute do pariatur qui labore fugiat tempor adipisicing. Ipsum nulla proident eiusmod enim mollit exercitation occaecat culpa quis ex deserunt aliqua non pariatur. Excepteur magna mollit sunt officia tempor est incididunt tempor commodo enim.\r\nExercitation consequat cillum velit eu cillum nisi amet sunt consectetur quis mollit. Sit exercitation occaecat nisi consequat incididunt do proident do quis nulla pariatur. Elit nulla reprehenderit cillum nisi proident exercitation culpa irure nostrud est culpa officia dolor ex. Ea adipisicing est ipsum nulla. Eiusmod dolor esse ex dolor ut irure quis adipisicing enim tempor aute. Laborum proident ut amet voluptate ea exercitation Lorem dolore cillum sit do.\r\n",
        "rating": 33,
        "language": "Pol",
        "difficulty": "Expert",
        "type": "Seminar",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e5d934d127c5fd82b",
        "trainers": [
            {
                "id": "5b66c10e1f751b0ebaec23a5",
                "name": "Ester Waters",
                "avatar": "https://randomuser.me/api/portraits/men/57.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=2",
        "date": "2018-08-09T12:43:55",
        "duration": 315,
        "title": "do cillum sint",
        "description": "Duis adipisicing excepteur dolore enim aliqua Lorem mollit aliquip irure pariatur dolor ea officia. Exercitation non voluptate ut fugiat sit laborum. Ut reprehenderit excepteur Lorem magna. Minim qui ullamco magna culpa adipisicing. Labore Lorem non tempor consequat quis consequat ad incididunt officia eu nulla.\r\nCupidatat nisi mollit incididunt aliquip ipsum incididunt. Anim nisi ipsum laboris magna esse sit anim aliqua ea enim nulla commodo esse dolor. Eu id commodo fugiat ex proident voluptate anim non nulla excepteur magna. Anim do id est irure sit mollit minim ea.\r\nAliquip id anim excepteur labore sint magna Lorem commodo. Exercitation reprehenderit nisi qui tempor. Cillum esse labore pariatur ullamco in anim reprehenderit non duis eu. Ad nulla occaecat id enim do fugiat minim mollit veniam sunt consequat quis. Lorem aliqua esse ad dolor et ut pariatur aliquip cupidatat do sunt exercitation. Fugiat id aute quis do consequat proident do culpa cillum irure.\r\nVoluptate aliqua velit minim excepteur culpa sint elit et excepteur ex sit occaecat. Esse sint magna ex Lorem velit est nisi et proident. Pariatur occaecat eiusmod et commodo deserunt consectetur ut commodo dolor enim est consectetur ipsum. Anim veniam sunt pariatur consequat mollit nisi excepteur irure non veniam deserunt. Qui adipisicing reprehenderit anim officia consequat in. Est elit eiusmod Lorem velit adipisicing eiusmod est sit exercitation labore nulla.\r\nEu aliquip adipisicing commodo consequat aliqua occaecat culpa qui. In incididunt anim sint qui. Commodo cillum nostrud anim consectetur dolore qui irure irure.\r\nFugiat ullamco nisi id velit eiusmod excepteur ullamco eiusmod aliquip tempor. Cupidatat officia est exercitation aute cupidatat velit ex elit. Enim ad esse enim deserunt sint.\r\nUt eu pariatur officia commodo quis ut nulla. Est cupidatat laborum nisi officia sit veniam sunt reprehenderit. Fugiat ex magna occaecat reprehenderit officia incididunt aliqua ex ut ullamco cillum ad aliqua. Ullamco eiusmod in elit elit consectetur reprehenderit sit ullamco irure enim dolore veniam.\r\nConsectetur laborum aute sit duis consequat duis velit laborum in Lorem nostrud. Consectetur ipsum ad magna esse mollit eiusmod eiusmod culpa. Nostrud quis eiusmod et dolore. Sit occaecat veniam incididunt laboris labore elit cillum cupidatat Lorem cillum. Ad amet proident ea irure excepteur minim fugiat est. Aliqua duis quis id adipisicing nostrud. Duis tempor eu in pariatur id ea laboris nostrud est tempor anim quis.\r\nDuis sit cupidatat minim enim. Et anim aute consequat ullamco et laboris ad laborum Lorem aliqua nostrud. Dolor tempor et consectetur et. Fugiat nisi magna aliquip duis. Incididunt eu quis nostrud exercitation ad irure consectetur cillum laborum. Magna do proident aute eiusmod ipsum cupidatat elit in minim dolor fugiat adipisicing pariatur exercitation.\r\nNisi qui pariatur ullamco sit in officia labore non labore officia ipsum cupidatat id minim. Ea sit laboris cillum sit ullamco cillum occaecat commodo. Incididunt Lorem nisi sunt eu deserunt dolore occaecat laborum. Mollit culpa commodo velit dolore dolor cupidatat.\r\nDolor do ut reprehenderit fugiat est pariatur ipsum ullamco sit incididunt duis. Irure non dolor veniam nisi eu exercitation eiusmod. Culpa Lorem aute do Lorem labore anim ex voluptate dolore ex reprehenderit pariatur laboris fugiat.\r\nConsectetur pariatur sit officia adipisicing est dolor est duis consectetur nulla. Laboris magna qui dolore duis ea mollit exercitation nulla elit tempor et ipsum officia. Mollit aliqua consectetur exercitation in sit incididunt.\r\nFugiat velit velit sit laborum irure in pariatur exercitation voluptate cupidatat aute pariatur cupidatat excepteur. Laborum et anim sunt sit laborum aliqua fugiat mollit culpa id labore. Occaecat adipisicing qui Lorem qui qui. Cupidatat sunt dolore ullamco consectetur sint deserunt consequat excepteur ad. Amet excepteur Lorem dolor aliqua ea ipsum et ipsum. Nisi dolor et esse culpa qui reprehenderit. Mollit sit excepteur irure est cupidatat dolor veniam eu nostrud duis occaecat nostrud.\r\nAliqua magna aliquip consequat esse consectetur consequat ut. Quis ut nisi magna ullamco irure ad laborum aliqua voluptate anim dolor labore. Sunt sunt ad do consectetur veniam amet enim deserunt. Aute velit deserunt in irure sit. Fugiat Lorem velit et sit ut et ex exercitation cupidatat. Ipsum esse deserunt labore deserunt amet elit enim commodo elit veniam. Amet consectetur nisi adipisicing officia aliqua aute nostrud consequat.\r\nDolor irure amet cupidatat cupidatat Lorem irure consequat minim in quis id nisi minim. Proident ut anim id Lorem sunt elit nisi ex reprehenderit. Ea eiusmod qui incididunt dolore adipisicing aliqua exercitation esse veniam dolor enim id minim. Non culpa qui voluptate magna nostrud consequat ipsum. Qui eiusmod eu laborum ut.\r\n",
        "rating": 19,
        "language": "Esp",
        "difficulty": "Advanced",
        "type": "Lecture",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e3deaed94c698da44",
        "trainers": [
            {
                "id": "5b66c10eb82fcbee243903d5",
                "name": "Kirsten Mcleod",
                "avatar": "https://randomuser.me/api/portraits/women/61.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=16",
        "date": "2018-11-27T12:52:25",
        "duration": 358,
        "title": "nostrud laboris Lorem sit incididunt esse ut proident sit ut",
        "description": "Elit exercitation cupidatat non deserunt labore elit cupidatat amet amet est exercitation excepteur. Elit irure esse pariatur mollit sunt anim magna labore nisi eiusmod magna. Incididunt ea esse in ut sunt. Labore eu ea ad excepteur irure minim enim. Proident duis veniam incididunt velit officia duis laborum pariatur fugiat eu. Aute enim quis ex reprehenderit adipisicing incididunt aliquip Lorem do.\r\nMagna non proident sit id culpa veniam ipsum et. Cupidatat nulla pariatur exercitation sunt dolore ea elit aute eu consequat tempor et dolore. Ut minim amet in id voluptate dolor occaecat ad aliquip voluptate. Labore aliqua culpa enim anim esse officia. Eu dolore aliquip ut Lorem laborum do qui ut incididunt veniam do. Irure pariatur culpa incididunt adipisicing anim dolore ullamco et voluptate adipisicing qui proident nostrud cupidatat.\r\nLaborum qui irure eiusmod ea ullamco et nostrud commodo adipisicing ipsum nostrud magna. Non amet irure reprehenderit laboris Lorem eiusmod id. Enim ad elit laborum minim cupidatat ullamco ex nulla cupidatat laboris occaecat. Velit consectetur laboris cupidatat commodo culpa enim nisi est sit.\r\nNostrud non et eiusmod veniam reprehenderit elit cillum dolor anim occaecat irure commodo. Excepteur cillum proident tempor cupidatat reprehenderit cupidatat eu veniam. Irure anim irure anim sint aliqua Lorem voluptate nostrud nulla minim sit Lorem reprehenderit. Labore est magna ullamco id ad magna deserunt nisi incididunt amet in veniam voluptate.\r\nAnim commodo occaecat ex commodo excepteur adipisicing labore. Aliquip dolore dolor pariatur adipisicing labore sunt. Reprehenderit deserunt Lorem voluptate ea et. Laborum qui duis culpa fugiat est. Deserunt in anim consequat duis in adipisicing adipisicing officia cupidatat amet duis magna velit. Anim eu fugiat magna qui sunt enim eu. Et non eiusmod nostrud et incididunt.\r\nProident cillum aliqua et occaecat dolore Lorem dolor. Est minim est fugiat voluptate adipisicing mollit tempor ipsum incididunt aliquip sunt ullamco proident. Lorem veniam est laboris nostrud qui cupidatat duis non nulla mollit id laborum consectetur. Qui sint proident incididunt esse velit ex occaecat ea proident officia adipisicing eiusmod.\r\nDo et cupidatat ea velit sunt officia ut anim eu ut consequat minim quis consectetur. Ut irure sit amet aute. In cillum cillum quis veniam deserunt Lorem consequat aute dolor incididunt laborum nulla consectetur. Amet enim Lorem ullamco sunt anim officia exercitation veniam pariatur. Aliquip reprehenderit aliquip nisi duis. Non laboris sit ipsum elit cillum Lorem in nostrud cillum ad ipsum ad qui.\r\nId cillum qui et ea ea id cupidatat et aliqua incididunt deserunt Lorem dolore cillum. Occaecat nulla magna veniam enim dolore. Nisi minim in aliquip non cupidatat est esse consequat elit velit dolore adipisicing. Consequat ex magna culpa tempor Lorem velit voluptate do ut fugiat aliqua. Fugiat eiusmod ipsum ullamco incididunt incididunt qui non aliquip fugiat irure sunt do. Aliquip minim laborum tempor sint minim excepteur aliqua. Labore id ex eiusmod proident dolore exercitation nisi dolor minim.\r\nIn labore aliqua occaecat excepteur labore qui dolore reprehenderit amet. Ullamco et incididunt quis minim deserunt enim. In ad et adipisicing veniam dolore eu ipsum quis cupidatat velit. Officia enim nostrud incididunt aliqua officia ea reprehenderit laboris reprehenderit in mollit minim laborum reprehenderit. Nostrud fugiat laboris ad culpa minim do anim Lorem enim nostrud commodo. Voluptate Lorem cupidatat adipisicing ad eu.\r\nPariatur Lorem dolor ullamco laborum reprehenderit pariatur nisi qui occaecat quis. Veniam excepteur irure occaecat dolore cupidatat ut ex fugiat officia laboris. Do officia duis veniam sunt laborum quis in labore cillum eiusmod magna adipisicing anim anim. Aliquip cupidatat tempor Lorem enim sint fugiat ad. Ad sunt sit dolor amet ex laboris in sit. Do eu officia enim esse sit ut dolor non et enim Lorem.\r\nUt qui sit incididunt consectetur ea culpa ullamco. Pariatur eiusmod consequat incididunt adipisicing commodo Lorem ut proident do eu. Non incididunt sunt elit aliquip id sit velit in Lorem ipsum labore velit enim. Ut consequat et duis laboris elit velit enim eu aliqua fugiat. Aliquip enim amet dolor cillum.\r\n",
        "rating": 18,
        "language": "Eng",
        "difficulty": "Expert",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e68b99578eaf43b10",
        "trainers": [
            {
                "id": "5b66c10ea404629af4772546",
                "name": "Jaclyn Murray",
                "avatar": "https://randomuser.me/api/portraits/women/24.jpg"
            },
            {
                "id": "5b66c10ee11c0f3830ac5dc8",
                "name": "Townsend Dixon",
                "avatar": "https://randomuser.me/api/portraits/men/28.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=6",
        "date": "2018-08-14T08:06:50",
        "duration": 369,
        "title": "laborum fugiat deserunt ea do pariatur",
        "description": "Aliqua nulla dolore esse sint qui aute adipisicing quis excepteur occaecat. Non reprehenderit adipisicing non tempor Lorem reprehenderit commodo fugiat ipsum veniam aliquip laborum duis id. Irure non fugiat irure ullamco ut et irure veniam aliquip ad incididunt ex. Id aliquip occaecat labore dolor consectetur aliquip ullamco est nostrud reprehenderit. Commodo est qui cupidatat cillum nostrud ea labore officia eiusmod. Laboris magna amet sunt esse.\r\nTempor ipsum excepteur officia est non reprehenderit commodo nisi esse magna ut deserunt consectetur non. In adipisicing voluptate laborum nulla eu cillum id sit ex sunt. Exercitation laborum incididunt ea quis adipisicing cillum aliquip laborum eu reprehenderit irure nisi et enim. In nostrud in nisi aliqua fugiat pariatur consequat.\r\nAute sunt duis eiusmod duis nulla ad. Eiusmod irure minim esse minim ullamco anim qui mollit cillum nulla fugiat culpa fugiat. Esse ullamco esse dolor velit culpa sit. Commodo esse et laborum ullamco eu in aute mollit mollit. Magna consequat fugiat aliqua enim excepteur excepteur non.\r\nPariatur elit velit commodo do enim in consequat anim. Excepteur aliquip veniam sint exercitation do irure enim sunt fugiat et. Adipisicing dolore pariatur mollit enim consectetur. Magna dolor aute pariatur nostrud ea et ut aute proident incididunt incididunt excepteur. Laborum ut mollit sunt excepteur tempor anim voluptate cupidatat non fugiat culpa. Veniam eiusmod id veniam consectetur est. Cillum quis adipisicing ullamco fugiat qui velit esse deserunt id.\r\nAd voluptate culpa reprehenderit consequat aute ea Lorem culpa elit enim do. Magna quis minim ullamco aute sint minim ut ea. Non eiusmod culpa dolore et cupidatat ea mollit ex id aliqua enim incididunt. Et minim reprehenderit occaecat dolore aute minim occaecat. Reprehenderit sunt ut Lorem laboris ea ullamco aute non culpa sint in aute irure labore. Ullamco laboris voluptate duis adipisicing eiusmod quis labore.\r\nElit irure est dolore sint exercitation dolor ullamco ad eu mollit dolore dolor id magna. Veniam esse elit aliqua est est nulla ut proident nulla ex. Anim velit qui commodo magna cupidatat nisi aliqua sunt esse deserunt. Tempor mollit tempor tempor enim deserunt commodo occaecat nostrud ipsum sint fugiat in do reprehenderit. Aliqua ut proident voluptate esse velit nulla incididunt ad. Culpa anim elit culpa dolor adipisicing quis veniam incididunt.\r\nConsequat enim cillum cillum cillum laborum nostrud. In irure culpa est aute amet tempor aliqua. Irure ipsum culpa pariatur Lorem laborum. Anim Lorem enim commodo amet.\r\nAnim enim nisi anim ad cillum ex eu Lorem irure sint cupidatat. Ut eiusmod ad Lorem consequat sint fugiat dolor voluptate adipisicing Lorem eu occaecat. Cillum quis elit consequat deserunt ipsum.\r\nEst sit officia ullamco consectetur sint amet. Proident laborum cupidatat nulla aliqua. Dolor non aliquip pariatur velit pariatur eiusmod velit est. Sit incididunt ad cillum consectetur consectetur sit culpa deserunt est sint in sit sint. Non non amet enim eiusmod eu reprehenderit cupidatat Lorem.\r\nDolore eiusmod cillum est irure pariatur minim eiusmod tempor minim. Officia pariatur ipsum minim ut officia elit do adipisicing. Occaecat veniam culpa ad officia laborum qui ea consequat minim reprehenderit sint eu ipsum et. Quis velit qui ipsum in sit fugiat eiusmod sit ut labore veniam esse veniam. Nisi aute incididunt esse et pariatur excepteur nisi aute duis do mollit. Fugiat id exercitation occaecat fugiat sint deserunt eiusmod exercitation deserunt et exercitation Lorem nisi. Sunt incididunt id ipsum cillum ex labore ullamco exercitation incididunt voluptate sit incididunt non.\r\nAute elit aute reprehenderit ad aliqua est irure elit et enim in dolore esse. Nulla labore et quis exercitation duis officia culpa et. Quis enim ea adipisicing cupidatat sunt voluptate aute consequat eiusmod id.\r\nAmet nulla adipisicing reprehenderit reprehenderit quis consectetur amet. Ea officia aliqua ea nulla mollit officia adipisicing culpa sint culpa excepteur. Exercitation incididunt sit velit velit voluptate. Dolore laborum irure proident adipisicing duis deserunt esse ea minim incididunt. Cupidatat fugiat aliqua magna quis consectetur est pariatur et eiusmod aute qui labore labore.\r\nCommodo laboris est mollit nostrud sint. Ullamco amet nisi dolor velit irure tempor in velit non. Veniam fugiat in dolor magna aute aliqua ex. Commodo exercitation magna exercitation amet aliqua anim ut eiusmod eiusmod nostrud et reprehenderit cupidatat reprehenderit. Aliqua sit id ea consequat mollit culpa anim irure deserunt occaecat deserunt culpa anim. Aliquip ullamco consequat consequat irure fugiat id enim duis mollit qui labore nostrud proident. Duis do non cillum consectetur velit ipsum incididunt dolore qui esse proident.\r\n",
        "rating": 32,
        "language": "Eng",
        "difficulty": "Expert",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e63f62e4814d5b2c1",
        "trainers": [
            {
                "id": "5b66c10e384639f1e535f51c",
                "name": "Vincent Holcomb",
                "avatar": "https://randomuser.me/api/portraits/men/30.jpg"
            },
            {
                "id": "5b66c10ea5e10d6b5aabcc07",
                "name": "Hickman Kelley",
                "avatar": "https://randomuser.me/api/portraits/women/14.jpg"
            },
            {
                "id": "5b66c10edffa458fa3179de7",
                "name": "Dominique Nicholson",
                "avatar": "https://randomuser.me/api/portraits/women/20.jpg"
            },
            {
                "id": "5b66c10ebb80209fb166dc40",
                "name": "Hancock Steele",
                "avatar": "https://randomuser.me/api/portraits/men/27.jpg"
            },
            {
                "id": "5b66c10e181b6ee5ba997672",
                "name": "Sheppard Gilmore",
                "avatar": "https://randomuser.me/api/portraits/women/52.jpg"
            },
            {
                "id": "5b66c10ee6611ed59edfcf46",
                "name": "Karin Tyson",
                "avatar": "https://randomuser.me/api/portraits/women/24.jpg"
            },
            {
                "id": "5b66c10e4873acca4373566a",
                "name": "Freda Christensen",
                "avatar": "https://randomuser.me/api/portraits/women/16.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=15",
        "date": "2018-10-30T06:28:16",
        "duration": 247,
        "title": "sint pariatur fugiat tempor nisi cupidatat",
        "description": "Proident adipisicing nulla cillum in quis duis amet occaecat nisi nulla sit Lorem. Mollit eiusmod do dolore nulla aliquip exercitation in anim fugiat aliqua. Amet in eu minim anim. Exercitation nisi ullamco aliquip ipsum eu elit eu proident. Sit esse ullamco Lorem cupidatat est elit reprehenderit qui eu. Velit tempor esse aliquip Lorem ad adipisicing eu incididunt. Cupidatat est et sunt consectetur cupidatat.\r\nUt minim amet occaecat aute. Aliqua exercitation ea enim ullamco. Est irure ullamco quis sint. Cillum proident fugiat et reprehenderit Lorem in ad reprehenderit minim id id elit officia. Reprehenderit sint deserunt anim aliqua sit pariatur est anim quis dolor.\r\nElit voluptate et nulla ex magna commodo aute sit dolore aute minim laborum. Cillum velit sunt culpa eiusmod irure occaecat enim pariatur magna ad. Consequat eiusmod sunt veniam sunt nulla qui proident commodo id adipisicing non magna commodo eu.\r\nAmet exercitation dolor qui anim magna ullamco ipsum velit nisi occaecat consectetur labore. Id Lorem reprehenderit in aliquip sit. Dolor magna culpa cupidatat magna est aliqua nostrud aliqua. Aliqua eu ut consectetur adipisicing elit cillum. Reprehenderit consequat nostrud dolor qui dolor duis minim dolore nisi aute.\r\nEu officia laboris incididunt fugiat cillum fugiat. Ad mollit non commodo duis aliqua culpa reprehenderit ipsum. Pariatur sit cupidatat do voluptate quis labore non minim. Velit laborum ipsum id tempor consequat qui.\r\nUllamco ipsum et ipsum ut dolore consequat Lorem commodo eiusmod ad labore nisi. Do ipsum velit ad proident labore ex. Deserunt officia voluptate pariatur laborum velit proident elit labore pariatur Lorem. Velit duis dolor dolor nulla dolor mollit culpa tempor excepteur exercitation.\r\nDeserunt labore labore ex consectetur nostrud laboris voluptate excepteur in nulla consequat nostrud sint. Dolor laborum dolor laboris aute. Deserunt ullamco veniam pariatur laborum culpa fugiat dolore. Minim qui mollit ipsum enim duis officia ut voluptate dolor tempor dolor. Ea irure cupidatat enim veniam officia incididunt laborum officia pariatur. Qui esse magna officia cillum sint excepteur. Do ea quis mollit culpa officia velit.\r\nConsectetur consectetur culpa ipsum reprehenderit laboris. Duis exercitation ex sit commodo. Voluptate officia nostrud aliqua laboris reprehenderit labore commodo. Eu enim commodo proident consequat aliquip ad proident. Magna exercitation proident fugiat cupidatat laborum sunt esse reprehenderit ad ex sit non. Anim consequat duis irure pariatur ad quis.\r\nLorem sint magna in ipsum nulla tempor nostrud mollit exercitation fugiat. Consequat sint ex pariatur consequat sit incididunt voluptate do occaecat. Officia labore pariatur adipisicing minim aute mollit aliqua et ipsum cillum. Veniam nostrud ad id proident laboris aliqua incididunt labore culpa pariatur. Magna voluptate officia irure nulla eu tempor aliquip veniam irure consequat officia ipsum velit. Minim sunt cupidatat do pariatur.\r\nEu sint laborum ut voluptate mollit culpa voluptate minim incididunt exercitation. Ea incididunt cillum qui quis est duis tempor fugiat consectetur ex. Pariatur eiusmod sint dolor excepteur do nulla fugiat qui. Esse excepteur dolor adipisicing exercitation excepteur. Ut labore officia nisi occaecat ea elit nostrud id anim ullamco.\r\nEiusmod duis elit voluptate occaecat deserunt fugiat consectetur enim. Sint aliquip laborum exercitation enim quis id occaecat do duis amet amet. Id ad minim labore laboris tempor aute. Sint tempor et reprehenderit eiusmod ea ullamco minim non laboris laborum non et adipisicing. Non nisi in tempor veniam mollit ut elit enim eiusmod deserunt velit cillum officia.\r\nNostrud occaecat esse eu ea deserunt sunt sint ullamco sit mollit id exercitation incididunt. Adipisicing excepteur sint ad ullamco. Ea quis eiusmod nisi qui cupidatat quis. Velit consequat cillum tempor pariatur sit sit.\r\nLaborum et reprehenderit aliqua eiusmod amet consequat nulla duis Lorem ex sunt occaecat. Eu est mollit anim excepteur sunt incididunt eiusmod pariatur culpa dolore et. Velit non et esse reprehenderit ex mollit nostrud ut non. Nulla fugiat mollit fugiat nostrud ullamco cillum occaecat enim ipsum. Enim reprehenderit laboris velit ullamco irure commodo elit anim sunt mollit do sunt proident.\r\nVelit tempor minim reprehenderit pariatur eu. Tempor in Lorem dolor incididunt ut voluptate aute exercitation. In excepteur mollit dolor laborum culpa ullamco. Consequat commodo cillum velit commodo eiusmod eu. Nulla reprehenderit excepteur commodo sit quis tempor minim cillum minim esse ad aliquip esse minim. In ad labore magna nisi labore in. Laboris magna in sit occaecat.\r\n",
        "rating": 15,
        "language": "Rus",
        "difficulty": "Intermediate",
        "type": "Seminar",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ef930ef7865779677",
        "trainers": [
            {
                "id": "5b66c10eddc08fe5a46f33ce",
                "name": "Rosetta Freeman",
                "avatar": "https://randomuser.me/api/portraits/men/43.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=4",
        "date": "2018-10-10T01:44:36",
        "duration": 182,
        "title": "mollit occaecat est enim commodo",
        "description": "Ea mollit minim irure dolore. Do fugiat pariatur officia incididunt. In cupidatat sunt dolor aliqua dolor cillum cillum excepteur consequat.\r\nVoluptate irure occaecat incididunt Lorem quis ullamco. Non irure quis do ex adipisicing et cillum do tempor culpa nisi enim sint. Cupidatat ad labore incididunt sunt ex consectetur officia. Lorem culpa et ipsum est ullamco. Ad exercitation duis in labore voluptate veniam sint quis officia. Et amet aute deserunt laboris. Do eu duis esse commodo incididunt.\r\nProident nulla voluptate cupidatat do ipsum non. Nulla voluptate ea qui id mollit sit. Voluptate deserunt incididunt quis magna. Pariatur id cillum eu anim. Ea sint aliqua esse non voluptate culpa cillum deserunt enim esse. Deserunt irure Lorem excepteur id tempor consectetur.\r\nIrure sit ad eu nisi velit culpa. Amet commodo ad irure non labore ipsum. Incididunt Lorem culpa reprehenderit proident incididunt tempor duis do nisi irure minim occaecat duis. Laborum do magna aute deserunt incididunt proident officia sunt anim excepteur mollit duis magna. Magna magna aliqua duis anim mollit pariatur dolore ad enim nostrud.\r\nDo reprehenderit esse id ad amet. Et nostrud proident reprehenderit laborum. Cillum voluptate irure non anim mollit officia aliqua et. Labore ex laboris esse et ut ullamco laboris pariatur consequat commodo officia fugiat. Quis anim qui sit cupidatat voluptate quis sit et sit. Deserunt enim veniam sunt in ut.\r\nDolor ullamco mollit esse minim anim ipsum ex tempor ut esse dolor magna sunt. Nulla dolore aliquip dolor laborum cillum velit ullamco eiusmod cillum proident Lorem nulla Lorem. Eiusmod do do cillum consectetur excepteur sit minim minim aute pariatur tempor. Et velit anim Lorem aliqua ex enim nostrud laborum nostrud.\r\nFugiat anim minim aute ut do voluptate labore nulla. Id adipisicing ad non deserunt laborum id ea et sit consectetur aliqua. Proident pariatur elit nulla dolore consequat irure non excepteur fugiat. Voluptate deserunt ullamco aliquip id exercitation proident dolore veniam. Sint sint enim pariatur fugiat ea aliqua aliquip consectetur mollit incididunt aute ut. Velit proident exercitation excepteur qui dolor ut mollit dolore dolor esse amet.\r\nAd ad sint et velit aliqua fugiat. Laborum sunt incididunt ut enim do dolore aute exercitation enim est proident occaecat amet. Dolor pariatur tempor laborum ea fugiat ex ullamco nulla ad consequat aliqua adipisicing eu do. Aute dolor velit exercitation labore adipisicing.\r\nConsequat cillum ullamco duis tempor nisi culpa veniam pariatur magna ad. Velit ex eiusmod magna quis. Mollit cillum eiusmod laborum anim nulla consequat est proident. Consectetur aliqua consequat culpa adipisicing tempor nulla velit. Sunt voluptate Lorem non sit nisi pariatur consequat. Mollit amet incididunt do excepteur nisi in. Deserunt eiusmod pariatur Lorem labore exercitation esse reprehenderit magna.\r\nEnim ullamco laborum exercitation nulla do et. Id anim est minim occaecat fugiat ullamco. Sit consectetur et occaecat eu elit labore dolore et enim est. Amet nulla officia sit mollit occaecat sint amet nostrud reprehenderit dolor.\r\nExcepteur tempor sint exercitation officia est exercitation labore labore enim. Deserunt voluptate minim laboris officia qui. Labore quis ut amet non enim in exercitation nisi commodo et. Ut esse in adipisicing officia ex excepteur irure deserunt. Adipisicing veniam aliquip labore in ad officia cupidatat minim eiusmod. Dolor dolore ea dolor adipisicing dolor veniam excepteur esse ipsum magna. Anim do veniam ex et ullamco elit culpa.\r\n",
        "rating": 34,
        "language": "Eng",
        "difficulty": "Expert",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e573741d5db6b0d69",
        "trainers": [
            {
                "id": "5b66c10eb62ab1c1c1662352",
                "name": "Rasmussen Gregory",
                "avatar": "https://randomuser.me/api/portraits/women/6.jpg"
            },
            {
                "id": "5b66c10e8dad040c0a649e4b",
                "name": "Lee Mcdonald",
                "avatar": "https://randomuser.me/api/portraits/women/52.jpg"
            },
            {
                "id": "5b66c10e950deafdb0c54fbf",
                "name": "Chang Lewis",
                "avatar": "https://randomuser.me/api/portraits/women/26.jpg"
            },
            {
                "id": "5b66c10e77eaf51c89655f05",
                "name": "Eve Green",
                "avatar": "https://randomuser.me/api/portraits/women/11.jpg"
            },
            {
                "id": "5b66c10e23a967fd46afaa83",
                "name": "Duke Cross",
                "avatar": "https://randomuser.me/api/portraits/women/19.jpg"
            },
            {
                "id": "5b66c10eb2c70edd1304abbb",
                "name": "Rosalinda Buchanan",
                "avatar": "https://randomuser.me/api/portraits/women/19.jpg"
            },
            {
                "id": "5b66c10efab7f1e186e8830f",
                "name": "Durham David",
                "avatar": "https://randomuser.me/api/portraits/men/58.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=2",
        "date": "2018-08-24T08:19:21",
        "duration": 196,
        "title": "nisi est elit officia esse nulla pariatur tempor",
        "description": "Adipisicing fugiat nulla velit ipsum id laborum duis qui elit id. Aliquip proident magna Lorem officia irure mollit velit proident et duis commodo. In sunt labore adipisicing eu et sit mollit duis consequat labore laboris sint. Mollit minim esse Lorem do consequat id sint.\r\nQuis ut eu non proident exercitation nisi reprehenderit. Laborum consequat anim magna voluptate dolore ut adipisicing do nostrud excepteur excepteur culpa. Anim reprehenderit ad adipisicing excepteur nulla ex sunt do. Velit pariatur et exercitation deserunt aute.\r\nMinim nisi mollit deserunt laborum nisi mollit dolor aliqua excepteur laboris labore irure excepteur est. Aliquip deserunt cillum ad aliqua mollit nulla. Excepteur excepteur occaecat do duis reprehenderit dolor irure id excepteur eu. Sunt magna reprehenderit aute veniam ea Lorem pariatur. In aliquip mollit ullamco cillum elit reprehenderit nostrud ut aliqua ex fugiat ex.\r\n",
        "rating": 17,
        "language": "Esp",
        "difficulty": "Intermediate",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e68864150ddac9763",
        "trainers": [
            {
                "id": "5b66c10eb362bffa4c684e0f",
                "name": "Janette Fernandez",
                "avatar": "https://randomuser.me/api/portraits/men/19.jpg"
            },
            {
                "id": "5b66c10ee2e87fc681c776bf",
                "name": "Aimee Vang",
                "avatar": "https://randomuser.me/api/portraits/women/47.jpg"
            },
            {
                "id": "5b66c10e4ae6cc65dd41d54f",
                "name": "Kerr Hunt",
                "avatar": "https://randomuser.me/api/portraits/women/17.jpg"
            },
            {
                "id": "5b66c10e562fb9c45b82140b",
                "name": "Lowery Nixon",
                "avatar": "https://randomuser.me/api/portraits/men/33.jpg"
            },
            {
                "id": "5b66c10ea2e157b092f348f0",
                "name": "Gail Ballard",
                "avatar": "https://randomuser.me/api/portraits/men/56.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=2",
        "date": "2018-11-08T10:46:32",
        "duration": 453,
        "title": "cupidatat nisi cillum dolor mollit anim anim eiusmod nostrud minim",
        "description": "Minim duis cillum sunt irure do. Quis cupidatat pariatur adipisicing amet excepteur deserunt occaecat ut. Ex aute eu deserunt minim. Sit veniam labore elit sunt sunt officia sit.\r\nUt nisi eiusmod deserunt nisi proident incididunt velit consequat cupidatat ex officia. Labore minim anim consequat occaecat enim sunt ea ad consequat ullamco aute eiusmod. Non cillum eiusmod ea anim incididunt reprehenderit ullamco aliqua ut adipisicing eiusmod. Irure sunt anim sint laboris do fugiat amet anim. Nulla est est exercitation ad. Do sint qui dolore in incididunt ullamco anim non sit. Labore in qui ad cillum in proident enim deserunt.\r\nCommodo proident sunt velit anim officia dolore mollit duis qui anim. Sit exercitation magna nostrud ullamco amet enim nostrud nisi culpa proident labore incididunt. Aliqua exercitation Lorem ex consectetur enim qui aute anim anim minim id tempor sint. Excepteur sit minim commodo mollit laboris et sint consequat et do Lorem qui.\r\nEiusmod ea ut Lorem enim consectetur quis qui esse quis cillum quis officia. Sunt in reprehenderit adipisicing et quis dolore commodo eiusmod cillum nulla dolore eu. Velit eiusmod aliqua eiusmod nulla est in eiusmod Lorem officia. Laborum voluptate aliquip laborum amet Lorem laborum excepteur cillum incididunt labore in non cupidatat quis. Labore aliqua irure reprehenderit tempor. Id ut voluptate sint est et incididunt laboris voluptate nostrud et ea sunt pariatur ad. Mollit ullamco et commodo nulla aliqua commodo.\r\nOccaecat consequat commodo aliqua adipisicing ipsum adipisicing proident Lorem ut qui Lorem exercitation quis irure. Est sint nulla ad minim mollit ut proident laboris. Cillum dolor excepteur voluptate do est velit veniam aute anim.\r\nLabore eu ut consequat excepteur laboris aliqua eiusmod labore proident sit in. Excepteur non est nisi esse qui. Nisi amet consectetur ullamco aliqua nulla tempor tempor excepteur ipsum. Sit est eu occaecat irure excepteur occaecat sunt anim eu et non deserunt. Cupidatat aliqua incididunt do do.\r\nLorem esse duis commodo ut et elit proident nisi consequat. Quis ex cupidatat quis fugiat labore culpa magna dolor tempor cupidatat ea adipisicing. Nulla labore sit ea duis dolore labore aute in reprehenderit. Ad sit ipsum enim incididunt nostrud officia esse labore velit ex. Ex nisi consequat excepteur aliquip aliqua aute duis cupidatat et voluptate exercitation laborum qui. Pariatur officia pariatur aute pariatur deserunt ut sint ipsum excepteur non.\r\nAute proident commodo ex id qui laboris. Aute fugiat fugiat adipisicing eiusmod adipisicing eiusmod sit laborum amet esse irure. Velit nostrud sunt in id excepteur deserunt.\r\n",
        "rating": 34,
        "language": "Eng",
        "difficulty": "Intermediate",
        "type": "Video course",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ee178567f6351aa2c",
        "trainers": [
            {
                "id": "5b66c10e3a9f003577d3d28e",
                "name": "Kay Zimmerman",
                "avatar": "https://randomuser.me/api/portraits/women/35.jpg"
            },
            {
                "id": "5b66c10e116809e841b5c1a5",
                "name": "Angel Dawson",
                "avatar": "https://randomuser.me/api/portraits/men/22.jpg"
            },
            {
                "id": "5b66c10e4ed30c0f211da3fa",
                "name": "Juanita Gay",
                "avatar": "https://randomuser.me/api/portraits/women/29.jpg"
            },
            {
                "id": "5b66c10e9ed3e929b0d67cb1",
                "name": "Preston Harrell",
                "avatar": "https://randomuser.me/api/portraits/women/26.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=14",
        "date": "2018-11-20T07:45:16",
        "duration": 315,
        "title": "ea magna tempor qui ea veniam do velit consequat laborum",
        "description": "Minim commodo qui esse elit excepteur fugiat esse sit. Adipisicing elit pariatur dolore ex. Sint nulla laborum est occaecat. Voluptate sit in commodo minim ipsum ut id minim. Proident veniam commodo non labore laborum cillum fugiat veniam commodo in.\r\nAnim eiusmod qui aliqua ex id occaecat aliqua nisi exercitation deserunt. Officia incididunt nisi dolore ipsum culpa reprehenderit velit fugiat anim tempor. Incididunt pariatur exercitation enim reprehenderit nisi enim velit exercitation nisi nisi. In cupidatat excepteur nulla labore officia nostrud enim.\r\nConsectetur eiusmod dolor sint nostrud minim pariatur laborum laborum labore aliquip ullamco do. Aliqua eiusmod proident enim aute aliqua minim veniam eiusmod laboris tempor. Ut occaecat est id qui do cillum voluptate do do culpa ipsum consequat.\r\nCommodo incididunt adipisicing non voluptate proident quis aute. Dolore do ad pariatur sunt sunt non anim labore quis nulla dolore ullamco cillum duis. Lorem officia amet sunt nulla sit ipsum incididunt. Et voluptate quis ex et esse. Nulla minim esse dolore adipisicing eu dolore velit velit ut ad esse nulla Lorem.\r\nVelit eiusmod ea duis nisi adipisicing nulla qui commodo esse sunt sint ea ea dolor. Labore sit do consequat nostrud enim incididunt tempor eu cupidatat quis nostrud quis aute adipisicing. Elit esse sunt labore id velit voluptate adipisicing duis dolor laboris nisi consectetur magna nostrud. Deserunt ut eu exercitation sunt nulla voluptate excepteur do ipsum. Mollit nulla et Lorem fugiat quis aliquip ipsum officia occaecat proident cupidatat dolore et minim. Anim ad occaecat aliquip eu aute consectetur nulla sit laborum et ipsum esse. Ad minim amet consequat id ex cupidatat magna amet ex id aute voluptate anim ea.\r\nIncididunt excepteur in adipisicing amet ea. Consequat sit adipisicing eiusmod culpa ipsum mollit. Proident quis incididunt nisi proident anim voluptate et amet. Quis adipisicing ut Lorem aute laboris ullamco magna in cillum ullamco anim velit velit aliqua. Exercitation anim voluptate cupidatat cillum quis laborum cupidatat ex. Occaecat occaecat nulla do consectetur sunt nostrud.\r\nQui culpa amet laborum id. Ad ipsum elit incididunt culpa mollit anim quis id sunt velit. In velit fugiat officia exercitation proident ex eiusmod adipisicing est consectetur qui. Ullamco proident aliquip anim magna non quis tempor sit ex voluptate dolor id. Consequat exercitation dolore aliqua et est consectetur laboris.\r\nNon elit amet aute duis magna qui. Aliquip cillum id est ullamco dolore duis ex duis ullamco adipisicing voluptate nulla. Veniam irure non proident mollit proident non aute labore duis elit sit qui adipisicing. Et consectetur ipsum incididunt duis esse.\r\nDolore labore cupidatat eu minim Lorem velit consectetur excepteur sunt ad minim laborum fugiat ex. Consectetur eu fugiat deserunt est aute aute commodo aliqua sit. Incididunt ea ad est cillum labore cillum amet in et. Adipisicing occaecat labore magna ad occaecat. Incididunt exercitation in cillum ex.\r\nDolor cupidatat consectetur laboris ex occaecat do officia veniam. Proident est id laboris sint qui excepteur non voluptate ad aliquip duis et. Deserunt esse occaecat laboris quis reprehenderit laborum ut excepteur sunt proident ad ipsum. Ad ex amet irure exercitation incididunt.\r\nAd qui aliqua nostrud culpa ut reprehenderit est aliqua. Mollit esse aliquip reprehenderit voluptate laborum proident elit ipsum. Eu eu occaecat occaecat velit. Cupidatat sit in aute nostrud sunt qui et dolore adipisicing. Sint in aliquip pariatur eiusmod nostrud reprehenderit.\r\nIrure ex deserunt sit cupidatat non amet proident sit dolore laboris sunt ut cillum dolore. Culpa Lorem eiusmod et ipsum officia. Lorem dolor Lorem pariatur sunt sit ut est aliquip. Velit in eu consequat aliquip do. Dolor deserunt consequat adipisicing laboris commodo magna. Mollit minim reprehenderit minim magna commodo aliqua quis ut exercitation nisi do eiusmod mollit.\r\n",
        "rating": 44,
        "language": "Pol",
        "difficulty": "Expert",
        "type": "Training",
        "isFavorite": false
    },
    {
        "_id": "5b66c10eb90e669d03408933",
        "trainers": [
            {
                "id": "5b66c10e6b4bf8201586e74f",
                "name": "Kimberley Petersen",
                "avatar": "https://randomuser.me/api/portraits/women/55.jpg"
            },
            {
                "id": "5b66c10e7de302db380f2c22",
                "name": "Hewitt Vincent",
                "avatar": "https://randomuser.me/api/portraits/men/69.jpg"
            },
            {
                "id": "5b66c10ea485410080f82f1b",
                "name": "Angelica Klein",
                "avatar": "https://randomuser.me/api/portraits/men/34.jpg"
            },
            {
                "id": "5b66c10e20989ab2a964fb7d",
                "name": "Lavonne Reese",
                "avatar": "https://randomuser.me/api/portraits/women/51.jpg"
            },
            {
                "id": "5b66c10e4cbad9e88b6d355c",
                "name": "Briana Romero",
                "avatar": "https://randomuser.me/api/portraits/men/7.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=13",
        "date": "2018-10-08T08:36:40",
        "duration": 206,
        "title": "ex in magna",
        "description": "Tempor fugiat qui ea est ad do in excepteur eiusmod. Consequat ut veniam nisi nulla voluptate eiusmod aute exercitation ad. Pariatur anim deserunt veniam id do consequat occaecat id. Irure nisi magna pariatur ullamco fugiat excepteur excepteur proident qui ex reprehenderit velit ex consequat.\r\nCommodo ut reprehenderit ex in minim commodo incididunt fugiat nostrud. Labore nostrud ipsum velit deserunt. Dolor aute pariatur amet aliqua fugiat culpa deserunt deserunt amet aliquip veniam in pariatur enim. Minim aliquip eiusmod eu ipsum.\r\nMollit cupidatat elit consequat nulla id minim ut eu et. Ullamco mollit fugiat voluptate cupidatat sint do sunt eiusmod culpa laborum. Ex nisi labore officia irure voluptate. Lorem eiusmod esse et Lorem dolore magna quis ea pariatur nulla eu nulla. Duis officia non ea elit aliquip sunt ut eu esse tempor sint dolore pariatur.\r\n",
        "rating": 16,
        "language": "Pol",
        "difficulty": "For All",
        "type": "Seminar",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e4b8b93ecaca43123",
        "trainers": [
            {
                "id": "5b66c10e57f2d777afc203b2",
                "name": "Nixon James",
                "avatar": "https://randomuser.me/api/portraits/men/54.jpg"
            },
            {
                "id": "5b66c10e1c23fd6e0008685b",
                "name": "Paula Willis",
                "avatar": "https://randomuser.me/api/portraits/men/35.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=10",
        "date": "2018-12-01T05:38:51",
        "duration": 437,
        "title": "sunt ex adipisicing duis anim commodo ex exercitation aliquip",
        "description": "Esse consectetur eiusmod magna qui pariatur et. Commodo deserunt laboris duis quis veniam mollit dolor. Incididunt do pariatur veniam fugiat nulla fugiat.\r\nLaborum non culpa Lorem fugiat esse anim. Culpa deserunt ex reprehenderit consectetur non culpa occaecat voluptate laboris. Aute veniam pariatur dolore nulla consectetur qui velit reprehenderit cupidatat.\r\nPariatur sint est esse adipisicing reprehenderit laborum. Aliqua aliquip irure mollit commodo elit commodo magna anim commodo exercitation laboris non officia. Est dolore est magna elit ea reprehenderit quis tempor esse. Dolore qui in laboris commodo eu.\r\nIn nisi nulla id Lorem incididunt adipisicing aute excepteur consequat exercitation enim. Ad ut sit nostrud ullamco eu fugiat proident. Labore nisi consectetur in aliquip. Sint consectetur qui occaecat ea voluptate aliqua. Culpa occaecat cupidatat culpa excepteur duis officia aliquip labore aliqua. Laborum eiusmod cupidatat aliquip occaecat nulla dolore laboris magna. Ex ea irure ea est.\r\nNulla elit nostrud mollit aute nostrud dolore Lorem irure. Aliqua cillum do pariatur mollit. Eiusmod non consequat sint exercitation reprehenderit culpa anim dolor ex.\r\nEnim Lorem anim commodo mollit et occaecat elit. Sint anim esse ullamco sint. Est tempor ad officia labore ut excepteur laboris ut non magna laboris ipsum. Mollit exercitation reprehenderit eiusmod Lorem ex sunt excepteur et sunt proident nisi. Consectetur id laboris magna duis cillum. Ex voluptate sunt consectetur enim Lorem voluptate commodo eu amet irure fugiat aliquip. Ea excepteur laborum veniam ipsum irure non irure qui eu sint sit ullamco fugiat.\r\nMinim tempor amet consequat ex dolore do voluptate adipisicing proident ex ex nisi sit nostrud. Consectetur duis mollit aute labore nostrud eiusmod. Anim reprehenderit voluptate dolor non reprehenderit qui ipsum excepteur est quis exercitation. In in labore fugiat dolor officia exercitation.\r\nNostrud minim cillum velit eiusmod elit fugiat commodo. Anim velit culpa pariatur proident nostrud commodo. Esse cupidatat cupidatat minim mollit anim dolor in cillum anim est. Exercitation dolore incididunt laboris et veniam dolor est commodo.\r\nDuis dolor quis reprehenderit sunt fugiat. Exercitation et mollit ut proident ad. Veniam pariatur mollit minim Lorem esse veniam mollit ea laboris.\r\nDolore ex cupidatat ipsum nostrud cupidatat nisi eiusmod voluptate ex. Dolore ullamco in magna culpa consectetur. Eiusmod eu adipisicing velit duis ea. Aliquip incididunt proident commodo ex proident elit voluptate eiusmod. Incididunt culpa aliquip ea fugiat incididunt. Occaecat nulla eiusmod enim deserunt.\r\nEt irure nisi ad dolor incididunt labore exercitation do. Cillum sint aute qui consequat. Nostrud commodo labore esse Lorem enim duis ut consequat dolore consequat velit adipisicing sunt minim. Quis sint dolor do cillum eu. Labore consequat commodo eu ad ex ad laborum consectetur ex do reprehenderit. Sit tempor sit eu consequat Lorem quis enim.\r\nLabore elit Lorem nostrud dolor. Laboris aliquip aliquip reprehenderit elit mollit eu dolor culpa. Aliquip consequat quis dolor sint deserunt nulla aliqua aliquip deserunt labore est est mollit fugiat. Cupidatat voluptate aliqua cupidatat sunt veniam elit. Irure adipisicing amet id id pariatur qui laborum fugiat dolor occaecat. Quis amet ipsum occaecat eiusmod adipisicing aute pariatur ullamco reprehenderit ut aute proident sint. Eu ipsum velit in ullamco commodo anim dolor tempor deserunt.\r\nNostrud magna ea irure eiusmod eiusmod mollit. Adipisicing ex cupidatat tempor nostrud aliqua reprehenderit. Minim ad laboris culpa ea excepteur incididunt veniam cillum ipsum. Aliquip magna aliquip aliquip excepteur irure dolore voluptate pariatur. Nostrud nostrud aliquip incididunt velit enim elit cillum. Dolore ea deserunt culpa cupidatat. In tempor aliquip id ad sit irure ut proident sint quis mollit cupidatat.\r\nEa nisi ut minim irure. Dolore aliqua occaecat nisi nostrud cillum ipsum ad ut cupidatat incididunt esse sit enim amet. Velit Lorem tempor sunt minim eiusmod duis culpa nulla dolor eu. Velit eiusmod commodo ex aute veniam quis amet veniam quis ea laborum enim.\r\n",
        "rating": 19,
        "language": "Eng",
        "difficulty": "Intermediate",
        "type": "Seminar",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e1c9ad8ec0c6c1002",
        "trainers": [
            {
                "id": "5b66c10ee2655c044c52f446",
                "name": "Antonia Stein",
                "avatar": "https://randomuser.me/api/portraits/women/6.jpg"
            },
            {
                "id": "5b66c10ec2741aba4aa93da3",
                "name": "Walton Baldwin",
                "avatar": "https://randomuser.me/api/portraits/women/34.jpg"
            },
            {
                "id": "5b66c10eca3e848181b7336b",
                "name": "Schmidt Alford",
                "avatar": "https://randomuser.me/api/portraits/men/3.jpg"
            },
            {
                "id": "5b66c10e613d54745ec241ea",
                "name": "Rachel Reeves",
                "avatar": "https://randomuser.me/api/portraits/men/69.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=18",
        "date": "2018-08-16T02:45:05",
        "duration": 106,
        "title": "nisi consectetur eiusmod do non minim",
        "description": "Lorem mollit id sint voluptate id exercitation qui eiusmod ullamco aute deserunt deserunt laborum. Laboris ut exercitation exercitation aliquip irure amet minim exercitation sit. Do in et ullamco nisi pariatur consequat. Eiusmod ad aliqua fugiat incididunt duis laborum ullamco culpa mollit culpa officia incididunt cupidatat sit. Elit magna sit anim sit proident veniam aliqua reprehenderit voluptate do id quis.\r\nCommodo tempor velit nulla reprehenderit. Enim tempor ea consectetur anim eu fugiat enim duis non consequat ullamco. Ipsum eu proident labore magna commodo eu. Tempor quis velit veniam magna.\r\nNulla eiusmod eu ea esse. Dolor excepteur exercitation consequat officia ex duis aliquip esse commodo. Eiusmod elit velit id exercitation elit tempor elit excepteur aliquip ea enim sint anim.\r\nConsequat dolore pariatur in sit labore. Quis amet laboris laboris occaecat ex officia reprehenderit irure magna nostrud elit. Reprehenderit occaecat id ullamco laboris excepteur. Quis cupidatat magna deserunt aute proident duis magna nostrud reprehenderit in cillum voluptate non dolor. Anim consequat magna qui magna sunt sit ut sunt veniam elit sit aliqua. Sit voluptate ullamco culpa adipisicing fugiat duis pariatur dolore. Laboris irure deserunt ipsum in qui aliqua adipisicing excepteur cupidatat cupidatat ut consectetur cillum veniam.\r\nLaborum cillum laborum exercitation qui excepteur sit. Elit incididunt velit dolor consectetur irure cupidatat do. Enim duis adipisicing nostrud velit incididunt commodo laboris duis duis esse magna deserunt excepteur. Nostrud laborum ex aliqua cupidatat quis mollit est elit in in occaecat irure. Quis dolor deserunt veniam enim Lorem ea dolore eiusmod in nostrud tempor cupidatat officia et.\r\nAmet ex nostrud sint voluptate ipsum Lorem. Voluptate aliqua enim in exercitation Lorem. Aliquip pariatur Lorem commodo ullamco magna mollit consequat esse aliquip elit eiusmod Lorem est duis. Quis labore ullamco sit ex ullamco Lorem ad sint adipisicing. Aliquip in officia aute amet mollit amet. Tempor amet est non minim. Id commodo enim Lorem exercitation eiusmod commodo.\r\nEx proident proident elit tempor consectetur eiusmod elit est pariatur incididunt commodo tempor. Velit laborum incididunt irure Lorem reprehenderit dolore laboris. Excepteur aliqua officia aliqua laboris enim nulla. Do deserunt ea proident exercitation laboris deserunt consectetur elit labore consectetur duis. Ipsum ut nulla id elit.\r\nEa aliquip nulla Lorem fugiat incididunt ea mollit ad Lorem sunt. Incididunt labore occaecat consequat veniam nulla tempor voluptate esse consectetur culpa ea. Esse Lorem eu minim sit veniam.\r\nCulpa in consectetur incididunt anim officia duis cupidatat duis nulla dolore aliqua sunt deserunt. Elit eu irure pariatur enim reprehenderit ea. Occaecat do adipisicing proident laborum adipisicing ex reprehenderit minim ipsum ex. Velit irure ullamco pariatur cillum proident laboris officia irure id ullamco veniam velit sunt. Dolor eu ex sit sint.\r\nEt culpa nisi dolore voluptate laborum laborum commodo ullamco nostrud. Laboris velit voluptate ullamco duis dolore sit non officia aliqua sint deserunt. Aliqua eu deserunt fugiat qui officia consectetur tempor reprehenderit elit. Tempor voluptate est velit adipisicing occaecat mollit sunt proident et est eu cillum. Sit sint deserunt cillum incididunt velit. Labore nulla eiusmod sit amet sunt quis.\r\nExcepteur officia mollit proident deserunt eu commodo cupidatat dolor est. Ex nisi velit esse magna eiusmod irure exercitation. Voluptate duis ex dolor adipisicing ullamco incididunt aliquip laboris quis minim. Aliquip consequat labore non laboris.\r\nIpsum ipsum minim tempor pariatur et voluptate magna id proident sint pariatur exercitation duis. Mollit incididunt est dolor amet enim excepteur cillum incididunt. Lorem eiusmod culpa deserunt enim elit cupidatat minim.\r\n",
        "rating": 20,
        "language": "Pol",
        "difficulty": "Intermediate",
        "type": "Video course",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e1cc9b7cfb095d612",
        "trainers": [
            {
                "id": "5b66c10ef71370d9ca30a276",
                "name": "Davidson Guerra",
                "avatar": "https://randomuser.me/api/portraits/women/1.jpg"
            },
            {
                "id": "5b66c10e47a84796038f824f",
                "name": "Minerva Rasmussen",
                "avatar": "https://randomuser.me/api/portraits/men/54.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=2",
        "date": "2018-08-25T04:34:21",
        "duration": 372,
        "title": "ea pariatur excepteur nulla quis ipsum sint",
        "description": "Do exercitation non officia velit laborum culpa dolor voluptate labore dolor culpa duis sit commodo. Ut fugiat amet consectetur ad aliquip minim laboris ullamco fugiat. Quis consequat tempor ex laborum ullamco quis proident est laborum in voluptate amet. Tempor veniam magna quis sit veniam velit ad irure duis. Commodo magna consequat incididunt fugiat tempor aliquip sunt in enim adipisicing aute sit anim. Non aliqua cillum Lorem et consectetur. Sint exercitation ea exercitation reprehenderit nostrud.\r\nElit amet culpa amet nostrud velit mollit irure et nostrud nisi. Elit anim minim id sint dolore aliqua aliquip. Aliqua aliquip dolore exercitation ad do eiusmod ullamco magna consequat cillum.\r\nTempor adipisicing ut cupidatat amet minim sit. Ipsum non reprehenderit laborum laborum sit ut. Commodo officia id sunt duis incididunt eu eu enim Lorem labore excepteur voluptate id. Adipisicing incididunt elit fugiat et velit. Cillum deserunt elit incididunt veniam labore proident elit. Tempor eu exercitation ut ea duis culpa dolore dolore proident sint ad tempor ex.\r\nNostrud aliquip officia irure pariatur eiusmod eu exercitation laboris eu. Id anim mollit ipsum consectetur nostrud commodo nulla aute Lorem aliquip ea nisi. Non aute fugiat nisi enim do ipsum veniam ut. Nulla qui occaecat labore ex nostrud veniam nisi tempor mollit dolore aliquip ullamco. Excepteur ad velit reprehenderit exercitation excepteur adipisicing ad. Proident amet laboris do mollit ut reprehenderit eu aute amet sunt qui ex.\r\nTempor eu nisi minim aliqua. Excepteur ad ullamco eiusmod veniam Lorem esse sunt. Anim anim et Lorem sunt culpa. Labore labore consequat ullamco amet anim nisi commodo labore. Laboris enim esse laborum labore mollit sunt enim. In veniam occaecat elit eu eu et adipisicing dolore ad sunt.\r\nVoluptate ullamco adipisicing labore ea. Dolore ut cillum ut cupidatat enim excepteur minim quis ad cupidatat eu. Deserunt qui aliqua ullamco ex dolore sunt reprehenderit ipsum voluptate et anim fugiat. Eiusmod deserunt adipisicing voluptate quis aliqua occaecat dolor velit. Adipisicing do nisi sunt sunt. Eiusmod fugiat consectetur quis nulla commodo Lorem minim fugiat proident et mollit officia Lorem. Duis laboris laborum ullamco fugiat aliqua dolore laborum incididunt et.\r\nLorem consectetur sint excepteur nulla elit. Minim exercitation aliquip enim sint ea eiusmod consequat pariatur occaecat minim occaecat cillum irure fugiat. Minim eiusmod aliqua sunt veniam ex aliquip magna officia nisi incididunt officia ex excepteur nulla. Id ipsum eu in labore cillum ut.\r\nDo ipsum ex ut excepteur culpa anim laborum proident fugiat consequat amet ullamco deserunt. Enim consequat voluptate irure sit qui minim tempor aliqua laborum cupidatat commodo. Eiusmod culpa consectetur cillum exercitation aliquip culpa ullamco magna culpa minim aliqua.\r\nConsequat deserunt laboris voluptate nulla consequat dolor mollit ad enim mollit excepteur commodo. Aliqua commodo sint laborum ipsum aute amet consectetur. Reprehenderit elit elit amet eu velit elit tempor. Est nulla in ipsum exercitation cillum amet occaecat ex esse eiusmod ullamco fugiat adipisicing. Dolore ut qui culpa pariatur sit ex irure nostrud fugiat et excepteur cillum qui. Ex velit excepteur pariatur minim laborum ut exercitation culpa quis. Duis enim do ut cillum adipisicing occaecat irure ex adipisicing adipisicing.\r\n",
        "rating": 26,
        "language": "Esp",
        "difficulty": "For All",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ef5d135db43f91c2e",
        "trainers": [
            {
                "id": "5b66c10e02dc903cae24601a",
                "name": "Julia Benton",
                "avatar": "https://randomuser.me/api/portraits/women/36.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=9",
        "date": "2018-12-10T12:13:59",
        "duration": 76,
        "title": "ullamco anim duis ullamco cillum mollit",
        "description": "Eiusmod anim et qui qui ipsum consequat culpa enim ex sint sunt nulla. Adipisicing eiusmod aliqua aute nisi exercitation irure occaecat in mollit Lorem. Mollit aliquip nulla elit eu qui duis ex qui excepteur ullamco reprehenderit. Laboris do mollit sint incididunt ut mollit reprehenderit nisi aliqua veniam. Est proident sint occaecat mollit ad laborum officia commodo elit exercitation eu.\r\nQui commodo aute ipsum excepteur duis cillum voluptate Lorem dolore labore cillum aliqua dolor. Consectetur laboris est elit quis eu minim proident laboris id mollit commodo. Voluptate sint aliquip veniam aute est consequat ut aliqua. Est fugiat duis commodo cupidatat magna est nostrud labore anim in eiusmod nisi labore est. Magna sunt sint minim exercitation sunt sint consectetur culpa duis ea consectetur eiusmod et elit. Quis culpa nulla commodo cupidatat sunt nostrud. Ea excepteur labore ipsum exercitation sint labore dolore ad sit.\r\nMinim sint laboris ea et nisi elit nisi cillum excepteur. Enim non ut incididunt nostrud cillum mollit pariatur et anim cupidatat quis velit Lorem elit. Eu ex sint consequat aute. Proident in pariatur deserunt ea ea ipsum enim et eu incididunt tempor veniam.\r\nCupidatat Lorem irure aliqua ex ea consequat commodo eiusmod tempor velit ex commodo. Laborum consequat cillum qui minim nulla nisi cillum et minim nostrud nisi excepteur dolor ut. Eiusmod qui tempor cillum quis. Minim enim labore nisi incididunt velit do ad dolore velit occaecat.\r\n",
        "rating": 19,
        "language": "Pol",
        "difficulty": "For All",
        "type": "Seminar",
        "isFavorite": false
    },
    {
        "_id": "5b66c10eb02eebf127cd734f",
        "trainers": [
            {
                "id": "5b66c10e0fd4d3fbd886d8e0",
                "name": "Caldwell Lara",
                "avatar": "https://randomuser.me/api/portraits/women/30.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=19",
        "date": "2018-11-10T07:42:40",
        "duration": 344,
        "title": "dolor veniam commodo",
        "description": "Lorem minim do dolore ipsum. In et nulla ut in eiusmod exercitation dolor do. Excepteur occaecat culpa minim ex do ut dolor quis minim. Duis eu ipsum proident aliquip aliqua nisi nulla et labore magna. Irure occaecat Lorem aute nostrud ea sunt ex incididunt.\r\nVeniam cupidatat consequat laboris elit velit esse. Proident incididunt commodo deserunt velit Lorem fugiat cillum laborum. Eu nulla sunt exercitation nisi magna nostrud ea nostrud proident nulla ut. Incididunt ullamco cupidatat nisi anim enim minim. Dolor id culpa Lorem excepteur laboris et non. Non dolore culpa reprehenderit anim non excepteur do nisi labore tempor anim labore. Consequat incididunt nulla esse cupidatat ea laborum mollit pariatur ut proident.\r\nVelit elit irure dolor anim incididunt reprehenderit Lorem deserunt ipsum. Cupidatat ex quis consectetur voluptate officia laboris ad proident officia fugiat voluptate cupidatat. Est est veniam velit amet nulla laborum laborum. Ex incididunt occaecat aliquip mollit elit non occaecat. Nulla culpa reprehenderit magna exercitation est sunt Lorem veniam sit Lorem. Consequat minim non ullamco consectetur laborum mollit.\r\n",
        "rating": 11,
        "language": "Pol",
        "difficulty": "Intermediate",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10ef035af25814b08c8",
        "trainers": [
            {
                "id": "5b66c10edebb8976b2df481e",
                "name": "Guerrero Joyner",
                "avatar": "https://randomuser.me/api/portraits/women/62.jpg"
            },
            {
                "id": "5b66c10ed34ffdf635f2c69c",
                "name": "Ortega Prince",
                "avatar": "https://randomuser.me/api/portraits/men/60.jpg"
            },
            {
                "id": "5b66c10e2e8bc1759e53a057",
                "name": "Weber Horne",
                "avatar": "https://randomuser.me/api/portraits/women/57.jpg"
            },
            {
                "id": "5b66c10ed7c4b56ca15302b3",
                "name": "Thompson Murphy",
                "avatar": "https://randomuser.me/api/portraits/men/49.jpg"
            },
            {
                "id": "5b66c10eaf941da65747e049",
                "name": "Alexandria Powell",
                "avatar": "https://randomuser.me/api/portraits/men/68.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=19",
        "date": "2018-08-06T08:20:11",
        "duration": 21,
        "title": "amet nulla et commodo ex est exercitation qui aliquip enim",
        "description": "Exercitation aliquip duis consequat qui labore sunt nulla incididunt et. Voluptate laboris eu sunt in. Aute cupidatat dolore elit Lorem enim ex non sunt id. Ut laboris occaecat duis officia nostrud ea qui qui sit labore. Reprehenderit eiusmod sit non anim commodo. Excepteur anim nisi officia in occaecat non duis Lorem ea ut.\r\nAmet id aliqua duis amet amet labore Lorem sint labore pariatur duis mollit fugiat. Anim nostrud deserunt deserunt cupidatat qui consequat et qui nostrud. Quis eiusmod esse id ut.\r\nOfficia ex nulla deserunt nisi officia aliqua occaecat. Esse in nisi et laborum commodo est minim fugiat proident pariatur duis velit id mollit. Esse in cillum fugiat ex esse sunt nulla aliquip velit qui duis Lorem. Officia adipisicing et non id laboris exercitation non do fugiat nulla. Laborum nostrud cillum commodo aute laboris esse Lorem dolor aliqua.\r\nExercitation excepteur velit irure tempor excepteur nisi mollit ut aute incididunt amet. Dolore consequat tempor excepteur fugiat aute sit nulla proident ad proident magna commodo esse. Amet ad quis fugiat sunt reprehenderit culpa non veniam nisi elit proident deserunt commodo. Aliqua esse qui nulla laboris velit anim et consectetur laboris ullamco reprehenderit pariatur. Ea labore ut ad ut et anim non ullamco aute laboris in ea do anim. Nulla esse culpa ex sit. Pariatur velit officia deserunt in pariatur.\r\nAmet consectetur officia voluptate voluptate dolor excepteur in. Ut quis ad consequat ea sunt eu veniam sint consectetur. Excepteur duis exercitation labore laborum officia irure consequat qui. Esse ut nostrud do nulla in id cupidatat do amet aliqua. Fugiat eiusmod sint cupidatat adipisicing irure tempor dolor est mollit.\r\n",
        "rating": 15,
        "language": "Fra",
        "difficulty": "Expert",
        "type": "Lecture",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e42aa9cac4088d856",
        "trainers": [
            {
                "id": "5b66c10eff88f20241297e64",
                "name": "Faith Casey",
                "avatar": "https://randomuser.me/api/portraits/women/34.jpg"
            },
            {
                "id": "5b66c10ec337297a50341661",
                "name": "Bush Carlson",
                "avatar": "https://randomuser.me/api/portraits/women/56.jpg"
            },
            {
                "id": "5b66c10ef922d1e0206dbfa3",
                "name": "Forbes Warren",
                "avatar": "https://randomuser.me/api/portraits/men/64.jpg"
            },
            {
                "id": "5b66c10ee304ee866826e167",
                "name": "Chavez Case",
                "avatar": "https://randomuser.me/api/portraits/women/48.jpg"
            },
            {
                "id": "5b66c10e0662c214b85a9442",
                "name": "Davis Stewart",
                "avatar": "https://randomuser.me/api/portraits/women/31.jpg"
            },
            {
                "id": "5b66c10e97d793739fc0085f",
                "name": "Vaughan Glover",
                "avatar": "https://randomuser.me/api/portraits/men/7.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=7",
        "date": "2018-10-07T05:05:24",
        "duration": 423,
        "title": "ut mollit mollit ullamco laborum in incididunt nostrud amet id",
        "description": "Culpa velit excepteur deserunt aliqua veniam aliqua dolore. Anim sint deserunt nisi id velit. Nulla ex aliqua in minim culpa cillum voluptate irure cupidatat ad nisi irure eu aliquip.\r\nMollit officia voluptate deserunt adipisicing nisi nostrud pariatur. Aliquip eu dolore in voluptate id. Et culpa ea amet amet ipsum magna pariatur consectetur occaecat velit eiusmod nisi magna. Deserunt ut do ullamco nulla enim.\r\nDolore in eu proident ullamco cillum est sit dolore dolor cillum ad velit minim. Pariatur ut do eiusmod ea velit quis deserunt fugiat quis aliqua id tempor velit aute. Anim nisi nostrud ipsum qui. Veniam ea culpa amet non mollit enim veniam. Nostrud non consequat culpa sint mollit excepteur tempor magna esse exercitation incididunt ullamco eiusmod. Id laboris ea est aute esse exercitation qui. Cupidatat aute labore elit ex non consectetur reprehenderit est exercitation.\r\nCillum commodo consequat laboris ea et velit ad anim dolor ullamco laborum exercitation commodo veniam. Eiusmod laborum do laboris ea amet consequat minim proident sunt sit laboris. Esse laboris Lorem est officia commodo qui sint deserunt nulla minim.\r\nSint anim amet dolor dolor esse ex sunt minim Lorem qui cupidatat occaecat minim esse. Nulla cupidatat reprehenderit ut est fugiat. Sunt quis duis anim anim. Amet minim id ipsum tempor pariatur deserunt. Laboris id culpa irure veniam. Dolor ut anim amet tempor enim cupidatat sint dolore dolore cillum consectetur exercitation voluptate eiusmod. Reprehenderit ullamco Lorem nostrud do.\r\nEnim commodo magna anim eu ex veniam eu duis reprehenderit eu ullamco. Eu ullamco laborum elit laboris dolore non dolore incididunt ea ex. Minim culpa in excepteur nulla officia. Ipsum mollit veniam aliquip laborum id in nulla pariatur exercitation. Aute quis occaecat sunt nostrud eiusmod amet aute duis deserunt mollit mollit.\r\nExercitation id irure labore dolore laborum et ea mollit culpa velit ullamco culpa. Ad consequat excepteur culpa exercitation occaecat voluptate magna excepteur. Exercitation in sunt anim aliquip amet nisi in mollit mollit mollit incididunt.\r\nMollit esse Lorem mollit dolor non. Excepteur eiusmod aliqua ex veniam reprehenderit pariatur. Fugiat mollit do sint nostrud excepteur reprehenderit aliquip minim laborum esse exercitation.\r\n",
        "rating": 40,
        "language": "Pol",
        "difficulty": "Intermediate",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e303b1c26b1e973bd",
        "trainers": [
            {
                "id": "5b66c10e8f98811a06c39f48",
                "name": "Benita Pennington",
                "avatar": "https://randomuser.me/api/portraits/men/21.jpg"
            },
            {
                "id": "5b66c10edb1f8ac6af20fdd2",
                "name": "Avery Stevens",
                "avatar": "https://randomuser.me/api/portraits/men/7.jpg"
            },
            {
                "id": "5b66c10e74018ca3c92e2211",
                "name": "Fuller Lyons",
                "avatar": "https://randomuser.me/api/portraits/men/30.jpg"
            },
            {
                "id": "5b66c10e731a85869195ac92",
                "name": "Tonya Levy",
                "avatar": "https://randomuser.me/api/portraits/women/4.jpg"
            },
            {
                "id": "5b66c10e20c4f61424adca1a",
                "name": "Bauer Ramirez",
                "avatar": "https://randomuser.me/api/portraits/men/62.jpg"
            },
            {
                "id": "5b66c10e4873cc20b1c7abf7",
                "name": "Schroeder Richardson",
                "avatar": "https://randomuser.me/api/portraits/men/28.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=15",
        "date": "2018-12-24T09:47:26",
        "duration": 489,
        "title": "quis in sunt",
        "description": "Amet cupidatat nisi nisi ex ex sit qui esse ea pariatur. Eiusmod dolore nisi id laboris id ut eiusmod tempor adipisicing reprehenderit. Elit ad veniam excepteur cillum laborum sit ullamco eiusmod non voluptate occaecat mollit qui aliquip. Aliquip fugiat deserunt aliquip id et. Occaecat minim consectetur commodo dolor pariatur mollit sint. Officia voluptate incididunt sit amet irure Lorem duis sit tempor ut commodo non incididunt.\r\nId officia adipisicing proident pariatur reprehenderit dolore aute est incididunt esse sint mollit exercitation. Aute officia in nisi irure reprehenderit laborum veniam duis laboris officia id exercitation consectetur. Veniam minim ut eu adipisicing ullamco. Laboris ad fugiat deserunt dolor nulla mollit amet. Duis elit nostrud anim anim quis esse dolore. Proident fugiat aute ut magna adipisicing.\r\nVeniam eiusmod enim exercitation sint est do ut Lorem magna duis consectetur aute consectetur. Minim in enim ut deserunt eu labore ullamco. Ullamco eu consectetur nostrud deserunt exercitation officia excepteur magna nisi consequat ut. Ullamco in ipsum duis enim culpa pariatur aliquip. Nisi ea sint incididunt exercitation laborum in. Ut do eiusmod do do aliquip.\r\nAmet ea ex proident in duis pariatur irure cupidatat nisi irure incididunt aute. Eu duis commodo cillum elit laboris dolore mollit amet occaecat magna. Reprehenderit reprehenderit dolore sint dolor do nostrud pariatur. Officia eu ut est laboris ipsum. Officia veniam ad sunt sit ad reprehenderit dolor ipsum.\r\nEiusmod sunt dolor duis culpa sint do ad nulla. Labore elit quis aliqua et mollit. Fugiat cupidatat est cupidatat incididunt. Dolor pariatur amet dolore in dolor Lorem sit reprehenderit nisi nulla veniam id. Irure dolore adipisicing incididunt eu est nostrud reprehenderit consectetur pariatur Lorem cupidatat officia fugiat. Ullamco ex ad deserunt nulla.\r\n",
        "rating": 44,
        "language": "Esp",
        "difficulty": "Intermediate",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e95aa2a3fdb1d2ad0",
        "trainers": [
            {
                "id": "5b66c10e87e665f5cc9a7ff8",
                "name": "Rodgers Buck",
                "avatar": "https://randomuser.me/api/portraits/women/1.jpg"
            },
            {
                "id": "5b66c10eb8e5f34af477a91b",
                "name": "Clements Mejia",
                "avatar": "https://randomuser.me/api/portraits/men/59.jpg"
            },
            {
                "id": "5b66c10e5517cbe5e54c892c",
                "name": "Acosta Sloan",
                "avatar": "https://randomuser.me/api/portraits/men/50.jpg"
            },
            {
                "id": "5b66c10e70ff7d2000c32417",
                "name": "Powell Moss",
                "avatar": "https://randomuser.me/api/portraits/women/1.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=5",
        "date": "2018-11-23T06:58:28",
        "duration": 243,
        "title": "occaecat velit mollit elit irure non eu culpa labore",
        "description": "Pariatur excepteur deserunt eiusmod esse laboris excepteur irure nulla duis Lorem amet laborum. Aute mollit eu eu ut in consectetur commodo reprehenderit. Aliqua aute aute consectetur ex nulla enim do laboris labore aliquip eu exercitation aute labore. Duis labore ipsum ea ad. Proident ex nostrud cillum quis mollit eu proident minim exercitation minim esse sit enim. Est Lorem occaecat cillum nulla ex ut ex pariatur officia eiusmod consequat anim dolor mollit. Incididunt nostrud est officia qui.\r\nAdipisicing irure est anim dolor. Velit dolor exercitation quis cupidatat qui consectetur id enim laborum. Pariatur veniam et dolor proident magna ipsum anim consectetur fugiat cupidatat fugiat nostrud nisi. Velit magna laboris eiusmod minim esse sit duis quis do reprehenderit.\r\nAnim aute qui nulla in anim. Labore laboris nulla deserunt sint ut culpa reprehenderit et fugiat. Ea labore sint deserunt eiusmod consectetur sunt officia eu eiusmod reprehenderit cillum. Laborum eu consectetur amet esse reprehenderit reprehenderit veniam sunt labore elit adipisicing enim.\r\nDo incididunt incididunt ipsum commodo consequat. Cillum Lorem do voluptate sit nisi laborum ea ipsum laboris mollit adipisicing tempor nostrud. Exercitation in elit esse nostrud pariatur nulla proident qui.\r\nAd incididunt reprehenderit qui cillum irure eu cupidatat duis eu sit. Laboris nulla commodo ad in. Duis ipsum deserunt cupidatat ad.\r\nAnim sit qui in reprehenderit Lorem quis occaecat ullamco est non adipisicing. Est dolor velit ipsum do et enim irure nisi ex velit pariatur commodo irure. Irure magna minim sunt adipisicing sit veniam deserunt magna proident proident proident exercitation pariatur ipsum. Veniam ad ullamco incididunt velit ut laboris elit eiusmod voluptate nisi.\r\nConsectetur duis commodo ex do sunt aute sit officia dolor minim ad eu veniam. Dolor voluptate fugiat incididunt commodo in laboris duis. Officia culpa ut deserunt id veniam enim officia ad id commodo nostrud laboris. Eu cillum fugiat enim occaecat cupidatat velit ullamco elit magna nisi proident. Incididunt reprehenderit qui eiusmod in cupidatat. Dolor nisi mollit laborum tempor et ullamco voluptate reprehenderit elit enim commodo amet proident do.\r\nIpsum laboris incididunt occaecat ad est aliquip duis enim non veniam eu culpa incididunt. Esse mollit excepteur qui pariatur laborum reprehenderit incididunt sint adipisicing et in consequat incididunt minim. Culpa aliqua pariatur est qui qui labore aliqua velit ex ad. Cupidatat veniam adipisicing ipsum aute non nisi nulla est pariatur voluptate enim proident excepteur officia. Id duis dolor irure dolore qui occaecat.\r\nAdipisicing deserunt aliquip et nostrud anim quis. Sint nulla eiusmod in laborum in in deserunt ad ea proident amet. Qui ex culpa occaecat nulla ea labore pariatur velit in nostrud eiusmod. Laboris veniam laborum ea excepteur elit occaecat. Sint cillum qui excepteur minim deserunt cillum voluptate cillum consequat sit ut cupidatat.\r\n",
        "rating": 18,
        "language": "Pol",
        "difficulty": "Novice",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e963e333752eb72bb",
        "trainers": [
            {
                "id": "5b66c10eb42f36655253357e",
                "name": "Knox Lindsey",
                "avatar": "https://randomuser.me/api/portraits/men/14.jpg"
            },
            {
                "id": "5b66c10e59782b219c40359f",
                "name": "Paige Lindsay",
                "avatar": "https://randomuser.me/api/portraits/women/1.jpg"
            },
            {
                "id": "5b66c10e2b432926d45b1129",
                "name": "Haley Mcconnell",
                "avatar": "https://randomuser.me/api/portraits/men/28.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=4",
        "date": "2018-12-04T03:40:08",
        "duration": 48,
        "title": "mollit quis culpa elit deserunt et",
        "description": "Et ad exercitation incididunt nulla aliqua aute laboris ad minim aliquip nisi nisi elit consectetur. Ullamco labore minim irure laborum magna velit. Eiusmod aliqua exercitation amet cillum officia fugiat quis nostrud consectetur irure duis amet ipsum. In ut tempor ex minim in minim amet fugiat magna elit aute eu magna.\r\nAliqua proident est consequat exercitation ipsum esse commodo ipsum incididunt est nostrud. Sit irure ea laborum aliquip aute esse elit eiusmod labore aliqua enim deserunt. Sint ullamco adipisicing quis commodo ipsum voluptate enim occaecat excepteur laboris. Adipisicing magna minim mollit est duis labore quis et excepteur.\r\nQuis proident ut excepteur ex voluptate elit do qui. Ipsum enim anim minim esse esse voluptate laborum culpa ullamco aliqua minim consectetur. Cupidatat esse est excepteur cupidatat consectetur anim ad consequat. Do consequat deserunt sint sunt voluptate aute minim adipisicing nostrud qui ipsum adipisicing.\r\nOccaecat dolor nisi id minim. Non laborum fugiat amet pariatur aute Lorem ex veniam. Elit adipisicing proident ipsum amet ullamco incididunt excepteur Lorem exercitation velit commodo cupidatat.\r\nEa excepteur aute cupidatat velit laborum ut dolore laboris deserunt. Culpa labore dolore ea laboris consequat culpa do commodo cillum eu qui cupidatat. Sunt cillum adipisicing ut in nulla voluptate deserunt minim sunt enim ipsum. Laborum enim Lorem ea nulla sit minim voluptate esse.\r\nDolor velit nisi cupidatat amet ad laborum qui cillum nostrud. Commodo consectetur anim ipsum Lorem incididunt. Sint anim et amet qui duis laboris. Quis dolore laborum culpa ipsum voluptate veniam ea exercitation exercitation eu tempor quis. Proident in ea quis deserunt sint aliquip. Tempor cillum qui occaecat id dolore incididunt occaecat anim nulla aliquip tempor veniam proident.\r\nProident labore sunt sint duis consequat Lorem ea ullamco incididunt ea. Amet incididunt occaecat quis adipisicing nostrud et commodo et exercitation. Adipisicing ea velit nisi commodo nostrud qui incididunt consectetur aute ex. Sint reprehenderit magna labore dolore deserunt do excepteur nostrud nostrud. Enim eiusmod enim nisi et cillum. Occaecat aliqua laborum officia dolore excepteur.\r\n",
        "rating": 15,
        "language": "Fra",
        "difficulty": "Intermediate",
        "type": "Seminar",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e3752c0a504dd36ad",
        "trainers": [
            {
                "id": "5b66c10ef9ff4eeaab5629e8",
                "name": "Doyle Gray",
                "avatar": "https://randomuser.me/api/portraits/women/21.jpg"
            },
            {
                "id": "5b66c10ea798bf0538f292db",
                "name": "Marcella Wilcox",
                "avatar": "https://randomuser.me/api/portraits/women/32.jpg"
            },
            {
                "id": "5b66c10e99cc107c77aae74d",
                "name": "Soto Mcfarland",
                "avatar": "https://randomuser.me/api/portraits/women/58.jpg"
            },
            {
                "id": "5b66c10e61c60581d8789509",
                "name": "Phyllis Cherry",
                "avatar": "https://randomuser.me/api/portraits/women/8.jpg"
            },
            {
                "id": "5b66c10ed847fd4ce7289bce",
                "name": "Reba Mcknight",
                "avatar": "https://randomuser.me/api/portraits/women/29.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=20",
        "date": "2018-11-12T09:58:10",
        "duration": 131,
        "title": "nisi officia ex",
        "description": "Nostrud anim dolor minim velit nostrud duis eu sint ullamco est adipisicing non ea. Ipsum incididunt deserunt qui minim dolor in ullamco sit exercitation in. Aliqua in voluptate deserunt magna commodo sit consectetur magna dolore cillum enim minim sunt magna. Deserunt ad sint elit sint tempor officia dolore veniam fugiat et excepteur duis ex.\r\nProident do dolor cillum proident fugiat incididunt culpa ullamco est deserunt mollit adipisicing occaecat. Ut deserunt qui ad elit sint eu voluptate tempor consequat sit dolor eu qui quis. Adipisicing nostrud esse laboris consequat nostrud laborum ut anim.\r\nIncididunt aute amet nisi commodo fugiat. Ullamco est culpa officia proident excepteur est amet cillum. Minim nulla sit officia officia magna laboris aliquip do ea et enim est voluptate eiusmod. Occaecat nulla aliqua pariatur tempor Lorem Lorem excepteur Lorem dolore aliqua proident. Commodo eiusmod enim culpa qui duis sunt nostrud ex ut laboris tempor esse sit culpa.\r\nCillum ea fugiat irure proident. Minim sint officia quis quis id cillum. Mollit aute adipisicing ad esse reprehenderit adipisicing et ullamco et laboris elit magna culpa id. Aute tempor occaecat aliquip aliquip Lorem consequat et reprehenderit in tempor ex pariatur. Cupidatat consequat commodo amet culpa Lorem excepteur eiusmod Lorem. Dolor ea in excepteur veniam ex. Ea excepteur deserunt sunt deserunt et.\r\nVelit ipsum amet cupidatat nisi. Enim exercitation do sunt dolor tempor officia occaecat irure amet laboris. Ut ut est veniam cupidatat sit aute. Duis ad dolor sit excepteur do reprehenderit esse quis sunt velit qui commodo ea quis. Exercitation non reprehenderit adipisicing dolore aliquip dolore. Esse sunt tempor tempor labore consequat cupidatat ullamco mollit velit mollit do laborum do. Do quis ullamco Lorem irure elit dolore laborum ad irure pariatur.\r\n",
        "rating": 12,
        "language": "Fra",
        "difficulty": "Novice",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10ef529e07fdae828d9",
        "trainers": [
            {
                "id": "5b66c10ef4b22efeed0d47cc",
                "name": "Haley Conner",
                "avatar": "https://randomuser.me/api/portraits/women/36.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=11",
        "date": "2018-11-17T08:58:51",
        "duration": 47,
        "title": "laborum veniam ut officia",
        "description": "Eu aliquip consequat aute proident elit mollit. Esse eiusmod minim reprehenderit aute fugiat dolor officia duis aliquip proident. Id qui sint exercitation nulla duis non adipisicing proident est mollit. Nulla deserunt et proident laboris aliquip sint ut laboris fugiat irure eu. Nisi aute excepteur non est laboris est culpa minim id dolore. Nostrud officia veniam laborum minim nulla tempor. Mollit aliqua ullamco qui minim minim dolor nulla.\r\nLaboris cupidatat eiusmod proident elit nisi dolor dolor sit deserunt aliquip. Consequat aliqua ea tempor non eiusmod commodo non. Commodo sint proident reprehenderit qui do sit Lorem adipisicing minim laboris enim sint in.\r\nOccaecat pariatur veniam do dolore deserunt labore ex enim minim est nostrud non. Cupidatat cillum aliqua cupidatat velit deserunt in mollit. Irure cillum aliqua laborum voluptate anim ipsum do aute in aute est exercitation tempor. Labore enim voluptate ut deserunt non laborum ex aliquip anim velit aute duis est proident.\r\nEst aliquip nostrud excepteur culpa. Ipsum consequat pariatur et magna pariatur. Nisi minim quis id id. Anim ipsum ex laborum nisi occaecat commodo aliqua cillum reprehenderit ut. Nulla magna nostrud id exercitation Lorem qui reprehenderit proident id fugiat.\r\nSunt deserunt nostrud ipsum ullamco consectetur incididunt proident ea culpa duis ex laborum sit nostrud. Velit non consequat est do do nulla nostrud do qui culpa velit ex amet aliquip. Mollit quis magna nostrud ea ad exercitation dolore voluptate.\r\nIn cillum dolore mollit quis enim excepteur eu officia labore esse aute ullamco id magna. Minim culpa aute exercitation adipisicing. Consequat non esse deserunt amet incididunt proident culpa voluptate veniam mollit do sunt. Duis eiusmod consectetur culpa culpa aliquip dolor sit laboris aliquip voluptate labore deserunt in irure. Amet ipsum tempor do pariatur Lorem tempor.\r\nAd aliqua aliqua exercitation nostrud nostrud duis do ipsum pariatur in commodo. Velit nostrud cupidatat ipsum labore enim cillum adipisicing minim duis ullamco duis. Ipsum in consequat incididunt ut et tempor occaecat quis ut dolor magna.\r\nDo ullamco nulla deserunt cillum id culpa quis officia laborum esse est occaecat esse Lorem. Non cillum fugiat sint cupidatat sunt ea cillum. Incididunt adipisicing culpa adipisicing laboris sunt incididunt eu amet aliqua et irure qui commodo do. Minim qui cupidatat nisi esse cupidatat laborum aute veniam aliquip nostrud amet non enim officia.\r\n",
        "rating": 12,
        "language": "Esp",
        "difficulty": "For All",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e393d98ca98b13ea5",
        "trainers": [
            {
                "id": "5b66c10e86e3a9210c8ed6e5",
                "name": "Anna Palmer",
                "avatar": "https://randomuser.me/api/portraits/men/40.jpg"
            },
            {
                "id": "5b66c10e0ca3f716c366f66d",
                "name": "Curtis Townsend",
                "avatar": "https://randomuser.me/api/portraits/men/67.jpg"
            },
            {
                "id": "5b66c10e3302cebb6f3a19a6",
                "name": "Lucille Benson",
                "avatar": "https://randomuser.me/api/portraits/women/37.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=4",
        "date": "2018-11-28T11:22:40",
        "duration": 362,
        "title": "elit cillum labore ad laboris",
        "description": "Fugiat aute velit ut nisi ad officia excepteur duis aliquip. Do proident culpa excepteur aute elit id veniam veniam mollit eiusmod excepteur excepteur nulla. Velit sunt enim eu laboris nulla pariatur velit nisi Lorem ex anim laboris labore.\r\nIn et sunt incididunt nostrud veniam pariatur nulla esse elit. Ex non ipsum id culpa tempor id proident cillum velit eu exercitation. Mollit laboris id excepteur magna enim voluptate. Tempor aute sint id consequat do eu anim laboris Lorem ex nulla. Sunt aute cupidatat exercitation nisi officia in aute commodo aliquip in.\r\nQuis sunt in incididunt id. Aute fugiat adipisicing duis eu officia enim. Tempor tempor magna quis duis aliquip sint excepteur sint commodo irure qui est velit minim. Nulla labore ad nulla veniam dolore.\r\nDolor est do quis id et enim voluptate commodo esse fugiat. Proident laborum est in commodo culpa anim. Mollit cupidatat consequat nisi eu nostrud minim adipisicing labore enim. Irure deserunt consequat esse eiusmod ullamco eiusmod minim velit consectetur labore dolore incididunt esse cillum. Veniam labore in magna consectetur Lorem consequat sunt non aliqua velit esse elit. Ut ipsum aute deserunt aliquip. Enim sit tempor proident quis nisi excepteur et voluptate.\r\nElit aliqua id sit ullamco. Dolore proident Lorem Lorem amet. Voluptate labore reprehenderit cupidatat deserunt elit excepteur in eu excepteur culpa. Magna adipisicing ex ut culpa irure. Dolor anim sunt consectetur Lorem sit tempor quis eiusmod.\r\nLorem eiusmod proident irure ea et irure amet irure commodo sint. Exercitation proident enim in mollit enim quis voluptate minim est. Ullamco magna laboris cupidatat officia. In voluptate officia commodo culpa enim elit in ipsum duis amet commodo eu. Ut adipisicing do aliquip aliquip.\r\nIn ad ex eiusmod laborum magna ipsum in commodo. Mollit do ipsum ex ullamco proident. Est commodo consectetur labore exercitation excepteur minim nisi sint tempor. Labore duis anim anim nostrud qui amet ex. Excepteur sint reprehenderit amet ipsum non cupidatat. Non fugiat sunt proident excepteur ullamco ullamco proident adipisicing. Lorem adipisicing sunt quis officia aute qui qui est eu ut sit non incididunt.\r\nUt velit ipsum ipsum fugiat qui eu excepteur aliquip deserunt aute voluptate et minim. Pariatur sunt voluptate ad enim ipsum. Aute et velit ea in. Commodo cupidatat sit magna sint cillum sunt proident minim dolore commodo non sunt. Reprehenderit mollit sit exercitation sint culpa veniam id veniam commodo qui veniam est.\r\nFugiat cupidatat esse ad exercitation voluptate ea laborum fugiat id. Ea nulla in in officia enim deserunt fugiat id. Ipsum eiusmod ut non nisi consequat aliquip mollit enim pariatur commodo culpa in consequat. Voluptate tempor ea reprehenderit incididunt.\r\nLaborum reprehenderit sint culpa do consectetur sit anim excepteur ex labore eu. Sit exercitation occaecat voluptate dolor est consectetur esse dolore cillum occaecat duis cillum nostrud. Officia quis voluptate sit excepteur dolore cillum ex minim.\r\nEiusmod ut irure do id. Lorem dolor laborum adipisicing consectetur consequat pariatur. Magna tempor minim nostrud nostrud occaecat. Elit dolore deserunt laborum elit eu dolor reprehenderit exercitation voluptate consectetur amet laborum laborum. Anim veniam consectetur quis labore veniam velit mollit. Laborum irure in in adipisicing aliqua amet sit officia labore dolor dolore.\r\nLaboris sit exercitation ullamco pariatur do. Tempor labore ullamco minim irure mollit dolor et reprehenderit dolore labore qui. Proident aliqua ipsum cupidatat in est ullamco do occaecat do officia laboris ex. Mollit nostrud nulla enim labore culpa pariatur ullamco elit magna est. Consectetur cupidatat et reprehenderit eu dolore laboris velit nulla voluptate occaecat aliqua irure dolor ullamco.\r\n",
        "rating": 27,
        "language": "Pol",
        "difficulty": "Intermediate",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e20756d3c58d689b1",
        "trainers": [
            {
                "id": "5b66c10ee8b922a11d909f0c",
                "name": "Bernadine Dyer",
                "avatar": "https://randomuser.me/api/portraits/men/1.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=7",
        "date": "2018-10-17T11:39:32",
        "duration": 299,
        "title": "nostrud incididunt velit non aute",
        "description": "Fugiat labore quis sit labore proident voluptate mollit occaecat culpa ad sunt laborum ullamco. Sit laborum consectetur et Lorem tempor cillum aute voluptate consectetur eu officia dolore do. Excepteur occaecat ad aliqua fugiat aliqua proident. Elit excepteur laborum magna dolore ipsum velit adipisicing consequat ut. Cupidatat ut sint tempor ad nisi culpa.\r\nCulpa magna consequat adipisicing cillum sint cupidatat et. Occaecat esse commodo fugiat do cillum. Voluptate et officia enim occaecat veniam sit velit velit Lorem. Fugiat consectetur ea aliquip non velit Lorem do deserunt incididunt dolore veniam esse.\r\nConsectetur officia sint consequat aute in tempor ea velit occaecat ut. Elit occaecat voluptate minim consequat irure proident duis id veniam. Cupidatat dolore exercitation nisi aute commodo laboris. Pariatur laboris ut elit proident laboris. Consectetur laboris culpa est eiusmod ad do aute aliqua quis. Sit cupidatat ipsum incididunt tempor do esse consectetur quis velit do.\r\nUllamco enim excepteur eiusmod adipisicing voluptate amet pariatur id qui consequat sit ad. Laboris sunt anim officia ex tempor nostrud laborum eu et id. Laborum laborum nostrud culpa qui ipsum. Qui ea excepteur ut reprehenderit elit qui amet ullamco enim in aute duis consectetur qui. Occaecat sint ullamco labore sit consequat officia consectetur ad consequat dolor. Pariatur sit laborum esse enim consequat labore exercitation.\r\nDo exercitation exercitation velit sint magna dolor. Ex amet officia dolore quis id deserunt velit aliqua do. Incididunt laboris incididunt cupidatat labore ullamco dolor ipsum. Non est consequat enim nisi laboris.\r\n",
        "rating": 44,
        "language": "Rus",
        "difficulty": "Novice",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ebdb5499150f42b2a",
        "trainers": [
            {
                "id": "5b66c10ecd17b771cadd6d18",
                "name": "Rena Mcdaniel",
                "avatar": "https://randomuser.me/api/portraits/women/2.jpg"
            },
            {
                "id": "5b66c10ecadbd05e6105ead8",
                "name": "Knapp Garrison",
                "avatar": "https://randomuser.me/api/portraits/men/8.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=16",
        "date": "2018-10-24T07:12:33",
        "duration": 282,
        "title": "dolor Lorem commodo",
        "description": "Aliquip incididunt sint et irure culpa eiusmod cupidatat pariatur anim officia nostrud. Elit non mollit ex veniam ad et do labore amet. Consequat aliquip eu fugiat sunt amet occaecat laborum adipisicing ut occaecat dolore fugiat. Est amet adipisicing sunt cillum.\r\nSint enim qui excepteur enim ipsum tempor. Elit proident ut sint reprehenderit et esse nulla velit Lorem nisi elit proident et. Ullamco quis duis consequat dolore sunt reprehenderit sit reprehenderit quis.\r\nDolore ut elit non aliquip. Reprehenderit nulla ullamco irure enim reprehenderit sint amet mollit officia consequat. Deserunt Lorem id ipsum ipsum laborum consequat laboris. Ullamco sunt ut ut adipisicing sit ut.\r\nLorem sint tempor ea pariatur voluptate velit proident non officia eu ad irure nulla. Occaecat anim aliqua id ad ex est nostrud esse. Eu consectetur voluptate labore deserunt voluptate voluptate occaecat non amet incididunt tempor eu qui incididunt.\r\nProident fugiat ad ad commodo eu ut ut ut minim qui. Ullamco consequat ex quis labore deserunt do dolor commodo irure eiusmod et consequat. Veniam deserunt tempor reprehenderit velit nostrud officia irure.\r\nConsectetur excepteur culpa minim proident officia sunt reprehenderit. Laboris incididunt excepteur aliqua reprehenderit. Sit Lorem labore tempor ut laboris aliqua aliqua laboris cupidatat consequat. Enim exercitation tempor Lorem adipisicing tempor labore incididunt incididunt culpa incididunt.\r\nMollit irure mollit fugiat non minim proident occaecat velit est. Labore veniam labore velit aute consequat deserunt. Deserunt ea nisi amet culpa cillum sit. Aliquip quis veniam non proident velit id excepteur voluptate ad in enim ea.\r\nEa quis pariatur cillum nostrud. Aliqua incididunt cupidatat exercitation eu duis velit tempor dolore nisi culpa in dolor in nisi. Aliquip non Lorem culpa do excepteur cupidatat. Id veniam est sunt fugiat pariatur enim cupidatat ipsum adipisicing. Incididunt ut non commodo qui. Dolore occaecat nisi aute id Lorem mollit.\r\n",
        "rating": 36,
        "language": "Rus",
        "difficulty": "Advanced",
        "type": "Lecture",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e35a7bbd0b59eeb74",
        "trainers": [
            {
                "id": "5b66c10ef5844f1adba01fec",
                "name": "Dunlap Hanson",
                "avatar": "https://randomuser.me/api/portraits/women/30.jpg"
            },
            {
                "id": "5b66c10ed69ae02898e6d7c8",
                "name": "Silvia Spencer",
                "avatar": "https://randomuser.me/api/portraits/men/13.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=16",
        "date": "2018-11-12T04:03:06",
        "duration": 351,
        "title": "sit laborum deserunt aliqua ad sint",
        "description": "Labore anim pariatur labore culpa adipisicing laboris excepteur elit. Ad mollit cupidatat fugiat mollit ipsum reprehenderit magna culpa est occaecat sit sit aliqua laboris. In ad commodo labore minim dolor excepteur laborum eu fugiat fugiat fugiat. Eiusmod incididunt cupidatat ipsum deserunt qui irure velit occaecat laboris ullamco eiusmod ut cillum in. Lorem sit est incididunt velit anim labore Lorem veniam voluptate minim in esse laboris. Aute proident ex occaecat laborum cupidatat enim do officia consequat labore eu.\r\nIn ipsum do occaecat proident labore dolore et consequat tempor. Enim dolore pariatur laboris sint cillum proident nisi nisi. Sint laboris culpa voluptate fugiat do adipisicing amet voluptate ad laboris sit non do esse. Lorem quis laborum et laboris esse consectetur labore enim proident esse enim esse tempor ad. Amet sunt officia sunt non minim cupidatat sint sint quis officia ea veniam.\r\nQuis laboris cupidatat et cupidatat. Duis eu veniam magna aliqua sunt. Labore ad occaecat veniam nulla. Reprehenderit labore eu dolor nulla. Minim laborum velit ex occaecat voluptate nisi aliquip Lorem pariatur. Laboris reprehenderit deserunt tempor dolor veniam dolor adipisicing ea cupidatat Lorem consequat.\r\nId Lorem sint elit occaecat Lorem cupidatat sint est quis. Velit sit excepteur irure voluptate exercitation sint dolore enim laboris nostrud non. Ea laborum officia nisi proident amet. Consequat est commodo in in ut reprehenderit sit deserunt aute. Eu velit nostrud eu deserunt ullamco labore nisi ad officia ipsum exercitation et tempor.\r\nMagna velit magna veniam proident sit consequat esse irure adipisicing nostrud aliqua do. Ex voluptate cupidatat in reprehenderit velit laborum minim laboris veniam aute laborum pariatur enim. Esse ipsum ad ipsum commodo sit non adipisicing ut tempor.\r\nNulla reprehenderit qui sint magna exercitation qui. Aliqua aute Lorem ea consectetur tempor eu proident dolor ex. Nulla laborum in sit velit adipisicing nulla tempor reprehenderit sint irure esse. Laboris amet quis est commodo irure consectetur consequat voluptate. Aliqua ipsum consectetur enim pariatur in culpa duis et occaecat cillum laborum ad est tempor. Deserunt consequat do aliqua quis laboris ipsum quis et sunt culpa. Nostrud tempor esse reprehenderit nostrud culpa exercitation.\r\nDo id reprehenderit exercitation exercitation elit id deserunt. Exercitation id incididunt voluptate Lorem enim pariatur fugiat. Et excepteur excepteur ut velit sit excepteur ea magna nulla. Ad do nisi aliqua sit pariatur laboris ex. Exercitation cupidatat amet enim ipsum velit tempor eiusmod non. Cillum minim sunt dolor elit consequat velit non enim quis aliquip consectetur est. Incididunt do ea duis id.\r\nEt in commodo consequat sit occaecat fugiat non nulla ad. Laborum occaecat irure dolore exercitation tempor laboris sunt. Non nisi commodo proident ad ut non aute est et eiusmod incididunt sunt sit. Ullamco reprehenderit ut magna incididunt nisi id incididunt aliquip nostrud sint mollit ullamco excepteur. Officia eiusmod enim proident mollit esse et et id cillum consequat excepteur minim ipsum. Consectetur sint ea ea amet amet ex minim duis voluptate et amet deserunt. Ad reprehenderit non anim proident deserunt nulla non cupidatat fugiat.\r\nVeniam magna consectetur est irure ut qui adipisicing commodo veniam amet nostrud velit. Culpa Lorem adipisicing enim labore ut incididunt et magna consequat. Proident ut qui aliquip adipisicing. Pariatur id ut et velit sunt proident cillum ut. Excepteur fugiat excepteur ullamco voluptate aute enim. Ad consectetur Lorem ad tempor ea ex ad culpa est laboris. Eu laborum irure ad nulla ut dolore culpa qui tempor.\r\nAute quis enim consequat magna minim sunt ea reprehenderit cillum ipsum nulla. Ea reprehenderit adipisicing consequat dolore officia adipisicing qui do. Tempor sunt non non sunt enim tempor adipisicing occaecat commodo aute ipsum in. Adipisicing fugiat sit ex elit esse duis et ipsum consectetur aliquip eu excepteur veniam aliqua.\r\nAute qui do ea incididunt ex nisi anim ad quis. Fugiat commodo nostrud laboris nisi. Do id cupidatat sit aliqua officia tempor aliqua est ipsum ullamco. In do sunt commodo fugiat ut. Adipisicing amet qui eiusmod laborum incididunt irure aliquip.\r\nVoluptate anim velit velit sit sint eiusmod. Elit dolore ullamco aliquip ut sit laboris veniam. Dolore ad ullamco cillum enim enim. Sit elit sint nulla sit adipisicing tempor cupidatat reprehenderit sunt ut.\r\nCillum est ullamco nulla cupidatat aute. Quis ipsum eiusmod ex et enim exercitation velit adipisicing. Incididunt ipsum ea deserunt ex esse eiusmod mollit cillum culpa enim sit mollit. Ad minim commodo aliqua sint duis ipsum amet non cillum ad quis enim.\r\nAdipisicing et est adipisicing enim magna anim eiusmod incididunt tempor aute. Quis nisi exercitation nostrud sunt fugiat anim adipisicing consequat. Minim adipisicing id ullamco commodo non ullamco amet velit qui culpa in aliqua ad cupidatat. Aute voluptate consectetur velit esse occaecat quis eu eiusmod ipsum consequat sint aliqua enim. Mollit qui laborum consequat dolore cillum amet non velit commodo esse fugiat consequat aute veniam.\r\nCulpa magna exercitation laborum excepteur ex est exercitation occaecat irure occaecat. Irure reprehenderit consequat nostrud fugiat sint exercitation do aliquip id. Excepteur laborum est laboris laborum ea ea voluptate commodo dolor eu. Eu tempor nulla amet est eiusmod reprehenderit sint. Dolore mollit pariatur aute ad laboris mollit cillum. Ipsum veniam magna labore quis aliquip elit voluptate anim laborum esse excepteur esse minim.\r\n",
        "rating": 27,
        "language": "Eng",
        "difficulty": "Novice",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e7f1e285dfda22b85",
        "trainers": [
            {
                "id": "5b66c10e2ebfd67ecaf9202b",
                "name": "Rae Warner",
                "avatar": "https://randomuser.me/api/portraits/men/10.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=5",
        "date": "2018-08-07T06:06:19",
        "duration": 139,
        "title": "occaecat dolor tempor quis irure",
        "description": "Nostrud velit reprehenderit sunt sint aute do aliquip mollit occaecat est nostrud. Aute sunt adipisicing est consequat dolor reprehenderit. Commodo sunt sit ut voluptate commodo qui ea excepteur voluptate veniam. Excepteur Lorem velit ut proident elit do qui consectetur.\r\nQui id occaecat enim cupidatat Lorem nostrud ullamco ipsum. Veniam fugiat elit laboris eiusmod veniam duis incididunt in ut culpa. Sint cillum sit consectetur sit. Duis nisi cupidatat sit ut ipsum. Do non proident ut deserunt nulla. Voluptate officia sint minim ut nisi nulla. Aute labore duis quis amet irure occaecat proident.\r\nAdipisicing fugiat minim qui pariatur incididunt do exercitation Lorem ea. Dolore cillum velit quis dolore tempor irure minim ullamco minim proident. Magna ad aliquip consequat Lorem et officia. Dolor dolor esse nisi labore id eiusmod.\r\nVeniam reprehenderit in culpa nulla sit eu consectetur nisi laboris et ipsum sit. Adipisicing enim esse commodo do non consectetur nisi do pariatur tempor magna quis aliqua. Cillum in elit excepteur adipisicing. Sunt aute est commodo nostrud proident ex ullamco commodo ea mollit sit nostrud ea id. Cupidatat consectetur ipsum aliquip nulla ea. Occaecat culpa sint eiusmod do sunt culpa ad dolor proident cillum sunt quis eu.\r\nOfficia deserunt commodo proident elit eu laborum qui do occaecat fugiat. Laborum anim proident mollit reprehenderit excepteur consectetur nulla laborum. Exercitation voluptate duis nulla fugiat sunt. Ullamco eu officia ex aliquip velit mollit aliqua. Excepteur ullamco consectetur eiusmod officia amet nostrud Lorem ex sunt minim nulla ut laboris ipsum. Veniam laborum ex non non.\r\n",
        "rating": 43,
        "language": "Rus",
        "difficulty": "Intermediate",
        "type": "Lecture",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e8a667c712484ed85",
        "trainers": [
            {
                "id": "5b66c10e435d783ffcdd0b38",
                "name": "Velasquez Yang",
                "avatar": "https://randomuser.me/api/portraits/women/43.jpg"
            },
            {
                "id": "5b66c10e98972135a913ea59",
                "name": "Cote Crosby",
                "avatar": "https://randomuser.me/api/portraits/women/11.jpg"
            },
            {
                "id": "5b66c10e217790db748e8232",
                "name": "Marianne Blackburn",
                "avatar": "https://randomuser.me/api/portraits/women/62.jpg"
            },
            {
                "id": "5b66c10eb2fb86fff3026c35",
                "name": "Good Santiago",
                "avatar": "https://randomuser.me/api/portraits/men/35.jpg"
            },
            {
                "id": "5b66c10ececf26ea762c3011",
                "name": "Ruthie Fowler",
                "avatar": "https://randomuser.me/api/portraits/women/62.jpg"
            },
            {
                "id": "5b66c10e43b563d6b477bfb4",
                "name": "Wilda Gilliam",
                "avatar": "https://randomuser.me/api/portraits/women/11.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=9",
        "date": "2018-08-22T04:53:42",
        "duration": 333,
        "title": "fugiat veniam eiusmod Lorem",
        "description": "Exercitation minim quis ipsum occaecat. Aliquip nisi adipisicing ut eu et quis excepteur. Nisi excepteur in adipisicing officia quis labore nostrud aute commodo mollit voluptate ut.\r\nExercitation est reprehenderit ad exercitation culpa nisi magna non officia sint veniam. Esse officia esse fugiat ex culpa elit. Excepteur elit qui id deserunt amet ex. Enim non Lorem esse proident eiusmod voluptate veniam culpa duis velit ex amet. Elit incididunt et enim aliquip eiusmod ullamco dolore magna in do laboris. Esse minim laborum laboris nostrud minim.\r\nFugiat ad minim tempor laboris dolore nulla ad id eiusmod elit exercitation dolor. Laboris voluptate officia sunt ut qui excepteur pariatur pariatur non esse. Eu pariatur ex nostrud velit Lorem nostrud eiusmod labore qui ex. Mollit cupidatat aliqua laborum sunt sunt consectetur velit duis aliqua nisi velit elit. Culpa veniam ullamco dolor enim velit. Consequat adipisicing occaecat aute cillum. Labore minim do velit dolore cillum labore elit do eiusmod dolor nulla.\r\nLaborum laboris non pariatur excepteur adipisicing esse esse irure nulla qui commodo. Pariatur Lorem ea excepteur est irure eiusmod reprehenderit do duis. Consequat nisi et enim nulla eu enim excepteur est esse labore id. Ea elit pariatur aliquip laborum. Labore in duis est reprehenderit occaecat eiusmod id ut. Magna et id occaecat deserunt sit duis. Ad laborum veniam esse exercitation sit adipisicing laboris anim officia ullamco culpa deserunt.\r\nEsse do sint pariatur sunt qui adipisicing veniam. Excepteur aliquip adipisicing laboris laborum ad culpa amet sunt proident ad adipisicing incididunt eu et. Aliquip et proident officia ullamco fugiat magna dolor ex amet ex. Duis aute dolor sit occaecat sit.\r\nConsequat elit sit laboris nisi officia nisi. Consequat sint minim incididunt irure nostrud laboris enim ea sit. Nisi minim pariatur esse esse esse sint voluptate.\r\nIncididunt elit tempor id velit qui incididunt ex eiusmod. Exercitation ut aliquip duis ipsum. Veniam anim nisi dolore eiusmod ipsum nisi eu adipisicing officia. Eu voluptate reprehenderit cillum cillum commodo. Officia ut ea eu occaecat minim nostrud id excepteur deserunt dolore. Id sint enim eiusmod reprehenderit et qui proident in commodo nostrud laborum ad quis reprehenderit. Quis commodo nulla officia est nostrud deserunt.\r\nMinim culpa nisi non elit ex amet sunt in fugiat velit ipsum. Reprehenderit consectetur sunt qui do aute aliqua. Excepteur non proident pariatur consequat id mollit reprehenderit ea nisi Lorem do. Esse duis aliqua proident elit laborum laboris et. Proident ex nulla elit ullamco irure anim duis. Aute sit nulla in ullamco et do Lorem laborum. Et dolore non deserunt commodo nisi laborum id ut esse duis eu.\r\nVoluptate et eiusmod et deserunt ea cupidatat eu mollit sunt anim fugiat anim eu eu. Ullamco sunt officia velit ipsum sint incididunt aute velit dolor laboris et do cillum excepteur. Aliquip adipisicing labore sit mollit tempor labore nisi culpa esse non labore proident.\r\nPariatur quis nostrud laboris quis aute ex cillum magna laboris excepteur consectetur irure quis duis. Commodo occaecat minim reprehenderit elit eiusmod est non cillum in nulla est velit. Amet consequat incididunt enim sit do ex ex labore eiusmod. Amet aliqua cupidatat ad do tempor dolor nulla laborum amet voluptate. Et duis velit aliquip duis magna eiusmod amet non occaecat aute enim velit irure. Fugiat reprehenderit reprehenderit aute est labore officia quis fugiat ipsum exercitation ea. Irure quis ut sit aute magna nulla eiusmod nisi laboris ullamco.\r\nVeniam sint pariatur duis non. Aute commodo minim aliquip pariatur officia Lorem veniam est aliquip adipisicing. Eu deserunt adipisicing ad nulla ullamco enim aliquip excepteur. Est qui labore ea veniam tempor consectetur aliqua qui anim laborum in elit fugiat. Ipsum voluptate enim est ex eiusmod proident. Magna officia qui labore aliquip incididunt pariatur enim ipsum enim et anim eiusmod. Fugiat laboris ipsum labore nisi minim nisi et Lorem anim cillum.\r\nNostrud deserunt anim est dolore. Ad nostrud consequat fugiat aute et exercitation aliquip do. Id veniam aliquip quis reprehenderit nostrud tempor velit enim nostrud voluptate ullamco Lorem. Sit nisi proident aliquip cillum est. Dolore sunt id ex deserunt.\r\n",
        "rating": 35,
        "language": "Fra",
        "difficulty": "Expert",
        "type": "Lecture",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ec2c7dfbcb25301c9",
        "trainers": [
            {
                "id": "5b66c10e3199dce4980e6f84",
                "name": "Martin Dennis",
                "avatar": "https://randomuser.me/api/portraits/women/63.jpg"
            },
            {
                "id": "5b66c10e777cfc5284dbc955",
                "name": "Medina Ferrell",
                "avatar": "https://randomuser.me/api/portraits/men/33.jpg"
            },
            {
                "id": "5b66c10ed84b93ff8f4d8877",
                "name": "Tamika Hunter",
                "avatar": "https://randomuser.me/api/portraits/men/34.jpg"
            },
            {
                "id": "5b66c10e90ed68a6235cc70d",
                "name": "York Mcpherson",
                "avatar": "https://randomuser.me/api/portraits/women/39.jpg"
            },
            {
                "id": "5b66c10ec25cc7be3b672faa",
                "name": "Cherry Collier",
                "avatar": "https://randomuser.me/api/portraits/men/8.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=4",
        "date": "2018-08-04T12:29:37",
        "duration": 44,
        "title": "aute veniam eiusmod Lorem eiusmod quis eiusmod adipisicing",
        "description": "Cupidatat occaecat non aliquip anim et deserunt consectetur. Lorem reprehenderit incididunt nisi anim id fugiat minim laborum velit. Irure ex minim labore non eu minim.\r\nProident duis deserunt nostrud sint aute in adipisicing in nostrud elit ipsum adipisicing ea elit. Commodo do qui ea quis. Labore eiusmod qui adipisicing qui Lorem.\r\nVoluptate aliquip occaecat exercitation dolore dolore consequat voluptate irure labore excepteur reprehenderit dolor ad consectetur. Velit consectetur consequat amet incididunt. Incididunt quis esse mollit irure culpa elit ea. Dolore eiusmod nisi tempor adipisicing adipisicing ut et mollit nostrud sunt excepteur. Dolor in exercitation nulla amet consectetur.\r\nEt nostrud aute dolor incididunt labore nisi veniam consectetur excepteur consectetur enim. Tempor Lorem minim minim ex commodo do consectetur duis magna excepteur sit qui. Labore velit commodo deserunt non nostrud nisi sunt enim duis adipisicing Lorem laboris in. Irure ipsum ipsum laboris culpa. Cillum adipisicing aliqua sint non elit irure esse. Pariatur exercitation ut consectetur reprehenderit eu sint consequat do non. Adipisicing anim velit ad magna elit.\r\nFugiat cillum minim adipisicing dolore incididunt commodo reprehenderit. Amet sit amet ea sint dolore officia minim. Cillum reprehenderit est reprehenderit non ad proident laborum.\r\nIrure enim occaecat minim veniam sunt nostrud cillum dolore. Mollit adipisicing ad ullamco pariatur anim officia nostrud mollit laborum esse ut fugiat consequat. Ad laborum sunt Lorem ad nulla do anim et quis.\r\nDolor pariatur aliquip commodo culpa ut velit adipisicing irure aute velit occaecat. Do ea exercitation velit sit nisi dolore cupidatat et dolore quis fugiat minim est. In elit qui velit qui eiusmod voluptate do aliqua fugiat pariatur consectetur sunt. Ex exercitation sint deserunt ipsum aliqua ex consequat eu. Consequat dolor mollit deserunt eiusmod proident nisi cupidatat officia tempor fugiat. Ut irure et sit quis culpa cillum officia anim. Consequat incididunt fugiat deserunt ad sit anim veniam aliqua non officia excepteur enim Lorem.\r\nId enim irure et et irure est nostrud ut ex eu proident. Excepteur ullamco dolore occaecat ut nostrud irure deserunt laborum. Non velit adipisicing nulla et. Culpa sunt reprehenderit duis do pariatur ipsum qui non.\r\nReprehenderit cillum duis duis velit tempor voluptate consectetur excepteur eu qui ex. Reprehenderit cillum deserunt anim consectetur pariatur nulla. Esse nisi pariatur sint fugiat culpa anim eiusmod exercitation sint ipsum.\r\nExercitation elit eiusmod consequat occaecat qui sit. Dolor ullamco adipisicing sint aliquip enim. Sunt sint et ullamco laboris aliqua amet esse dolor voluptate esse Lorem. Quis reprehenderit aute qui cupidatat commodo est adipisicing.\r\nEt esse proident velit magna minim ullamco voluptate. Irure aliquip cupidatat nostrud occaecat irure anim mollit ut irure anim incididunt veniam eu ullamco. Exercitation eu excepteur sunt non qui labore elit. Irure minim qui id occaecat. Excepteur enim quis enim commodo enim deserunt enim sint ad ipsum reprehenderit ut mollit aliqua. Consequat sunt anim veniam nostrud nisi adipisicing qui dolore non elit occaecat. Commodo sit incididunt eu pariatur consectetur excepteur.\r\nCupidatat eiusmod commodo excepteur tempor consectetur consequat aliqua officia irure dolore reprehenderit occaecat do cillum. Dolor ipsum velit ex et nisi eu officia et commodo ipsum. Nisi incididunt laborum eiusmod et cillum. Voluptate ullamco eiusmod do veniam pariatur sunt fugiat. Est sit commodo nulla est aute ullamco adipisicing non excepteur ullamco incididunt anim. Velit labore sint excepteur deserunt commodo eiusmod laborum.\r\n",
        "rating": 21,
        "language": "Eng",
        "difficulty": "Novice",
        "type": "Lecture",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e7e5b1fb0e379bac2",
        "trainers": [
            {
                "id": "5b66c10e36e92f08b2699a00",
                "name": "Lesley Duffy",
                "avatar": "https://randomuser.me/api/portraits/men/54.jpg"
            },
            {
                "id": "5b66c10e42f84700dc1611ef",
                "name": "Whitney Winters",
                "avatar": "https://randomuser.me/api/portraits/women/31.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=8",
        "date": "2018-11-15T08:40:09",
        "duration": 69,
        "title": "consequat culpa Lorem anim elit minim enim est deserunt",
        "description": "Eu nisi occaecat ut qui culpa minim ipsum consectetur do ad Lorem. Sit mollit amet laborum irure fugiat velit incididunt. Eu consequat et non nostrud exercitation magna occaecat eu in consequat aliquip labore et. Aute minim id veniam eiusmod consectetur voluptate non tempor voluptate adipisicing sint minim. Dolore velit ad nisi laborum ullamco veniam exercitation ullamco consectetur laboris voluptate officia irure anim.\r\nLorem aliquip elit culpa Lorem eiusmod voluptate in ipsum commodo ullamco occaecat anim consequat. Deserunt excepteur incididunt culpa amet in voluptate incididunt nisi nulla officia excepteur. Pariatur duis aliquip adipisicing amet adipisicing proident esse excepteur.\r\nDeserunt amet id in sint cillum eiusmod cillum amet officia ipsum. Officia qui eu est nostrud aliquip ea elit excepteur in. Non aliqua ad cillum quis reprehenderit duis. Non sit aute in exercitation dolor non eu aute aliqua reprehenderit.\r\nFugiat ullamco amet sunt ullamco quis non nisi aliqua aliqua culpa aute minim et. Enim duis amet incididunt quis dolor laboris commodo fugiat velit mollit tempor ea. Labore aliquip esse tempor voluptate do. Duis velit dolore aliqua proident.\r\nLorem anim incididunt commodo deserunt labore culpa fugiat cillum sunt laborum ipsum. Ut labore ut occaecat eu fugiat tempor consequat laborum. Mollit consequat dolor aliqua amet qui sint sint esse. Adipisicing proident mollit aute do reprehenderit ad laboris dolore magna minim ut voluptate reprehenderit.\r\nEt id labore nisi ex excepteur et Lorem dolore adipisicing sunt ullamco officia ipsum. Sint voluptate minim cillum anim reprehenderit Lorem ullamco cillum est cillum culpa occaecat. Consequat incididunt aliqua nostrud ut voluptate.\r\nNostrud esse minim sit duis commodo exercitation duis adipisicing aliqua non esse eu aliqua. Qui elit amet adipisicing dolore ad. Aliquip nulla cillum quis ea cillum dolor ad veniam. Velit quis Lorem consequat exercitation commodo. Enim aliqua laborum veniam fugiat mollit sint do minim sunt.\r\nExercitation tempor occaecat irure labore laboris reprehenderit duis. Veniam minim dolor laborum quis ea consequat nulla. Laborum tempor et est reprehenderit ullamco. Elit in minim voluptate ad excepteur quis irure sint anim ipsum.\r\nCillum excepteur nisi culpa commodo adipisicing minim reprehenderit minim sit. Occaecat exercitation quis et ex est consectetur in Lorem mollit laboris voluptate nulla exercitation. Deserunt enim in sint dolor elit voluptate. Eu reprehenderit deserunt quis duis. Occaecat minim culpa dolor aute magna eu ut laboris ex cillum.\r\nCulpa tempor est amet dolor cupidatat ex ea velit do in ut esse et. Sunt eiusmod nostrud nostrud occaecat qui amet. Id nostrud ex aliqua dolore est ex. Dolore aute eiusmod officia duis anim et dolor labore occaecat deserunt sit eiusmod. Duis proident esse proident consectetur enim.\r\n",
        "rating": 43,
        "language": "Pol",
        "difficulty": "Expert",
        "type": "Seminar",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e45365e969d732f73",
        "trainers": [
            {
                "id": "5b66c10e759b1321ca7a991e",
                "name": "Vang Whitehead",
                "avatar": "https://randomuser.me/api/portraits/women/32.jpg"
            },
            {
                "id": "5b66c10e9de79846807cfa89",
                "name": "Nicole Schmidt",
                "avatar": "https://randomuser.me/api/portraits/men/60.jpg"
            },
            {
                "id": "5b66c10e54b521fe86ffe0c0",
                "name": "Tabitha Emerson",
                "avatar": "https://randomuser.me/api/portraits/women/62.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=8",
        "date": "2018-12-06T02:37:38",
        "duration": 26,
        "title": "mollit dolor tempor excepteur voluptate irure ad do",
        "description": "Nisi ullamco in nostrud sit anim eu minim. Dolore dolor magna culpa qui adipisicing dolor. Consectetur eiusmod non consequat cupidatat elit ea eiusmod cupidatat ipsum. Aute commodo qui aliquip ea ullamco irure qui incididunt id voluptate cupidatat quis laboris.\r\nConsequat quis est tempor quis est quis ea ea anim. Adipisicing velit esse esse sint consectetur ut cillum aute non amet laboris sunt fugiat. Magna veniam consequat adipisicing magna enim ipsum elit consectetur pariatur ea minim sint sit qui. Voluptate laborum ex eiusmod velit magna aliquip fugiat eu. Irure Lorem dolore nulla consectetur mollit cillum. Amet minim aliqua nisi mollit. Consectetur anim deserunt anim commodo consequat voluptate adipisicing in.\r\nDolor enim commodo velit magna elit sint excepteur ea ex elit culpa incididunt officia. Ea pariatur cillum anim duis ut irure dolor. Anim anim elit amet elit amet aliqua velit est occaecat. Voluptate amet do nisi pariatur cillum id. Lorem magna irure minim eiusmod ut consequat. Do laborum cillum sunt culpa aliqua qui do do irure dolore occaecat aute ut.\r\nEx eu laborum veniam esse laborum. Dolor do quis sit ea pariatur officia minim esse Lorem labore qui. Commodo laboris in amet amet veniam fugiat Lorem est sunt ea minim ullamco. Magna incididunt veniam mollit deserunt duis eu adipisicing.\r\nProident ullamco occaecat in dolore. Incididunt minim sit culpa sit consequat in laborum ea proident veniam minim qui tempor. Exercitation esse nostrud enim officia ea commodo occaecat. Dolor pariatur aute aliqua sunt tempor consequat est nisi. Duis tempor aliquip aliqua labore quis nostrud labore qui magna id est duis in.\r\nLaboris irure enim labore enim sunt aliqua. Irure officia mollit reprehenderit Lorem consectetur fugiat ipsum magna Lorem incididunt. Mollit non aliqua sit laboris dolor exercitation eiusmod irure ipsum adipisicing qui commodo.\r\nAliqua enim laboris labore deserunt enim enim consectetur elit et adipisicing ex anim ad veniam. Amet irure quis fugiat voluptate exercitation labore aliquip. Non aute do elit excepteur eu aliqua amet et exercitation. Dolore cupidatat Lorem ad occaecat laboris adipisicing tempor anim laboris elit. Ea consequat voluptate Lorem pariatur sit sit incididunt et ipsum ut dolore nostrud.\r\nLaborum consequat incididunt cupidatat reprehenderit. Culpa proident occaecat irure quis irure nulla do. Aliqua ad mollit reprehenderit ex. Sunt laboris ea sit anim ipsum mollit laboris laboris irure exercitation. Ea consectetur eu est culpa mollit elit incididunt aliquip. Ea ipsum deserunt nulla dolore consectetur dolor laborum proident. Do cupidatat do cupidatat eu do et exercitation.\r\n",
        "rating": 38,
        "language": "Fra",
        "difficulty": "Expert",
        "type": "Training",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e5d4d28a7c62879ba",
        "trainers": [
            {
                "id": "5b66c10e70d2bf4772efa16d",
                "name": "Lora French",
                "avatar": "https://randomuser.me/api/portraits/women/25.jpg"
            },
            {
                "id": "5b66c10e47a2fcffd43fc19a",
                "name": "Jocelyn Holland",
                "avatar": "https://randomuser.me/api/portraits/women/6.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=2",
        "date": "2018-09-16T01:12:03",
        "duration": 484,
        "title": "pariatur laborum aliqua duis commodo dolor",
        "description": "Tempor enim ipsum sint laboris aliqua laborum Lorem voluptate consequat amet nulla anim cillum sit. Velit reprehenderit fugiat laboris ipsum Lorem mollit tempor deserunt occaecat irure cupidatat. Minim officia do cupidatat velit officia.\r\nAnim reprehenderit proident id qui voluptate excepteur enim. Commodo dolor qui ullamco adipisicing eiusmod qui irure aliquip fugiat nostrud quis duis sunt. Amet id adipisicing aute et aliquip commodo sint velit laboris esse. Ut excepteur do officia quis occaecat occaecat aute ipsum exercitation enim amet. Nostrud reprehenderit ut nulla excepteur.\r\nCupidatat pariatur enim mollit sint aliquip et dolor amet officia do officia nulla enim. Sit deserunt minim enim nisi eu exercitation ex nostrud. Sint ea magna quis et. Sit culpa aliqua non ipsum nisi ad dolore occaecat excepteur velit laboris.\r\nSunt do ad sit cupidatat ad laboris proident cupidatat reprehenderit amet aute nisi incididunt do. Dolore deserunt amet elit culpa sint reprehenderit in nulla consectetur voluptate. Culpa consequat ut adipisicing esse. Aliqua sunt nisi duis fugiat duis incididunt ex labore ipsum ullamco anim.\r\nLorem mollit ex deserunt laborum ipsum culpa voluptate ipsum laborum nulla amet quis. Anim consequat in sit esse exercitation veniam aute. Elit dolor ea id deserunt occaecat deserunt est. Fugiat mollit enim amet ex pariatur esse consectetur culpa.\r\nTempor commodo minim aliqua excepteur magna sit dolore dolore commodo qui ut ea exercitation commodo. Aute pariatur occaecat non commodo est quis aliquip ea ea. Lorem id deserunt adipisicing minim voluptate.\r\n",
        "rating": 21,
        "language": "Eng",
        "difficulty": "For All",
        "type": "Training",
        "isFavorite": false
    },
    {
        "_id": "5b66c10ee47e44e25f2a3b5f",
        "trainers": [
            {
                "id": "5b66c10e206f85258480cdb1",
                "name": "Julianne Norton",
                "avatar": "https://randomuser.me/api/portraits/men/20.jpg"
            },
            {
                "id": "5b66c10e38c9d774dbd5b52e",
                "name": "Carmella Hansen",
                "avatar": "https://randomuser.me/api/portraits/men/37.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=13",
        "date": "2018-10-18T10:27:18",
        "duration": 452,
        "title": "fugiat fugiat consectetur cupidatat adipisicing deserunt ea exercitation sint",
        "description": "Nisi labore nulla eiusmod officia voluptate nostrud culpa incididunt ad et nostrud voluptate consequat esse. Do deserunt aute eu veniam dolor pariatur reprehenderit reprehenderit in nostrud magna excepteur. Velit cupidatat ullamco velit fugiat. Do voluptate ut exercitation proident enim ut aliquip minim ad eiusmod irure eiusmod elit. Consequat velit amet fugiat officia mollit irure culpa labore Lorem laborum nostrud culpa sunt. Irure est anim voluptate laboris. Proident aliquip enim veniam nulla incididunt nulla aliquip est proident.\r\nNon aliqua culpa sint elit commodo Lorem anim nostrud dolor consequat sunt quis cillum anim. Aliquip sunt officia do ex sit est amet dolore. Officia dolor ad pariatur consectetur aliqua ea labore ipsum sint aute. Occaecat deserunt non incididunt sunt excepteur eu occaecat cupidatat nisi ullamco labore aute proident.\r\nNon non ut incididunt ut ad. Est sint consequat veniam enim elit eiusmod. Enim velit sint ipsum in duis labore excepteur magna duis cupidatat minim deserunt.\r\n",
        "rating": 41,
        "language": "Esp",
        "difficulty": "Expert",
        "type": "Training",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e847eefab2335bd79",
        "trainers": [
            {
                "id": "5b66c10e9addfb88f213c350",
                "name": "Leona Mcmahon",
                "avatar": "https://randomuser.me/api/portraits/women/33.jpg"
            },
            {
                "id": "5b66c10ed679a21abe2e3cc1",
                "name": "Chaney Jacobs",
                "avatar": "https://randomuser.me/api/portraits/women/14.jpg"
            },
            {
                "id": "5b66c10efdb28c4e3000d996",
                "name": "Karen Rutledge",
                "avatar": "https://randomuser.me/api/portraits/men/20.jpg"
            },
            {
                "id": "5b66c10ec4abc0a34bc92b05",
                "name": "Warren Oneill",
                "avatar": "https://randomuser.me/api/portraits/women/63.jpg"
            },
            {
                "id": "5b66c10ea1f570a0064ff992",
                "name": "Irwin Robinson",
                "avatar": "https://randomuser.me/api/portraits/men/12.jpg"
            },
            {
                "id": "5b66c10ebdc7e2f8e6b601a3",
                "name": "Gonzales Martin",
                "avatar": "https://randomuser.me/api/portraits/women/8.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=8",
        "date": "2018-08-31T12:41:03",
        "duration": 315,
        "title": "reprehenderit ipsum ipsum veniam proident excepteur",
        "description": "Lorem consectetur ea sunt in reprehenderit commodo anim ad elit esse laborum proident dolor. Non tempor velit laboris ipsum. Duis elit dolore est ipsum. Id anim nostrud ex ut enim Lorem laboris consectetur. Amet sint eu amet culpa ut et laboris enim incididunt.\r\nEx anim labore duis minim eu consectetur laboris nisi elit culpa incididunt ipsum sit. Esse consequat labore dolore amet tempor qui exercitation occaecat tempor nostrud. Labore veniam consectetur exercitation consequat culpa exercitation ut Lorem culpa do voluptate. Adipisicing nostrud dolor in qui elit laboris deserunt adipisicing incididunt esse et magna dolor.\r\nElit sint in consectetur nisi elit occaecat deserunt veniam tempor non consequat ex ullamco ex. Commodo sit eu eiusmod sit consequat sint voluptate. Deserunt cupidatat do irure ullamco ut magna proident amet cupidatat enim aliqua amet nostrud nostrud.\r\nNon dolor pariatur mollit dolor laborum est officia nisi dolore. Eu nisi enim sit tempor. Lorem occaecat esse minim eu voluptate labore incididunt magna. Dolor officia qui duis sunt labore labore exercitation occaecat ut aliquip sunt deserunt. Pariatur eiusmod ut laborum nulla est tempor nisi amet occaecat nulla adipisicing pariatur. Sunt enim elit consequat dolor dolor quis cillum veniam voluptate ex.\r\nCupidatat eu proident duis eiusmod ex do ad cupidatat pariatur laboris mollit. Occaecat officia laborum dolore incididunt minim irure proident. Officia do eiusmod laboris culpa quis eu eiusmod fugiat esse officia amet duis. Sint eiusmod ipsum esse commodo aliqua adipisicing nulla eiusmod tempor eiusmod nostrud duis aliquip. Est excepteur reprehenderit est in excepteur consectetur quis duis sunt cillum anim. In consectetur excepteur cupidatat reprehenderit aliquip id excepteur in anim. Velit do aliquip elit exercitation dolore occaecat aliquip consequat consequat anim esse.\r\n",
        "rating": 31,
        "language": "Rus",
        "difficulty": "Intermediate",
        "type": "Seminar",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e3496b3b738416ac7",
        "trainers": [
            {
                "id": "5b66c10ef2a7971ef3b70de1",
                "name": "Morton Wyatt",
                "avatar": "https://randomuser.me/api/portraits/women/9.jpg"
            },
            {
                "id": "5b66c10ee17f29ffebc94b7d",
                "name": "Rivas Roth",
                "avatar": "https://randomuser.me/api/portraits/men/23.jpg"
            },
            {
                "id": "5b66c10ef2e758a35acb2ef2",
                "name": "Marlene Jennings",
                "avatar": "https://randomuser.me/api/portraits/women/6.jpg"
            },
            {
                "id": "5b66c10e6cd1414991482841",
                "name": "Talley Calhoun",
                "avatar": "https://randomuser.me/api/portraits/men/6.jpg"
            },
            {
                "id": "5b66c10ef54001fed427b11c",
                "name": "Cornelia Mccarthy",
                "avatar": "https://randomuser.me/api/portraits/women/62.jpg"
            },
            {
                "id": "5b66c10e29ebf350ce248b84",
                "name": "Hatfield Tucker",
                "avatar": "https://randomuser.me/api/portraits/women/30.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=15",
        "date": "2018-08-11T08:13:42",
        "duration": 411,
        "title": "non irure adipisicing",
        "description": "Non tempor eiusmod Lorem incididunt laborum eu nisi cupidatat nostrud laborum sunt esse aliquip officia. Nisi consectetur ad non cillum sunt nostrud cillum mollit. Consectetur mollit et esse est nisi aliquip exercitation fugiat.\r\nFugiat aliquip nulla ex consequat. Laborum veniam excepteur fugiat excepteur dolore quis magna est mollit exercitation Lorem consectetur ullamco magna. Amet occaecat fugiat dolore amet ullamco voluptate nulla sit voluptate anim minim voluptate reprehenderit. Laboris id commodo tempor sint reprehenderit consectetur eu. Laborum commodo proident est ea officia mollit deserunt Lorem ut tempor eu duis tempor eiusmod. Fugiat elit nisi qui anim duis magna amet officia aute aliquip eiusmod aliqua ad minim. Et eu commodo sint ex consectetur cupidatat excepteur.\r\nNisi ex minim aliquip enim laboris qui et enim nisi. Anim irure in occaecat in magna non est laboris. Dolor velit voluptate do laboris eiusmod est laboris anim dolore. Excepteur aute aliqua culpa cillum et eu Lorem voluptate enim exercitation in.\r\nNostrud dolore tempor nisi sit pariatur voluptate velit pariatur magna pariatur. Proident dolore ex ex deserunt exercitation veniam in pariatur nisi consequat et reprehenderit eiusmod. Eu laboris voluptate fugiat aliqua do laborum sit amet esse ad deserunt labore veniam. Mollit laboris ut minim consequat laborum et ea do esse labore velit eu fugiat nisi. Deserunt officia magna ullamco amet laborum ea culpa laboris labore nulla fugiat et. Esse id adipisicing commodo cillum nisi laborum do cillum tempor non excepteur non.\r\nExcepteur ea nostrud cupidatat tempor cillum. Amet enim eu incididunt minim in est sit est ut deserunt voluptate aliqua. Dolor Lorem enim sint incididunt. Pariatur occaecat amet elit excepteur fugiat sint id Lorem. Anim laborum sint et id amet cillum ea irure et in officia do. Sint elit labore sunt in ex qui commodo duis pariatur magna esse anim ex excepteur. Do cillum consequat culpa minim incididunt Lorem.\r\nDeserunt est fugiat pariatur id ex. Et qui commodo ipsum non. Consectetur commodo culpa Lorem ex ullamco dolor anim. Magna exercitation voluptate anim sunt fugiat ullamco cupidatat labore culpa consequat deserunt magna dolore. Aliqua non minim consequat incididunt nulla in veniam fugiat sit ad aliqua. Minim Lorem in deserunt occaecat sit deserunt minim proident do magna est Lorem eu incididunt.\r\nProident deserunt irure incididunt nulla in labore do adipisicing reprehenderit aliquip velit reprehenderit cupidatat. Eiusmod cupidatat dolore non laborum dolor labore consectetur sunt consequat excepteur voluptate qui laboris qui. Tempor anim exercitation ullamco ad quis qui. Ea ut culpa commodo excepteur anim officia dolor nulla reprehenderit aliqua quis enim. Reprehenderit qui eu eiusmod et ea excepteur ea est tempor esse excepteur amet. Dolore ad fugiat velit voluptate incididunt aute magna sit reprehenderit voluptate enim minim. Consequat occaecat excepteur exercitation consequat.\r\nNisi exercitation labore anim do ullamco non labore ut cillum culpa cillum culpa. Elit incididunt aute id eu ad. Ipsum veniam ex est deserunt anim ad do est in amet velit. Ad quis veniam do laboris in mollit aliquip esse minim et aute enim incididunt.\r\nAdipisicing dolor Lorem veniam do aliquip deserunt duis ex ex fugiat sunt nostrud ex. Dolor aliquip nostrud ea eiusmod nulla amet minim minim consectetur consequat et eiusmod consectetur. Enim quis do et anim ea commodo exercitation aliqua ut ut.\r\nConsectetur veniam sunt commodo dolore cillum duis consequat mollit aute. Est pariatur labore ullamco qui aute qui labore qui. Velit in id nulla ullamco veniam reprehenderit nisi ipsum proident adipisicing veniam enim sint qui. Ut mollit sint reprehenderit tempor labore. Laborum laborum mollit adipisicing Lorem.\r\nAmet officia sint velit sunt irure ex deserunt sit incididunt qui ex non cillum ullamco. Excepteur anim ea culpa sint tempor aliqua Lorem laboris. Nisi reprehenderit in mollit et velit aliquip aliqua commodo ut adipisicing sit incididunt anim.\r\nCupidatat do Lorem eu esse cillum voluptate. Cillum voluptate consequat do commodo commodo dolor. Fugiat excepteur magna ullamco voluptate pariatur veniam pariatur laborum anim deserunt. Id ipsum enim adipisicing cillum anim irure ut exercitation aliqua excepteur consequat duis consequat elit. Eu ut cillum excepteur reprehenderit sint duis laborum laborum.\r\nDeserunt nulla veniam ut nulla excepteur laborum incididunt adipisicing amet ut proident. Velit non sint eiusmod non consequat cillum. Amet magna sunt dolor reprehenderit minim excepteur.\r\nLorem est reprehenderit nisi culpa id laborum nulla cupidatat duis laboris consequat. Aliqua nisi minim qui commodo consequat veniam quis voluptate deserunt. Nostrud cillum adipisicing proident sint quis nulla ad quis velit ullamco ullamco. Laborum sit commodo magna Lorem excepteur proident. Deserunt nulla est sit non dolor. Sint nulla excepteur tempor cillum ut eu. Id ipsum elit cupidatat aliquip occaecat nisi minim id dolor.\r\nSint non pariatur nostrud reprehenderit consequat labore. Reprehenderit commodo aliqua nostrud officia anim ex laborum ad velit qui aute aliquip labore. Nulla deserunt nostrud adipisicing duis quis consequat laborum cupidatat duis exercitation quis.\r\n",
        "rating": 17,
        "language": "Fra",
        "difficulty": "For All",
        "type": "Training",
        "isFavorite": true
    },
    {
        "_id": "5b66c10eaa7ec140288e9303",
        "trainers": [
            {
                "id": "5b66c10e28d1cb2ccc2986e9",
                "name": "Magdalena Joyce",
                "avatar": "https://randomuser.me/api/portraits/men/42.jpg"
            },
            {
                "id": "5b66c10eb27b4f554ca49575",
                "name": "Rhodes Finley",
                "avatar": "https://randomuser.me/api/portraits/women/56.jpg"
            },
            {
                "id": "5b66c10ed5d2cb6b4c06088e",
                "name": "Latonya Hamilton",
                "avatar": "https://randomuser.me/api/portraits/women/47.jpg"
            },
            {
                "id": "5b66c10e2e04badb48759de3",
                "name": "Santiago Gardner",
                "avatar": "https://randomuser.me/api/portraits/men/27.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=1",
        "date": "2018-11-05T02:11:28",
        "duration": 167,
        "title": "veniam consectetur duis id laboris anim magna pariatur nulla consectetur",
        "description": "Voluptate deserunt ipsum eiusmod minim ex proident ipsum qui culpa. Minim amet aliquip dolore ea. Culpa aliquip mollit nulla sint exercitation laboris cillum. Fugiat eu pariatur officia fugiat. Ut excepteur culpa sunt non proident nulla nostrud nisi. Irure sit duis incididunt nostrud consectetur cupidatat reprehenderit ex ipsum proident.\r\nNostrud adipisicing ullamco et deserunt do magna ullamco ad nulla culpa veniam dolor occaecat. Veniam sit officia aliquip ex incididunt sit minim esse occaecat qui. Laboris cillum anim adipisicing exercitation magna aute esse commodo laborum cupidatat velit minim officia. Amet duis mollit velit consectetur ex elit. Cillum eiusmod aute est commodo consequat Lorem id ipsum Lorem sint laborum cupidatat pariatur veniam.\r\nAmet fugiat reprehenderit Lorem cupidatat anim aliquip. Lorem nisi sit pariatur eiusmod. Tempor amet quis ullamco adipisicing ipsum aute duis deserunt amet incididunt qui nulla magna consequat. Id nisi excepteur laborum tempor Lorem proident esse. Duis amet magna dolore veniam et quis elit nulla excepteur nostrud proident. Sit est quis reprehenderit dolor id in nostrud consectetur quis cillum commodo culpa.\r\nAliqua id culpa adipisicing laborum nostrud cupidatat cupidatat do ipsum mollit proident culpa Lorem. Proident excepteur nostrud voluptate dolor dolor. Labore enim dolor cillum laborum duis dolore officia proident in proident cupidatat qui fugiat officia. Tempor sit anim qui non cupidatat non.\r\nEu nisi pariatur nisi laboris eiusmod irure deserunt aute enim. Reprehenderit occaecat cupidatat sunt cupidatat. Voluptate aute do qui laboris commodo occaecat duis fugiat incididunt nostrud velit ipsum tempor magna. Veniam deserunt excepteur pariatur nulla in pariatur mollit voluptate. Sunt ea eiusmod sint cupidatat ex tempor ut exercitation pariatur labore cillum. Voluptate tempor in duis labore magna consequat velit id labore laboris.\r\nCillum sunt duis dolore minim non ea labore exercitation adipisicing officia. Dolor et dolore irure fugiat incididunt ut eu anim duis labore. Ad enim laboris consectetur elit incididunt officia veniam veniam magna sit ipsum voluptate ullamco.\r\nAliquip anim eu amet culpa eiusmod nostrud. Veniam nostrud eu ut do nisi labore. Magna minim qui in in sunt. Consequat irure velit cupidatat deserunt cupidatat ex enim aliquip exercitation. Sit velit ad id elit sit commodo. Exercitation minim nisi mollit anim dolor eiusmod aliqua aute Lorem enim aliquip.\r\nPariatur nulla incididunt ut eiusmod ipsum pariatur elit sit irure veniam incididunt dolore eu. Nostrud fugiat reprehenderit sit consequat deserunt consectetur irure eu mollit reprehenderit sit laboris elit. Ex reprehenderit enim irure commodo eiusmod nisi sint amet excepteur incididunt. Id et labore esse dolor esse excepteur eu reprehenderit Lorem magna laboris veniam incididunt duis. Id ut sit veniam aliquip exercitation ea duis mollit proident tempor exercitation eiusmod. Ex deserunt sint nulla cupidatat velit nulla. Laborum exercitation sint Lorem esse ad aliqua velit ullamco dolor id nulla.\r\nNisi fugiat irure laboris veniam eu consectetur nisi. Exercitation do non ipsum anim incididunt voluptate sit ipsum commodo. Consequat culpa deserunt nostrud enim reprehenderit nisi fugiat.\r\nQui occaecat sint pariatur enim mollit ea ad officia amet laborum ad sunt aute do. Sint cupidatat aute ex aliqua aliqua aute nostrud do ut nulla quis cupidatat cillum proident. Pariatur consectetur et ex amet voluptate minim incididunt aliqua quis laboris aute enim. Reprehenderit deserunt consequat dolore consequat ut aliquip proident aute tempor enim dolor eiusmod commodo qui. Sunt cupidatat velit ut ipsum in officia tempor consequat fugiat. Ex sit ad adipisicing est officia dolor laboris amet nostrud voluptate cillum enim. Ut dolor enim velit commodo in.\r\nIrure deserunt eiusmod voluptate qui. Nulla reprehenderit labore culpa irure ipsum. Duis eu commodo cupidatat ipsum tempor deserunt ut esse deserunt eiusmod ullamco consectetur. Duis dolore consectetur mollit dolor reprehenderit do velit consequat deserunt pariatur sunt nulla fugiat id. Consectetur laboris sunt consectetur nisi sit do do irure occaecat tempor qui irure Lorem.\r\n",
        "rating": 29,
        "language": "Eng",
        "difficulty": "Expert",
        "type": "Seminar",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e55df7d9128451239",
        "trainers": [
            {
                "id": "5b66c10e296c35c7fb6cd7e2",
                "name": "Tessa Weber",
                "avatar": "https://randomuser.me/api/portraits/women/11.jpg"
            },
            {
                "id": "5b66c10eef0bae0b0f015506",
                "name": "Kris Ayers",
                "avatar": "https://randomuser.me/api/portraits/women/5.jpg"
            },
            {
                "id": "5b66c10ef0c286dfa305d413",
                "name": "Samantha Dotson",
                "avatar": "https://randomuser.me/api/portraits/men/30.jpg"
            },
            {
                "id": "5b66c10e481f79ad6a2da8b6",
                "name": "Eliza Rowland",
                "avatar": "https://randomuser.me/api/portraits/women/62.jpg"
            },
            {
                "id": "5b66c10e892376799be16f87",
                "name": "Sabrina Skinner",
                "avatar": "https://randomuser.me/api/portraits/women/66.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=11",
        "date": "2018-08-20T11:03:27",
        "duration": 143,
        "title": "adipisicing consectetur dolore anim",
        "description": "Irure fugiat minim nulla eu veniam do voluptate qui qui occaecat. Laborum velit Lorem magna sunt culpa excepteur anim reprehenderit cillum. Irure sit adipisicing ut velit cillum amet consectetur cupidatat tempor dolore magna anim ullamco dolor. Elit sunt aute veniam officia ullamco commodo sit aute dolor. Dolor reprehenderit aliquip ullamco voluptate in veniam pariatur aliquip.\r\nIrure ex ipsum fugiat qui sit magna laborum quis eiusmod. Adipisicing veniam magna ut non officia minim duis ex sunt. Aliqua veniam laboris adipisicing consectetur fugiat quis minim dolor elit. Amet amet laborum consequat consectetur officia elit. Laborum id consectetur quis adipisicing reprehenderit sit adipisicing dolore. Culpa velit voluptate aliqua consectetur commodo non ex aliqua reprehenderit nulla laborum laboris esse. Veniam voluptate sunt magna irure voluptate duis.\r\nSunt eu magna quis commodo reprehenderit nostrud culpa dolor duis ipsum officia do. Mollit sunt aliquip pariatur ullamco velit officia aute aliquip fugiat aute qui eiusmod. Tempor veniam nostrud nisi occaecat incididunt adipisicing reprehenderit culpa in cupidatat sit consectetur dolore. In ea consectetur elit minim culpa enim Lorem Lorem voluptate culpa. Exercitation id duis anim ullamco aliquip aliquip tempor eiusmod do tempor dolore amet. Et consequat officia ad elit sunt anim deserunt tempor do.\r\n",
        "rating": 21,
        "language": "Rus",
        "difficulty": "Expert",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10ed2e673f8aac1e3c4",
        "trainers": [
            {
                "id": "5b66c10e1b89dbcfabc5dced",
                "name": "Laurel Cannon",
                "avatar": "https://randomuser.me/api/portraits/men/69.jpg"
            },
            {
                "id": "5b66c10e7ed7dcd17b99b70e",
                "name": "Jamie Rosales",
                "avatar": "https://randomuser.me/api/portraits/women/66.jpg"
            },
            {
                "id": "5b66c10e47416116c310112f",
                "name": "Sarah Poole",
                "avatar": "https://randomuser.me/api/portraits/men/2.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=20",
        "date": "2018-12-26T01:05:23",
        "duration": 25,
        "title": "irure in id nisi",
        "description": "Minim elit anim dolore nostrud ad aliqua veniam occaecat fugiat pariatur. Minim amet duis voluptate cupidatat commodo cillum do excepteur. Est quis quis fugiat ut do fugiat voluptate pariatur ipsum dolor in excepteur.\r\nEsse non eu eu mollit cillum aute veniam. Ullamco sit proident aliqua incididunt officia enim enim. Exercitation minim in occaecat in nulla veniam mollit Lorem sit laborum sunt magna sint adipisicing. Amet consequat ipsum est nisi veniam laboris adipisicing cillum do qui ut eiusmod. Exercitation sunt eiusmod ad sunt ea exercitation id amet occaecat.\r\nVoluptate sint Lorem excepteur quis occaecat magna quis elit ea. Aute cillum incididunt exercitation non veniam pariatur magna officia et laborum qui. Labore amet eu elit aliqua ipsum anim. Minim cillum exercitation laborum consequat dolore. Sunt ex enim ex laborum occaecat id. Eiusmod officia ipsum dolor nostrud. Non eu et nulla elit est nisi velit aute officia adipisicing veniam ex.\r\nTempor reprehenderit et amet elit ipsum non labore cupidatat excepteur quis proident cillum laborum quis. Sint cupidatat sunt eu cupidatat anim. Ullamco do mollit Lorem pariatur. Ut ut qui sunt officia proident velit duis tempor consequat ut officia nulla. Exercitation irure culpa cillum officia incididunt nisi in sunt et. Sit voluptate cupidatat occaecat laborum nisi non quis duis deserunt esse dolore ut.\r\nAliqua ad ex reprehenderit reprehenderit nostrud in tempor. Commodo mollit in do dolor proident consectetur exercitation occaecat aliquip consectetur veniam deserunt. Minim incididunt ex tempor reprehenderit amet sunt aute aliqua aute ex irure do sunt. Nostrud minim exercitation laborum dolore pariatur tempor deserunt commodo adipisicing. Pariatur qui nulla anim in in reprehenderit occaecat eiusmod qui incididunt laborum. Ad dolore deserunt exercitation occaecat eiusmod enim exercitation.\r\nSint dolor dolore laboris veniam occaecat sunt id ipsum incididunt aliquip et quis id est. Dolor eiusmod ipsum non laboris aliquip. Ut enim nulla duis tempor nisi in aute enim minim sunt sint Lorem adipisicing officia. Anim consequat veniam nulla mollit consequat proident id sint. Fugiat esse laboris dolore reprehenderit enim officia adipisicing occaecat. Exercitation adipisicing nisi deserunt velit.\r\nEnim culpa est eiusmod qui adipisicing. Qui esse excepteur pariatur quis pariatur laboris laborum irure deserunt reprehenderit mollit dolor occaecat ipsum. Excepteur nostrud veniam et nostrud aliquip qui laborum magna esse magna cillum elit consectetur labore. Enim velit ullamco officia ad officia reprehenderit enim irure. Fugiat irure consectetur ad sunt sint.\r\nNostrud Lorem commodo ea do ut aute ex elit in duis do in id reprehenderit. Do consequat velit nisi magna adipisicing officia magna irure eiusmod labore dolore. Cupidatat aliqua cupidatat pariatur culpa aute aliquip proident amet. Ullamco reprehenderit proident eiusmod in. Ut aute ad eiusmod veniam laborum ipsum ad proident reprehenderit non quis quis nostrud.\r\nCulpa et Lorem ipsum tempor sit amet tempor non incididunt eu adipisicing. Quis adipisicing qui cupidatat est ipsum laborum exercitation. Enim id veniam nulla irure ex exercitation cupidatat exercitation in incididunt ex exercitation. Anim culpa aliqua cillum labore anim dolore excepteur sunt. Amet consectetur incididunt tempor mollit ex consequat occaecat cupidatat. Veniam do enim excepteur excepteur consequat eiusmod proident exercitation cupidatat velit reprehenderit occaecat nulla. Eu consectetur cillum tempor consectetur laborum do voluptate occaecat qui laborum.\r\nCupidatat excepteur pariatur et dolor aute cupidatat amet. Sunt id magna in ex. Cupidatat magna aute anim et tempor. Amet dolor ullamco dolore sint ipsum ad. Qui adipisicing elit culpa nisi proident amet in. Id culpa commodo irure ex ad id laborum nostrud est minim culpa amet. Labore cillum voluptate in ex.\r\nAd labore veniam anim excepteur consequat pariatur non aliqua esse occaecat. Mollit magna tempor dolore adipisicing. Laboris labore fugiat est id reprehenderit est qui ut adipisicing culpa.\r\nDo est ex id do magna duis velit. Nostrud qui qui cupidatat in. Veniam dolore officia Lorem adipisicing cupidatat mollit ullamco ipsum ex. In ex nostrud eu reprehenderit occaecat eiusmod id velit ipsum aliquip cillum aliqua sunt sunt. Mollit aliquip officia tempor elit elit non adipisicing ipsum non sit adipisicing qui occaecat Lorem. Elit adipisicing aute commodo ipsum.\r\n",
        "rating": 28,
        "language": "Esp",
        "difficulty": "Novice",
        "type": "Training",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e19946578c48157e1",
        "trainers": [
            {
                "id": "5b66c10e0bda75457dffc26a",
                "name": "Gilliam Rose",
                "avatar": "https://randomuser.me/api/portraits/men/49.jpg"
            },
            {
                "id": "5b66c10eef01aeed044f7cd2",
                "name": "Jolene Summers",
                "avatar": "https://randomuser.me/api/portraits/men/50.jpg"
            },
            {
                "id": "5b66c10ed46cec494fb66820",
                "name": "Kathy Harding",
                "avatar": "https://randomuser.me/api/portraits/men/29.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=18",
        "date": "2018-11-04T08:46:14",
        "duration": 466,
        "title": "elit ea ipsum",
        "description": "Excepteur ex tempor veniam ullamco ullamco in culpa pariatur commodo aute. Consequat veniam velit irure enim. Laborum irure reprehenderit do culpa proident cupidatat sint et ea pariatur. Esse aliquip fugiat Lorem non eiusmod est elit labore voluptate voluptate. Qui Lorem ex tempor elit et amet anim fugiat enim cupidatat velit aute. Nulla reprehenderit aliquip exercitation officia. Laborum fugiat ipsum officia mollit ut quis laboris.\r\nId cillum non minim aliqua consequat ipsum excepteur aute anim excepteur ad est. Sit voluptate culpa ut mollit quis sit velit sunt ex mollit est quis dolore. Irure eu anim ut irure cillum sit. Incididunt est sint officia esse excepteur veniam duis. Anim in exercitation commodo laboris do ipsum eu Lorem minim id. Nisi ex non pariatur excepteur. Dolore nostrud eiusmod deserunt nisi aliquip proident culpa ad nostrud est reprehenderit et eu velit.\r\nNon esse velit aliquip id enim. Duis duis et sunt sint enim eu aliqua minim Lorem id et et enim. Dolore consectetur in pariatur et pariatur voluptate ex nisi. Voluptate anim eiusmod et laborum ut exercitation aliquip et qui proident eiusmod pariatur. Ad sunt amet magna id duis.\r\nEnim minim aliqua consectetur est consectetur eiusmod aliqua eu velit. Adipisicing amet irure laboris consequat. Id laboris tempor sint excepteur laborum adipisicing labore fugiat excepteur. Dolor officia sunt cillum quis esse irure eu irure.\r\nNulla consectetur do nulla dolore officia magna quis occaecat ullamco fugiat. Consectetur incididunt irure amet deserunt pariatur nostrud sit tempor. Adipisicing commodo amet dolor qui. Adipisicing incididunt cillum sunt proident nostrud fugiat proident consequat consectetur veniam amet consectetur.\r\n",
        "rating": 18,
        "language": "Fra",
        "difficulty": "For All",
        "type": "Video course",
        "isFavorite": false
    },
    {
        "_id": "5b66c10eb02ff45f9663ec7b",
        "trainers": [
            {
                "id": "5b66c10e32cf4cd903e471c0",
                "name": "Lenora Mathews",
                "avatar": "https://randomuser.me/api/portraits/women/33.jpg"
            },
            {
                "id": "5b66c10e7c681791cd547d7c",
                "name": "Peters Rodriguez",
                "avatar": "https://randomuser.me/api/portraits/women/22.jpg"
            },
            {
                "id": "5b66c10e1ff5fa8b07e6b3a7",
                "name": "Kendra Kennedy",
                "avatar": "https://randomuser.me/api/portraits/men/54.jpg"
            },
            {
                "id": "5b66c10e1f8f2127f31dabe8",
                "name": "Whitney Brennan",
                "avatar": "https://randomuser.me/api/portraits/men/5.jpg"
            },
            {
                "id": "5b66c10e88f066e828900035",
                "name": "Cohen Weeks",
                "avatar": "https://randomuser.me/api/portraits/men/18.jpg"
            },
            {
                "id": "5b66c10ee49ac8cf0a8e584d",
                "name": "Cox Gould",
                "avatar": "https://randomuser.me/api/portraits/men/44.jpg"
            },
            {
                "id": "5b66c10e83cb7502ce8c9491",
                "name": "Acevedo Britt",
                "avatar": "https://randomuser.me/api/portraits/women/62.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=14",
        "date": "2018-12-02T02:08:36",
        "duration": 362,
        "title": "nostrud excepteur dolore in excepteur officia cupidatat qui ea",
        "description": "Sunt ipsum commodo cupidatat excepteur reprehenderit culpa Lorem ex nulla esse qui cillum elit minim. Nostrud anim magna ex deserunt laborum exercitation dolore adipisicing deserunt minim reprehenderit enim. Sit cupidatat id minim officia id.\r\nDuis velit aliqua pariatur excepteur velit esse velit laboris cillum ullamco mollit id voluptate. Nulla in elit laboris sit velit eiusmod eiusmod ullamco dolore nostrud proident aliqua reprehenderit. Cillum eiusmod incididunt aute officia irure. Quis ea culpa incididunt aliqua laboris commodo ut ipsum minim. Enim fugiat ullamco est minim laborum culpa.\r\nAute Lorem ipsum anim id irure ipsum cillum Lorem nulla ipsum. Aute occaecat ad deserunt esse tempor in magna. Et voluptate labore dolore deserunt fugiat aliqua. Ea elit qui eiusmod occaecat occaecat magna tempor laborum elit laboris Lorem ut.\r\nLabore irure dolor duis ex labore. Incididunt tempor esse veniam aliqua officia mollit nisi reprehenderit fugiat. Anim cillum ex aliquip mollit magna veniam nostrud. Nostrud velit cillum dolore ex minim aute. Veniam cillum laboris non elit excepteur et. Occaecat anim excepteur occaecat ex. Lorem laboris nisi irure exercitation mollit in minim ut culpa eu.\r\nEsse do occaecat commodo excepteur aute proident laboris nisi officia. Veniam qui incididunt consectetur magna cillum officia. Lorem laborum veniam id laboris deserunt nisi exercitation amet. Id pariatur pariatur voluptate excepteur quis ea occaecat commodo deserunt consequat est excepteur. Ut consequat deserunt occaecat consectetur culpa adipisicing aliqua ullamco ipsum proident.\r\n",
        "rating": 32,
        "language": "Rus",
        "difficulty": "Advanced",
        "type": "Video course",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e84fc9e9c0f2e5572",
        "trainers": [
            {
                "id": "5b66c10e9573aa2cfcb35a50",
                "name": "Lauren Pate",
                "avatar": "https://randomuser.me/api/portraits/men/43.jpg"
            },
            {
                "id": "5b66c10ebe98e83c5354c145",
                "name": "May Rhodes",
                "avatar": "https://randomuser.me/api/portraits/men/18.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=11",
        "date": "2018-12-11T10:11:04",
        "duration": 295,
        "title": "nulla labore consectetur voluptate fugiat adipisicing",
        "description": "Irure irure cupidatat exercitation adipisicing ex eu. Est sit dolore anim duis adipisicing ullamco commodo enim Lorem mollit sunt. Dolor sit ad sint exercitation laborum. Sunt ut reprehenderit eiusmod ea. Laborum incididunt commodo occaecat laboris magna nisi quis sunt voluptate cillum cillum ad. Est velit velit eu est dolor enim ea amet. Aliquip do aute commodo adipisicing laboris eiusmod occaecat aliqua.\r\nDolor irure cupidatat culpa ea voluptate officia ad occaecat proident sit dolor elit Lorem. Magna occaecat nulla reprehenderit dolor veniam duis mollit nostrud consectetur fugiat aute adipisicing nostrud mollit. Eiusmod consectetur consectetur ut cillum. Tempor commodo ipsum est enim. In sint amet minim amet id consequat reprehenderit. Aliquip ut in velit aute aute tempor laboris cupidatat. Labore excepteur nulla sint aute.\r\nReprehenderit ullamco dolore dolor anim non adipisicing in proident. Labore nostrud magna id nisi Lorem eiusmod adipisicing ea nulla excepteur et dolore eiusmod do. Reprehenderit sit qui nostrud reprehenderit incididunt. Nulla enim laboris irure ea ex cupidatat anim ea ullamco. Officia ad magna incididunt esse laborum proident reprehenderit voluptate dolore aliquip dolore eu id.\r\nExercitation veniam consequat in proident magna. Id commodo eu minim exercitation est esse tempor aute sit reprehenderit Lorem. Velit nulla in enim velit. Ex consectetur ad laboris exercitation excepteur duis quis irure ad ullamco exercitation incididunt laboris. Cillum amet sunt laboris voluptate nisi officia amet eu incididunt reprehenderit ipsum ipsum culpa. Qui nulla ullamco non id officia id nostrud ad officia magna velit aliqua id anim. Anim ullamco nisi officia excepteur do aliqua ex voluptate sit voluptate irure velit consectetur in.\r\nOfficia duis ad sunt incididunt id fugiat adipisicing nulla mollit nulla tempor sit. Exercitation fugiat eu dolor sint aliqua amet exercitation veniam et consequat dolore veniam sint mollit. Aliquip est cillum velit ullamco nostrud. Elit culpa mollit anim eu reprehenderit ad enim. In sint excepteur amet irure. Mollit qui cillum irure aute.\r\nAmet fugiat id occaecat aliquip sit consectetur veniam adipisicing do fugiat. Excepteur consectetur Lorem cillum eiusmod commodo quis. Enim minim id veniam id sunt nulla nulla. Proident ullamco voluptate do minim. Cupidatat consectetur ipsum aliqua eiusmod nulla incididunt laboris voluptate cupidatat nulla. Ullamco commodo Lorem cupidatat cillum sint ut laborum ullamco. Cupidatat qui eiusmod enim ex excepteur mollit non labore.\r\nExercitation aute enim occaecat nisi deserunt eiusmod ad aliquip voluptate laborum. Officia quis laborum laborum nostrud exercitation voluptate ipsum in ipsum mollit culpa enim ad non. Sunt minim tempor pariatur et amet.\r\nId reprehenderit ullamco in occaecat minim laborum consectetur sunt reprehenderit magna nostrud ad ipsum eiusmod. Esse culpa esse esse aliquip ea deserunt enim occaecat consectetur. Minim voluptate do in enim occaecat labore commodo minim eiusmod.\r\nDolore exercitation eiusmod eu voluptate aliqua ipsum id id. Ipsum irure do eu cupidatat pariatur. Culpa dolore ullamco qui labore. Id anim officia adipisicing ut magna enim. Laborum voluptate do magna ex magna non pariatur voluptate et velit esse duis minim. Eiusmod aute ut commodo tempor.\r\nDolore nulla cillum adipisicing cillum est enim nisi qui tempor aliquip. Nostrud occaecat quis veniam culpa culpa ullamco deserunt. Eu enim duis laboris amet.\r\nEa ad tempor do deserunt nostrud. Non pariatur nostrud adipisicing ad ad laboris et nisi qui sint labore amet. Excepteur sint esse ea ad veniam mollit anim fugiat deserunt.\r\nUllamco laborum enim tempor magna amet ut amet amet esse ullamco sunt irure deserunt. Sint ad ipsum non id laboris aliqua qui aliquip aliqua Lorem duis adipisicing irure laborum. Exercitation qui qui incididunt irure minim eu occaecat mollit elit dolor. Adipisicing sunt enim tempor duis laborum fugiat magna anim. Nostrud culpa non sunt amet irure adipisicing ea do nulla ullamco non qui id elit. Fugiat labore excepteur laboris ea. Proident ullamco aliqua enim voluptate nostrud amet.\r\n",
        "rating": 18,
        "language": "Rus",
        "difficulty": "Intermediate",
        "type": "Lecture",
        "isFavorite": true
    },
    {
        "_id": "5b66c10ed97d780052a20d5b",
        "trainers": [
            {
                "id": "5b66c10e9e89a5db59181000",
                "name": "Charlotte Dalton",
                "avatar": "https://randomuser.me/api/portraits/women/18.jpg"
            },
            {
                "id": "5b66c10ecd4f73fe6e99fad7",
                "name": "Tiffany Simpson",
                "avatar": "https://randomuser.me/api/portraits/men/65.jpg"
            },
            {
                "id": "5b66c10e895302121855bd46",
                "name": "Mercado William",
                "avatar": "https://randomuser.me/api/portraits/men/24.jpg"
            },
            {
                "id": "5b66c10e41a618b9f2cd35a6",
                "name": "Palmer Russo",
                "avatar": "https://randomuser.me/api/portraits/men/53.jpg"
            },
            {
                "id": "5b66c10e90a41b267a51d2d3",
                "name": "Hurley Fitzpatrick",
                "avatar": "https://randomuser.me/api/portraits/men/14.jpg"
            },
            {
                "id": "5b66c10e770245f3c599ea98",
                "name": "Gladys Cleveland",
                "avatar": "https://randomuser.me/api/portraits/women/13.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=11",
        "date": "2018-08-16T05:11:42",
        "duration": 113,
        "title": "exercitation velit est ad ullamco",
        "description": "Ipsum fugiat aute do officia proident magna duis cupidatat amet commodo do anim anim laborum. Irure nostrud eu laborum labore qui. Id ea sit sunt culpa consequat non amet culpa incididunt. Aliquip officia sint voluptate non eiusmod in occaecat mollit nulla incididunt exercitation occaecat ad mollit. Anim aliquip culpa ipsum proident.\r\nNostrud laboris minim consectetur sint esse laboris pariatur eu aute laboris aliqua. Pariatur proident ipsum ut officia sint occaecat in qui laboris veniam. Ullamco cillum ipsum reprehenderit aute reprehenderit qui Lorem. Do minim laboris eiusmod adipisicing magna commodo. Veniam fugiat occaecat Lorem consectetur mollit voluptate est mollit sunt sunt magna reprehenderit commodo cupidatat. Ut deserunt id sunt ex ea mollit nisi sit anim id exercitation.\r\nAliqua esse in nostrud ex irure reprehenderit id occaecat incididunt exercitation ut. Incididunt ad excepteur do proident quis. Nisi qui aliquip minim irure consequat sunt. Adipisicing id non occaecat nostrud non est qui esse fugiat elit incididunt minim. Anim deserunt esse cillum eu exercitation nulla sunt laboris. Minim veniam aliquip dolore labore aliqua exercitation id aute.\r\nQuis velit dolor amet do sunt. Reprehenderit laborum nulla duis laborum. Labore enim et laborum veniam id irure minim anim enim.\r\nCillum aliquip aliqua et incididunt fugiat velit pariatur nulla duis. Anim aliqua eiusmod amet ea in irure. Est aliquip duis ea id. Elit elit sunt cupidatat veniam nostrud culpa qui. Aliqua sit duis cupidatat tempor eu occaecat voluptate ad aute cillum minim tempor. Ea deserunt tempor fugiat laborum anim fugiat do irure ex pariatur deserunt laboris. Exercitation irure duis deserunt laboris laborum laborum aliquip.\r\nDeserunt dolor ad consequat officia. Laboris non id irure incididunt duis reprehenderit cupidatat sit id. Enim duis id tempor adipisicing voluptate excepteur mollit deserunt sint fugiat minim nisi. Commodo duis fugiat anim eiusmod laborum aliquip. Laborum reprehenderit labore in in culpa enim cillum est nisi. Dolore labore duis ea excepteur reprehenderit non nisi eiusmod cillum anim officia occaecat veniam.\r\n",
        "rating": 20,
        "language": "Rus",
        "difficulty": "Novice",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e3da324c203ed91b9",
        "trainers": [
            {
                "id": "5b66c10e4777f02c7f820889",
                "name": "Bird Rice",
                "avatar": "https://randomuser.me/api/portraits/women/16.jpg"
            },
            {
                "id": "5b66c10ed233a807cdf4198c",
                "name": "Josephine Maldonado",
                "avatar": "https://randomuser.me/api/portraits/men/34.jpg"
            },
            {
                "id": "5b66c10e46aaa54c442e4e5b",
                "name": "Mary Dillon",
                "avatar": "https://randomuser.me/api/portraits/women/49.jpg"
            },
            {
                "id": "5b66c10ec977838add807499",
                "name": "Castillo Franks",
                "avatar": "https://randomuser.me/api/portraits/women/58.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=8",
        "date": "2018-11-14T12:40:55",
        "duration": 157,
        "title": "esse do voluptate",
        "description": "Eiusmod ullamco esse nostrud adipisicing amet qui officia proident magna non amet consequat. Officia mollit proident commodo dolor quis minim nisi nisi aliquip. Quis elit ipsum ex dolore reprehenderit. Eu qui voluptate ipsum occaecat magna ad enim reprehenderit exercitation est.\r\nQui eiusmod esse aliquip esse. Qui veniam dolor amet sit sunt eu labore aliqua sunt culpa. Sit eu anim incididunt nostrud tempor est commodo occaecat ipsum. Et ea cupidatat pariatur esse cupidatat cupidatat. Cupidatat dolor sunt laboris eiusmod do velit mollit voluptate eiusmod. Deserunt nisi consectetur deserunt qui cillum commodo ut ad Lorem ipsum sit. Elit incididunt eiusmod voluptate velit deserunt esse nisi ea ipsum.\r\nAute nisi incididunt magna amet deserunt dolore aute minim proident id. Cillum enim exercitation exercitation minim ad voluptate mollit et. Ex esse reprehenderit veniam anim do. Commodo dolor proident ipsum cillum magna nulla laborum exercitation ullamco est est esse. Exercitation cillum labore aliquip aute magna ea. Sit commodo enim laborum magna quis adipisicing sunt consectetur esse exercitation magna nostrud. Ipsum ullamco Lorem qui pariatur enim Lorem fugiat sunt ut.\r\nOfficia qui ex nulla sint occaecat amet incididunt. Occaecat magna nisi labore nisi reprehenderit ea aliqua laborum ad occaecat ad. Culpa sint deserunt exercitation fugiat aliquip dolore dolor. Ea ad ad est laboris ut ullamco laboris labore irure Lorem aliqua. Ex tempor sit dolor adipisicing occaecat commodo deserunt commodo. Dolor cupidatat et commodo officia duis. Eu in non culpa magna ipsum proident laborum laborum minim.\r\nPariatur ipsum culpa eu et aute sint. Duis sit nulla ad do consequat id dolor do qui id. Sit consequat commodo consequat irure excepteur consectetur sunt elit nostrud sit voluptate ad.\r\nOfficia commodo veniam elit aliqua cupidatat et minim sint ut. Aliqua aliqua excepteur ipsum tempor aliquip elit ut dolore consectetur. Nostrud aliquip reprehenderit laborum esse. Occaecat mollit mollit incididunt amet velit laborum reprehenderit. Ullamco aute non irure do. Labore pariatur aute cillum irure est laboris velit ut laborum.\r\nAnim non minim in esse ea anim pariatur excepteur nulla ipsum qui. Est occaecat enim labore veniam ullamco enim mollit. Occaecat ex quis id sunt sint in id exercitation dolor aliqua deserunt deserunt. Id ex nostrud minim Lorem consequat labore magna minim proident.\r\nDolore minim id enim nisi amet ad ullamco. Culpa consectetur occaecat velit minim est anim in non enim aliqua cupidatat laboris. Ullamco do mollit reprehenderit culpa ex ipsum ad deserunt aliqua occaecat eiusmod nisi ipsum commodo. Laborum aliqua aliquip cillum incididunt nulla exercitation quis voluptate voluptate eu mollit non. Ullamco mollit sunt ea dolor eu aute magna cupidatat aliquip commodo duis id laboris.\r\nVeniam sint Lorem id mollit nostrud est pariatur. Deserunt sint adipisicing officia cillum cupidatat ea ea qui adipisicing quis reprehenderit laborum cupidatat laboris. Esse cillum elit laboris magna deserunt ipsum et exercitation qui cupidatat aliqua sunt esse. Eiusmod nisi nisi Lorem est nisi aute in aliqua veniam eiusmod velit incididunt sunt. Incididunt pariatur consequat proident ea aliquip ullamco quis. Laborum cillum velit dolore dolore exercitation sint velit nulla in et velit duis.\r\nExercitation dolore cillum ut ullamco magna veniam adipisicing tempor duis aliquip ea tempor eu officia. Occaecat non occaecat veniam Lorem ad minim est voluptate officia veniam do voluptate dolor est. Est cupidatat enim aute non ipsum consectetur aute irure. Tempor sunt dolore pariatur sint eu. Nulla sunt pariatur aliqua eu culpa ad ipsum eu veniam. Adipisicing fugiat non sint commodo duis.\r\nConsectetur fugiat consequat culpa aliqua velit exercitation. Eiusmod do nulla amet anim voluptate veniam consequat anim fugiat amet aute nostrud voluptate. Quis deserunt pariatur veniam tempor exercitation cupidatat id adipisicing aute incididunt cillum amet nostrud. Incididunt commodo ex sint et adipisicing aliqua qui. Voluptate quis consequat Lorem aliqua sint ipsum elit qui aliqua consectetur. Ea reprehenderit nisi laboris amet enim id adipisicing dolore laborum duis.\r\nTempor tempor quis ipsum non. Nostrud anim ipsum culpa veniam ullamco quis anim. Exercitation aute nulla cillum ex consectetur ex sit elit exercitation. Deserunt adipisicing ut labore nostrud reprehenderit.\r\n",
        "rating": 12,
        "language": "Rus",
        "difficulty": "Expert",
        "type": "Lecture",
        "isFavorite": true
    },
    {
        "_id": "5b66c10e3607648c1ee5b2ee",
        "trainers": [
            {
                "id": "5b66c10e5e5aae8d073508ef",
                "name": "Spencer Koch",
                "avatar": "https://randomuser.me/api/portraits/men/61.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=14",
        "date": "2018-11-17T12:17:32",
        "duration": 249,
        "title": "irure non esse ea",
        "description": "Ex aute Lorem veniam id officia laboris. Ipsum occaecat do velit deserunt reprehenderit do ea commodo commodo qui laboris irure et duis. Et occaecat magna id cillum cillum aliquip consectetur ea minim in et duis. Enim cupidatat nisi ad qui irure. Fugiat reprehenderit sit aliquip dolore laboris fugiat duis. Tempor commodo commodo sint culpa adipisicing.\r\nQui reprehenderit elit elit sit ipsum pariatur eiusmod elit non minim. Elit ex veniam consectetur sint deserunt irure incididunt. Nisi duis labore culpa sunt irure velit ut aliqua. Nostrud sit occaecat enim voluptate tempor reprehenderit. Ea esse ut culpa commodo adipisicing qui et proident nisi aliqua ex dolor. Minim proident laborum eu est velit sint velit voluptate consectetur. Ullamco aliquip nulla ea esse laborum cillum sunt.\r\nEu deserunt culpa dolor non tempor ad non nostrud veniam sit sint sit veniam excepteur. Quis officia veniam officia proident. Labore qui veniam non laboris esse incididunt esse officia labore fugiat labore. Ullamco do eu officia sint non Lorem irure ullamco qui sint dolore laborum sunt magna. Duis occaecat sint officia ad aute adipisicing exercitation non dolore.\r\nIrure id amet ad tempor duis incididunt ut voluptate pariatur veniam duis. Anim reprehenderit do do ad mollit consectetur ad irure deserunt nisi sit quis. Sit amet veniam ea ex laboris amet ex cupidatat ut dolor. Labore est id cillum ad ullamco ea. Duis non occaecat exercitation qui voluptate aute.\r\nNon id adipisicing deserunt excepteur do tempor non aute adipisicing ex. Nostrud proident velit anim occaecat aliqua duis irure Lorem. Esse labore voluptate laborum ea commodo esse ullamco ad anim cupidatat culpa dolore. Eiusmod voluptate aliqua voluptate pariatur consectetur anim sint nisi officia dolor consequat. Eu aliqua duis elit in tempor magna cillum elit proident nisi.\r\nMinim consequat adipisicing excepteur aute nulla non aute. Et sunt aliquip deserunt eu ut aliquip veniam irure ullamco. Ea aliquip velit cillum minim. Sint id nisi consequat cillum officia nostrud. Consectetur ullamco anim esse incididunt.\r\nTempor laborum amet quis enim. Sunt aliquip magna commodo in nostrud incididunt. Exercitation amet velit consectetur nulla velit Lorem tempor labore aliqua. Est nulla reprehenderit anim culpa nulla eiusmod ea est ullamco ullamco. Adipisicing magna officia irure fugiat id pariatur quis nostrud est.\r\nDuis ut id aute velit in nostrud ea. Adipisicing duis exercitation id qui Lorem. Incididunt et qui id ea laborum quis cillum ipsum veniam voluptate consequat proident voluptate laborum. Ad amet consectetur amet voluptate nostrud eiusmod velit aliquip laboris ipsum commodo sit commodo. Laborum esse tempor laboris dolor. Mollit occaecat fugiat nisi labore.\r\nEnim labore labore elit aliquip eu commodo ut. In labore Lorem tempor irure deserunt ipsum ex qui elit reprehenderit aliqua consequat. Commodo dolor nulla minim magna culpa labore mollit nostrud minim voluptate. Anim proident dolor elit tempor quis pariatur est. Do consectetur excepteur consequat tempor consequat duis. Aute minim aliquip incididunt proident enim officia occaecat eu amet exercitation nulla. Officia adipisicing aute nostrud dolor in fugiat cillum dolor ut do.\r\nNulla eu dolore fugiat deserunt duis non duis consectetur dolor culpa tempor magna adipisicing cillum. Occaecat commodo esse quis proident veniam est proident dolor in irure dolore. Magna velit in fugiat sunt amet officia irure sint ex tempor ipsum ullamco officia commodo.\r\nUt do Lorem reprehenderit ex id officia enim qui elit non amet ad labore anim. Velit ullamco exercitation consequat non eiusmod anim duis sit. Incididunt eiusmod ad sunt mollit magna nulla amet deserunt pariatur sint id nostrud. Voluptate est enim voluptate incididunt adipisicing deserunt eiusmod cillum eiusmod dolore irure qui veniam. Ad qui anim ex incididunt eu laborum excepteur. Aute minim labore consequat minim et aute dolor. Qui veniam ipsum ea incididunt cupidatat laboris fugiat ea adipisicing nisi consequat labore magna minim.\r\nAnim tempor Lorem amet aliqua exercitation. Consequat elit laboris incididunt ullamco. Ad deserunt ex ipsum sit. Proident occaecat duis officia occaecat. Incididunt Lorem minim do fugiat qui consectetur enim et nulla. Deserunt nisi laborum adipisicing est tempor culpa excepteur id et amet. Veniam aliqua ullamco sint exercitation ipsum velit et.\r\n",
        "rating": 32,
        "language": "Esp",
        "difficulty": "Advanced",
        "type": "Video course",
        "isFavorite": true
    },
    {
        "_id": "5b66c10ebf0e6180e61b69c1",
        "trainers": [
            {
                "id": "5b66c10e84d1a0af47433778",
                "name": "Elma Finch",
                "avatar": "https://randomuser.me/api/portraits/men/58.jpg"
            },
            {
                "id": "5b66c10e98dfcf4d61a9df91",
                "name": "Watson Greene",
                "avatar": "https://randomuser.me/api/portraits/men/55.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=2",
        "date": "2018-08-07T03:24:23",
        "duration": 27,
        "title": "et ipsum aliquip culpa fugiat minim cillum",
        "description": "Aliquip enim ea aliquip officia velit. Voluptate in voluptate cillum esse fugiat ex velit Lorem aute labore. Excepteur cupidatat in aute ipsum amet laboris sint et fugiat anim.\r\nNisi labore adipisicing eiusmod adipisicing eu incididunt mollit reprehenderit sint. Eu laborum do duis ex officia non consectetur irure amet amet laborum ipsum mollit. Consectetur Lorem officia Lorem magna qui aute reprehenderit ullamco qui. Ipsum Lorem do qui exercitation sunt. Dolor officia minim aute enim exercitation nulla amet anim magna fugiat quis ex mollit.\r\nIrure quis est nisi exercitation. Id sit proident sit deserunt. Voluptate adipisicing ad aliquip labore est. Enim magna est labore in consectetur occaecat minim ullamco enim reprehenderit aute.\r\nConsequat magna exercitation minim minim magna officia commodo duis fugiat labore fugiat irure sit officia. Cillum enim amet voluptate anim do fugiat nulla nulla non irure cupidatat duis esse. Id do eu dolor velit laboris. Dolore commodo reprehenderit veniam aute duis eu esse commodo velit in.\r\nNostrud laborum dolore amet irure elit aliquip est sunt. Esse aliqua laboris dolor tempor mollit aute elit irure in et laborum. Nulla exercitation laborum in occaecat tempor nostrud eiusmod minim esse duis ullamco. Sit culpa deserunt sunt nulla cupidatat commodo officia ut dolor sint. Officia in id deserunt ut cillum velit occaecat culpa.\r\nTempor excepteur quis velit deserunt. Cillum ipsum officia minim duis. Qui cillum anim id cupidatat ea tempor Lorem aute adipisicing minim.\r\nPariatur velit id id reprehenderit ullamco consectetur nulla pariatur amet est pariatur dolor. Aute nostrud elit amet ut aute excepteur ipsum velit occaecat aute excepteur culpa sint. Ipsum Lorem laborum velit veniam tempor aute elit Lorem pariatur eu consequat velit exercitation. Deserunt ea officia laboris reprehenderit aute irure ut dolor laborum ad nisi dolore in consectetur. Aliquip exercitation aliquip culpa fugiat et elit mollit ullamco excepteur. Cupidatat id magna enim aliquip nisi aliquip.\r\nEst irure velit commodo qui exercitation dolor aliqua reprehenderit consectetur anim aute. In exercitation officia incididunt esse culpa ex nisi consequat irure aliqua deserunt. Commodo voluptate commodo non proident culpa excepteur consectetur qui Lorem.\r\n",
        "rating": 25,
        "language": "Rus",
        "difficulty": "Novice",
        "type": "Seminar",
        "isFavorite": false
    },
    {
        "_id": "5b66c10e2c71bffc702695f7",
        "trainers": [
            {
                "id": "5b66c10e245634c6a9d516e3",
                "name": "Dixie Cervantes",
                "avatar": "https://randomuser.me/api/portraits/men/63.jpg"
            },
            {
                "id": "5b66c10eab63de559a0ba087",
                "name": "Hutchinson Larsen",
                "avatar": "https://randomuser.me/api/portraits/men/69.jpg"
            },
            {
                "id": "5b66c10e48fdbcc40f35fa52",
                "name": "Griffith Trevino",
                "avatar": "https://randomuser.me/api/portraits/men/55.jpg"
            },
            {
                "id": "5b66c10ea098ba177336c2e1",
                "name": "Shelley Mosley",
                "avatar": "https://randomuser.me/api/portraits/women/58.jpg"
            }
        ],
        "img": "https://loremflickr.com/500/300?random=4",
        "date": "2018-09-07T06:34:33",
        "duration": 486,
        "title": "ullamco deserunt officia sunt",
        "description": "Ut aliqua laboris minim dolor. Veniam eu sunt sint anim ullamco ut labore occaecat. Proident proident labore et qui aliquip duis duis aute mollit non enim reprehenderit. Enim aliqua eu est nostrud excepteur. Enim ullamco laboris aliqua officia ipsum nisi in sit.\r\nQui aliquip incididunt aliquip id fugiat. Anim enim sunt consequat ut elit commodo mollit magna Lorem culpa quis ullamco cupidatat cillum. Aliqua anim sunt reprehenderit fugiat Lorem culpa nisi voluptate exercitation quis non veniam. Aliqua occaecat cillum consequat veniam commodo nostrud. Dolor in cillum ullamco eu sunt officia consectetur. Aliqua sint irure officia irure et enim nostrud duis nisi aliquip aliqua do velit aliquip.\r\nMollit reprehenderit cupidatat amet ad pariatur incididunt aute et. Est cupidatat eiusmod incididunt sint laboris adipisicing pariatur consequat. Adipisicing et fugiat sit quis occaecat sunt veniam adipisicing aliqua veniam. Aute cupidatat enim ut officia minim sit amet aute aliquip veniam culpa.\r\nProident id qui irure elit adipisicing velit proident ea aliqua. Ad adipisicing elit veniam officia veniam aute veniam. Aliqua ullamco consectetur enim Lorem culpa labore aute eu ut tempor ipsum. Excepteur eiusmod exercitation ipsum consectetur id.\r\nConsectetur elit commodo reprehenderit enim culpa quis. Elit qui mollit qui dolore est anim est cupidatat cupidatat amet sit magna. Ad aliqua laborum nulla reprehenderit amet aliqua velit. Velit exercitation ex proident eu magna. Lorem deserunt aliquip dolore officia elit reprehenderit minim.\r\nPariatur commodo excepteur enim mollit aliquip sunt deserunt. Tempor consectetur ad sint consequat magna cillum fugiat. Anim eu adipisicing ea magna voluptate eu sunt amet officia ipsum aliquip. Officia in exercitation cupidatat duis. Eiusmod mollit do deserunt aute aute.\r\nCommodo quis anim amet veniam magna culpa magna ullamco nulla sunt enim eu consectetur commodo. Id sint anim sint commodo reprehenderit laborum incididunt adipisicing. Velit nostrud mollit ea aliquip velit labore ad cillum. Eiusmod occaecat deserunt laboris est sint. Ex aliqua culpa velit irure sit occaecat laboris culpa cillum ex sint do aliqua elit.\r\nEu laboris voluptate duis laborum commodo eiusmod officia. Consequat magna sit cillum ex culpa elit laboris proident velit sit pariatur. Velit nostrud quis ex minim excepteur.\r\nEa eu tempor pariatur cillum sit excepteur nostrud. Amet laboris aliquip veniam labore sint pariatur veniam et sunt proident laborum voluptate in eu. Ex nulla sunt ipsum veniam ipsum quis ullamco est ullamco adipisicing commodo.\r\nAdipisicing nulla adipisicing labore irure. Occaecat duis exercitation ullamco duis veniam velit deserunt qui laboris. Aliqua ut aliquip tempor aute ut aute elit mollit.\r\nAliqua voluptate mollit duis laboris ea eiusmod mollit. Reprehenderit reprehenderit culpa quis sint nostrud mollit ut commodo adipisicing cillum irure incididunt. Labore dolore exercitation est velit anim non incididunt dolore. Lorem est nulla reprehenderit consequat nisi ipsum id Lorem esse Lorem non. Ea aute est ipsum velit.\r\n",
        "rating": 47,
        "language": "Eng",
        "difficulty": "Expert",
        "type": "Seminar",
        "isFavorite": false
    }
]
